ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define ADC0CN_ADINT__BMASK           0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT           0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET         0x00 ///< ADC0 has not completed a conversion since the last
                                           ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET             0x20 ///< ADC0 completed a data conversion.                 
                                                                                                  
#define ADC0CN_ADBMEN__BMASK          0x40 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__SHIFT          0x06 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__BURST_DISABLED 0x00 ///< Disable ADC0 burst mode.                          
#define ADC0CN_ADBMEN__BURST_ENABLED  0x40 ///< Enable ADC0 burst mode.                           
                                                                                                  
#define ADC0CN_ADEN__BMASK            0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT            0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED         0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN_ADEN__ENABLED          0x80 ///< Enable ADC0 (active and ready for data            
                                           ///< conversions).                                     
                                                                                                  
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x1F ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select channel ADC0.0.        
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select channel ADC0.1.        
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select channel ADC0.2.        
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select channel ADC0.3.        
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select channel ADC0.4.        
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select channel ADC0.5.        
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select channel ADC0.6.        
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select channel ADC0.7.        
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select channel ADC0.12.       
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select channel ADC0.13.       
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select channel ADC0.14.       
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select channel ADC0.15.       
#define ADC0MX_ADC0MX__ADC0P16 0x10 ///< Select channel ADC0.16.       
#define ADC0MX_ADC0MX__ADC0P17 0x11 ///< Select channel ADC0.17.       
#define ADC0MX_ADC0MX__ADC0P18 0x12 ///< Select channel ADC0.18.       
#define ADC0MX_ADC0MX__ADC0P19 0x13 ///< Select channel ADC0.19.       
#define ADC0MX_ADC0MX__TEMP    0x1B ///< Temperature Sensor.           
#define ADC0MX_ADC0MX__VBAT    0x1C ///< VBAT Supply Voltage.          
#define ADC0MX_ADC0MX__LDO     0x1D ///< Internal LDO regulator output.
#define ADC0MX_ADC0MX__VDC     0x1E ///< VDC Supply Voltage.           
#define ADC0MX_ADC0MX__GND     0x1F ///< Ground.                       
                                                                       
//------------------------------------------------------------------------------
// ADC0PWR Enums (ADC0 Power Control @ 0xBA)
//------------------------------------------------------------------------------
#define ADC0PWR_ADPWR__FMASK              0x0F ///< Burst Mode Power Up Time                         
#define ADC0PWR_ADPWR__SHIFT              0x00 ///< Burst Mode Power Up Time                         
                                                                                                     
#define ADC0PWR_ADLPM__BMASK              0x80 ///< Low Power Mode Enable                            
#define ADC0PWR_ADLPM__SHIFT              0x07 ///< Low Power Mode Enable                            
#define ADC0PWR_ADLPM__LOW_POWER_DISABLED 0x00 ///< Disable low power mode.                          
#define ADC0PWR_ADLPM__LOW_POWER_ENABLED  0x80 ///< Enable low power mode (requires extended tracking
                                               ///< time).                                           
                                                                                                     
//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK 0x3F ///< Burst Mode Tracking Time
#define ADC0TK_ADTK__SHIFT 0x00 ///< Burst Mode Tracking Time
                                                             
//------------------------------------------------------------------------------
// AES0BCFG Enums (AES Block Configuration @ 0xE9)
//------------------------------------------------------------------------------
#define AES0BCFG_KSIZE__FMASK    0x03 ///< AES Key Size                                    
#define AES0BCFG_KSIZE__SHIFT    0x00 ///< AES Key Size                                    
#define AES0BCFG_KSIZE__128_BITS 0x00 ///< 128 bits (16 bytes).                            
#define AES0BCFG_KSIZE__196_BITS 0x01 ///< 198 bits (24 bytes).                            
#define AES0BCFG_KSIZE__256_BITS 0x02 ///< 256 bits (32 bytes).                            
                                                                                           
#define AES0BCFG_ENCMD__BMASK    0x04 ///< Encryption/Decryption Select                    
#define AES0BCFG_ENCMD__SHIFT    0x02 ///< Encryption/Decryption Select                    
#define AES0BCFG_ENCMD__DECRYPT  0x00 ///< Select a decryption operation.                  
#define AES0BCFG_ENCMD__ENCRYPT  0x04 ///< Select an encryption operation.                 
                                                                                           
