ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define AES0BCFG_START__BMASK    0x08 ///< AES Start                                       
#define AES0BCFG_START__SHIFT    0x03 ///< AES Start                                       
#define AES0BCFG_START__CLEAR    0x00 ///< Reset the AES module.                           
#define AES0BCFG_START__START    0x08 ///< Start an encryption or decryption operation.    
                                                                                           
#define AES0BCFG_BUSY__BMASK     0x10 ///< AES Busy                                        
#define AES0BCFG_BUSY__SHIFT     0x04 ///< AES Busy                                        
#define AES0BCFG_BUSY__NOT_SET   0x00 ///< The AES block is not completing an encryption or
                                      ///< decryption operation.                           
#define AES0BCFG_BUSY__SET       0x10 ///< The AES block is completing an encryption or    
                                      ///< decryption operation.                           
                                                                                           
#define AES0BCFG_DONE__BMASK     0x20 ///< Done Flag                                       
#define AES0BCFG_DONE__SHIFT     0x05 ///< Done Flag                                       
#define AES0BCFG_DONE__NOT_SET   0x00 ///< The encryption or decryption operation has not  
                                      ///< started or is in progress.                      
#define AES0BCFG_DONE__SET       0x20 ///< The encyrption or decryption operation is       
                                      ///< complete.                                       
                                                                                           
//------------------------------------------------------------------------------
// AES0BIN Enums (AES Block Input @ 0xEB)
//------------------------------------------------------------------------------
#define AES0BIN_AES0BIN__FMASK 0xFF ///< AES Block Input
#define AES0BIN_AES0BIN__SHIFT 0x00 ///< AES Block Input
                                                        
//------------------------------------------------------------------------------
// AES0DCFG Enums (AES Data Configuration @ 0xEA)
//------------------------------------------------------------------------------
#define AES0DCFG_XORIN__BMASK       0x01 ///< XOR Input Enable                                 
#define AES0DCFG_XORIN__SHIFT       0x00 ///< XOR Input Enable                                 
#define AES0DCFG_XORIN__DISABLED    0x00 ///< Disable the XOR data path of the AES input.      
#define AES0DCFG_XORIN__ENABLED     0x01 ///< Enable the XOR data path of the AES input.       
                                                                                               
#define AES0DCFG_OUTSEL__FMASK      0x06 ///< Output Data Select                               
#define AES0DCFG_OUTSEL__SHIFT      0x01 ///< Output Data Select                               
#define AES0DCFG_OUTSEL__DIRECT_OUT 0x00 ///< The AES0YOUT register targets the direct AES     
                                         ///< output data.                                     
#define AES0DCFG_OUTSEL__XOR_OUT    0x02 ///< The AES0YOUT register targets the AES output data
                                         ///< XORed with AES0XIN.                              
#define AES0DCFG_OUTSEL__KEY        0x04 ///< The AES0YOUT register targets the inverse key.   
                                                                                               
//------------------------------------------------------------------------------
// AES0KIN Enums (AES Key Input @ 0xED)
//------------------------------------------------------------------------------
#define AES0KIN_AES0KIN__FMASK 0xFF ///< AES Key Input
#define AES0KIN_AES0KIN__SHIFT 0x00 ///< AES Key Input
                                                      
//------------------------------------------------------------------------------
// AES0XIN Enums (AES XOR Input @ 0xEC)
//------------------------------------------------------------------------------
#define AES0XIN_AES0XIN__FMASK 0xFF ///< AES XOR Input
#define AES0XIN_AES0XIN__SHIFT 0x00 ///< AES XOR Input
                                                      
//------------------------------------------------------------------------------
// AES0YOUT Enums (AES Y Output @ 0xF5)
//------------------------------------------------------------------------------
#define AES0YOUT_AES0YOUT__FMASK 0xFF ///< AES Y Output
#define AES0YOUT_AES0YOUT__SHIFT 0x00 ///< AES Y Output
                                                       
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSBANK Enums (Program Space Bank Select @ 0x84)
//------------------------------------------------------------------------------
#define PSBANK_IFBANK__FMASK       0x03 ///< Instruction Fetch Operations Bank Select         
#define PSBANK_IFBANK__SHIFT       0x00 ///< Instruction Fetch Operations Bank Select         
#define PSBANK_IFBANK__INSTR_BANK0 0x00 ///< Instructions fetch from Bank 0 (note that Bank 0 
                                        ///< is also mapped between 0x0000 to 0x7FFF).        
#define PSBANK_IFBANK__INSTR_BANK1 0x01 ///< Instructions fetch from Bank 1.                  
#define PSBANK_IFBANK__INSTR_BANK2 0x02 ///< Instructions fetch from Bank 2.                  
#define PSBANK_IFBANK__INSTR_BANK3 0x03 ///< Instructions fetch from Bank 3.                  
                                                                                              
#define PSBANK_COBANK__FMASK       0x30 ///< Constant Operations Bank Select                  
#define PSBANK_COBANK__SHIFT       0x04 ///< Constant Operations Bank Select                  
#define PSBANK_COBANK__CONST_BANK0 0x00 ///< Constant operations target Bank 0 (note that Bank
                                        ///< 0 is also mapped between 0x0000 to 0x7FFF).      
#define PSBANK_COBANK__CONST_BANK1 0x10 ///< Constant operations target Bank 1.               
#define PSBANK_COBANK__CONST_BANK2 0x20 ///< Constant operations target Bank 2.               
#define PSBANK_COBANK__CONST_BANK3 0x30 ///< Constant operations target Bank 3.               
                                                                                              
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
