ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define CLKSEL_CLKRDY__BMASK          0x80 ///< System Clock Divider Clock Ready Flag             
#define CLKSEL_CLKRDY__SHIFT          0x07 ///< System Clock Divider Clock Ready Flag             
#define CLKSEL_CLKRDY__NOT_SET        0x00 ///< The selected clock divide setting has not been    
                                           ///< applied to the system clock.                      
#define CLKSEL_CLKRDY__SET            0x80 ///< The selected clock divide setting has been applied
                                           ///< to the system clock.                              
                                                                                                  
//------------------------------------------------------------------------------
// PCLKACT Enums (Peripheral Active Clock Enable @ 0xF5)
//------------------------------------------------------------------------------
#define PCLKACT_PCLKACT0__BMASK    0x01 ///< Low Power Active Mode Peripheral Set 0 Enable     
#define PCLKACT_PCLKACT0__SHIFT    0x00 ///< Low Power Active Mode Peripheral Set 0 Enable     
#define PCLKACT_PCLKACT0__DISABLED 0x00 ///< Clocks to UART0, Timer 3, SPI0, and the SMBus     
                                        ///< revert to the PCLKEN0 setting in low power active 
                                        ///< mode.                                             
#define PCLKACT_PCLKACT0__ENABLED  0x01 ///< Enable clocks to UART0, Timer 3, SPI0, and the    
                                        ///< SMBus in low power active mode.                   
                                                                                               
#define PCLKACT_PCLKACT1__BMASK    0x02 ///< Low Power Active Mode Peripheral Set 1 Enable     
#define PCLKACT_PCLKACT1__SHIFT    0x01 ///< Low Power Active Mode Peripheral Set 1 Enable     
#define PCLKACT_PCLKACT1__DISABLED 0x00 ///< Clocks to ADC0 and PCA0 revert to the PCLKEN1     
                                        ///< setting in low power active mode.                 
#define PCLKACT_PCLKACT1__ENABLED  0x02 ///< Enable clocks to ADC0 and PCA0 in low power active
                                        ///< mode.                                             
                                                                                               
#define PCLKACT_PCLKACT2__BMASK    0x04 ///< Low Power Active Mode Peripheral Set 2 Enable     
#define PCLKACT_PCLKACT2__SHIFT    0x02 ///< Low Power Active Mode Peripheral Set 2 Enable     
#define PCLKACT_PCLKACT2__DISABLED 0x00 ///< Clocks to Timer 0, Timer 1, Timer 2, and CRC0     
                                        ///< revert to the PCLKEN2 setting in low power active 
                                        ///< mode.                                             
#define PCLKACT_PCLKACT2__ENABLED  0x04 ///< Enable clocks to Timer 0, Timer 1, Timer 2, and   
                                        ///< CRC0 in low power active mode.                    
                                                                                               
#define PCLKACT_PCLKACT3__BMASK    0x08 ///< Low Power Active Mode Peripheral Set 3 Enable     
#define PCLKACT_PCLKACT3__SHIFT    0x03 ///< Low Power Active Mode Peripheral Set 3 Enable     
#define PCLKACT_PCLKACT3__DISABLED 0x00 ///< Clocks to RTC0, Pulse Counter, and PMU0 revert to 
                                        ///< the PCLKEN3 setting in low power active mode.     
#define PCLKACT_PCLKACT3__ENABLED  0x08 ///< Enable clocks to RTC0, Pulse Counter, and PMU0 in 
                                        ///< low power active mode.                            
                                                                                               
//------------------------------------------------------------------------------
// PCLKEN Enums (Low Power Peripheral Clock Enable @ 0xFE)
//------------------------------------------------------------------------------
#define PCLKEN_PCLKEN0__BMASK    0x01 ///< Low Power Idle Mode Peripheral Set 0 Enable       
#define PCLKEN_PCLKEN0__SHIFT    0x00 ///< Low Power Idle Mode Peripheral Set 0 Enable       
#define PCLKEN_PCLKEN0__DISABLED 0x00 ///< Disable clocks to UART0, Timer 3, SPI0, and the   
                                      ///< SMBus in low power idle mode.                     
#define PCLKEN_PCLKEN0__ENABLED  0x01 ///< Enable clocks to UART0, Timer 3, SPI0, and the    
                                      ///< SMBus in low power idle mode.                     
                                                                                             
#define PCLKEN_PCLKEN1__BMASK    0x02 ///< Low Power Idle Mode Peripheral Set 1 Enable       
#define PCLKEN_PCLKEN1__SHIFT    0x01 ///< Low Power Idle Mode Peripheral Set 1 Enable       
#define PCLKEN_PCLKEN1__DISABLED 0x00 ///< Disable clocks to ADC0 and PCA0 in low power idle 
                                      ///< mode.                                             
#define PCLKEN_PCLKEN1__ENABLED  0x02 ///< Enable clocks to ADC0 and PCA0 in low power idle  
                                      ///< mode.                                             
                                                                                             
#define PCLKEN_PCLKEN2__BMASK    0x04 ///< Low Power Idle Mode Peripheral Set 2 Enable       
#define PCLKEN_PCLKEN2__SHIFT    0x02 ///< Low Power Idle Mode Peripheral Set 2 Enable       
#define PCLKEN_PCLKEN2__DISABLED 0x00 ///< Disable clocks to Timer 0, Timer 1, Timer 2, and  
                                      ///< CRC0 in low power idle mode.                      
#define PCLKEN_PCLKEN2__ENABLED  0x04 ///< Enable clocks to Timer 0, Timer 1, Timer 2, and   
                                      ///< CRC0 in low power idle mode.                      
                                                                                             
#define PCLKEN_PCLKEN3__BMASK    0x08 ///< Low Power Idle Mode Peripheral Set 3 Enable       
#define PCLKEN_PCLKEN3__SHIFT    0x03 ///< Low Power Idle Mode Peripheral Set 3 Enable       
#define PCLKEN_PCLKEN3__DISABLED 0x00 ///< Disable clocks to RTC0, Pulse Counter, and PMU0 in
                                      ///< low power idle mode.                              
#define PCLKEN_PCLKEN3__ENABLED  0x08 ///< Enable clocks to RTC0, Pulse Counter, and PMU0 in 
                                      ///< low power idle mode.                              
                                                                                             
//------------------------------------------------------------------------------
// CPT0CN Enums (Comparator 0 Control @ 0x9B)
//------------------------------------------------------------------------------
#define CPT0CN_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control            
#define CPT0CN_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control            
#define CPT0CN_CPHYN__DISABLED             0x00 ///< Disable negative hysteresis.                      
#define CPT0CN_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.               
#define CPT0CN_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.               
#define CPT0CN_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                       
#define CPT0CN_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control            
#define CPT0CN_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control            
#define CPT0CN_CPHYP__DISABLED             0x00 ///< Disable positive hysteresis.                      
#define CPT0CN_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.               
#define CPT0CN_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.               
#define CPT0CN_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                       
#define CPT0CN_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag                      
#define CPT0CN_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag                      
#define CPT0CN_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                ///< flag was last cleared.                            
#define CPT0CN_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.             
                                                                                                       
#define CPT0CN_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CPT0CN_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CPT0CN_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                ///< flag was last cleared.                            
#define CPT0CN_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                       
#define CPT0CN_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CPT0CN_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CPT0CN_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP0P < CP0N.                           
#define CPT0CN_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP0P > CP0N.                           
                                                                                                       
#define CPT0CN_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CPT0CN_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CPT0CN_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CPT0CN_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                       
//------------------------------------------------------------------------------
// CPT0MD Enums (Comparator 0 Mode @ 0x9D)
//------------------------------------------------------------------------------
#define CPT0MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CPT0MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CPT0MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CPT0MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CPT0MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CPT0MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CPT0MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT0MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT0MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CPT0MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CPT0MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT0MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT0MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CPT0MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
//------------------------------------------------------------------------------
// CPT0MX Enums (Comparator 0 Multiplexer Selection @ 0x9F)
//------------------------------------------------------------------------------
#define CPT0MX_CMXP__FMASK        0x0F ///< Comparator Positive Input MUX Selection
#define CPT0MX_CMXP__SHIFT        0x00 ///< Comparator Positive Input MUX Selection
#define CPT0MX_CMXP__CMP0P0       0x00 ///< External pin CMP0P.0.                  
#define CPT0MX_CMXP__CMP0P1       0x01 ///< External pin CMP0P.1.                  
#define CPT0MX_CMXP__CMP0P2       0x02 ///< External pin CMP0P.2.                  
#define CPT0MX_CMXP__CMP0P3       0x03 ///< External pin CMP0P.3.                  
#define CPT0MX_CMXP__CMP0P6       0x06 ///< External pin CMP0P.6.                  
#define CPT0MX_CMXP__CMP0P7       0x07 ///< External pin CMP0P.7.                  
#define CPT0MX_CMXP__CMP0P8       0x08 ///< External pin CMP0P.8.                  
#define CPT0MX_CMXP__CMP0P9       0x09 ///< External pin CMP0P.9.                  
#define CPT0MX_CMXP__CS_COMPARE   0x0C ///< Capacitive Sense Compare.              
#define CPT0MX_CMXP__VBAT_DIV_2   0x0D ///< VBAT divided by 2.                     
#define CPT0MX_CMXP__VBAT         0x0E ///< VBAT Supply Voltage.                   
#define CPT0MX_CMXP__NONE         0x0F ///< No input selected.                     
                                                                                   
#define CPT0MX_CMXN__FMASK        0xF0 ///< Comparator Negative Input MUX Selection
#define CPT0MX_CMXN__SHIFT        0x04 ///< Comparator Negative Input MUX Selection
#define CPT0MX_CMXN__CMP0N0       0x00 ///< External pin CMP0N.0.                  
#define CPT0MX_CMXN__CMP0N1       0x10 ///< External pin CMP0N.1.                  
#define CPT0MX_CMXN__CMP0N2       0x20 ///< External pin CMP0N.2.                  
#define CPT0MX_CMXN__CMP0N6       0x60 ///< External pin CMP0N.6.                  
#define CPT0MX_CMXN__CMP0N7       0x70 ///< External pin CMP0N.7.                  
#define CPT0MX_CMXN__CMP0N8       0x80 ///< External pin CMP0N.8.                  
#define CPT0MX_CMXN__CMP0N9       0x90 ///< External pin CMP0N.9.                  
#define CPT0MX_CMXN__CS_COMPARE   0xC0 ///< Capacitive Sense Compare.              
#define CPT0MX_CMXN__VBAT_DIV_2   0xD0 ///< VBAT divided by 2.                     
#define CPT0MX_CMXN__INTERNAL_LDO 0xE0 ///< Internal LDO output.                   
#define CPT0MX_CMXN__GND          0xF0 ///< Ground.                                
                                                                                   
//------------------------------------------------------------------------------
// CPT1CN Enums (Comparator 1 Control @ 0x9A)
//------------------------------------------------------------------------------
#define CPT1CN_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control            
#define CPT1CN_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control            
#define CPT1CN_CPHYN__DISABLED             0x00 ///< Disable negative hysteresis.                      
#define CPT1CN_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.               
#define CPT1CN_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.               
#define CPT1CN_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                       
#define CPT1CN_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control            
#define CPT1CN_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control            
#define CPT1CN_CPHYP__DISABLED             0x00 ///< Disable positive hysteresis.                      
#define CPT1CN_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.               
#define CPT1CN_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.               
#define CPT1CN_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                       
#define CPT1CN_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag                      
#define CPT1CN_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag                      
#define CPT1CN_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                ///< flag was last cleared.                            
#define CPT1CN_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.             
                                                                                                       
#define CPT1CN_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CPT1CN_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CPT1CN_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                ///< flag was last cleared.                            
#define CPT1CN_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                       
