ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define CRC1CN_RESET__BMASK     0x80 ///< Module Reset and Initialize                     
#define CRC1CN_RESET__SHIFT     0x07 ///< Module Reset and Initialize                     
#define CRC1CN_RESET__NOT_SET   0x00 ///< Do not reset the CRC module or a reset operation
                                     ///< completed.                                      
#define CRC1CN_RESET__SET       0x80 ///< Reset the CRC module.                           
                                                                                          
//------------------------------------------------------------------------------
// CRC1IN Enums (CRC1 Data In @ 0xB9)
//------------------------------------------------------------------------------
#define CRC1IN_CRC1IN__FMASK 0xFF ///< CRC1 Data In
#define CRC1IN_CRC1IN__SHIFT 0x00 ///< CRC1 Data In
                                                   
//------------------------------------------------------------------------------
// CRC1OUTH Enums (CRC1 Output High Byte @ 0xBB)
//------------------------------------------------------------------------------
#define CRC1OUTH_CRC1OUTH__FMASK 0xFF ///< CRC1 Output High Byte
#define CRC1OUTH_CRC1OUTH__SHIFT 0x00 ///< CRC1 Output High Byte
                                                                
//------------------------------------------------------------------------------
// CRC1OUTL Enums (CRC1 Output Low Byte @ 0xBA)
//------------------------------------------------------------------------------
#define CRC1OUTL_CRC1OUTL__FMASK 0xFF ///< CRC1 Output Low Byte
#define CRC1OUTL_CRC1OUTL__SHIFT 0x00 ///< CRC1 Output Low Byte
                                                               
//------------------------------------------------------------------------------
// CRC1POLH Enums (CRC1 Polynomial High Byte @ 0xBD)
//------------------------------------------------------------------------------
#define CRC1POLH_CRC1POLH__FMASK 0xFF ///< CRC1 Polynomial High Byte
#define CRC1POLH_CRC1POLH__SHIFT 0x00 ///< CRC1 Polynomial High Byte
                                                                    
//------------------------------------------------------------------------------
// CRC1POLL Enums (CRC1 Polynomial Low Byte @ 0xBC)
//------------------------------------------------------------------------------
#define CRC1POLL_CRC1POLL__FMASK 0xFF ///< CRC1 Polynomial Low Byte
#define CRC1POLL_CRC1POLL__SHIFT 0x00 ///< CRC1 Polynomial Low Byte
                                                                   
//------------------------------------------------------------------------------
// DC0CF Enums (DC-DC Converter Configuration @ 0xB2)
//------------------------------------------------------------------------------
#define DC0CF_SWSEL__FMASK        0x03 ///< DC-DC Converter Power Switch Select               
#define DC0CF_SWSEL__SHIFT        0x00 ///< DC-DC Converter Power Switch Select               
#define DC0CF_SWSEL__MINIMUM_SIZE 0x00 ///< Minimum switch size, optimized for load currents  
                                       ///< smaller than 5 mA.                                
#define DC0CF_SWSEL__MAXIMUM_SIZE 0x03 ///< Maximum switch size, optimized for load currents  
                                       ///< greater than 5 mA.                                
                                                                                              
#define DC0CF_OSCDIS__BMASK       0x04 ///< DC-DC Converter Local Oscillator Disable          
#define DC0CF_OSCDIS__SHIFT       0x02 ///< DC-DC Converter Local Oscillator Disable          
#define DC0CF_OSCDIS__ENABLED     0x00 ///< The local oscillator inside the dc-dc converter is
                                       ///< enabled.                                          
#define DC0CF_OSCDIS__DISABLED    0x04 ///< The local oscillator inside the dc-dc converter is
                                       ///< disabled.                                         
                                                                                              
#define DC0CF_VSEL__FMASK         0x78 ///< DC-DC Converter Output Voltage Select             
#define DC0CF_VSEL__SHIFT         0x03 ///< DC-DC Converter Output Voltage Select             
#define DC0CF_VSEL__1P8           0x00 ///< Target output voltage is 1.8 V.                   
#define DC0CF_VSEL__1P9           0x08 ///< Target output voltage is 1.9 V.                   
#define DC0CF_VSEL__2P0           0x10 ///< Target output voltage is 2.0 V.                   
#define DC0CF_VSEL__2P1           0x18 ///< Target output voltage is 2.1 V.                   
#define DC0CF_VSEL__2P2           0x20 ///< Target output voltage is 2.2 V.                   
#define DC0CF_VSEL__2P3           0x28 ///< Target output voltage is 2.3 V.                   
#define DC0CF_VSEL__2P4           0x30 ///< Target output voltage is 2.4 V.                   
#define DC0CF_VSEL__2P5           0x38 ///< Target output voltage is 2.5 V.                   
#define DC0CF_VSEL__2P6           0x40 ///< Target output voltage is 2.6 V.                   
#define DC0CF_VSEL__2P7           0x48 ///< Target output voltage is 2.7 V.                   
#define DC0CF_VSEL__2P8           0x50 ///< Target output voltage is 2.8 V.                   
#define DC0CF_VSEL__2P9           0x58 ///< Target output voltage is 2.9 V.                   
#define DC0CF_VSEL__3P0           0x60 ///< Target output voltage is 3.0 V.                   
#define DC0CF_VSEL__3P1           0x68 ///< Target output voltage is 3.1 V.                   
#define DC0CF_VSEL__3P3           0x70 ///< Target output voltage is 3.3 V.                   
#define DC0CF_VSEL__3P5           0x78 ///< Target output voltage is 3.5 V.                   
                                                                                              
#define DC0CF_BYPASS__BMASK       0x80 ///< DC-DC Converter Bypass Switch Enable              
#define DC0CF_BYPASS__SHIFT       0x07 ///< DC-DC Converter Bypass Switch Enable              
#define DC0CF_BYPASS__NORMAL      0x00 ///< The bypass switch is open.                        
#define DC0CF_BYPASS__BYPASS      0x80 ///< The bypass switch is closed (VDC is connected to  
                                       ///< VBATDC).                                          
                                                                                              
//------------------------------------------------------------------------------
// DC0CN Enums (DC-DC Converter Control @ 0xB1)
//------------------------------------------------------------------------------
#define DC0CN_MINPW__FMASK           0x03 ///< DC-DC Converter Minimum Pulse Width              
#define DC0CN_MINPW__SHIFT           0x00 ///< DC-DC Converter Minimum Pulse Width              
#define DC0CN_MINPW__DISABLED        0x00 ///< Minimum pulse detection logic is disabled (no    
                                          ///< pulse skipping).                                 
#define DC0CN_MINPW__10_NS           0x01 ///< Minimum pulse width is 10 ns.                    
#define DC0CN_MINPW__20_NS           0x02 ///< Minimum pulse width is 20 ns.                    
#define DC0CN_MINPW__40_NS           0x03 ///< Minimum pulse width is 40 ns.                    
                                                                                                
#define DC0CN_SYNC__BMASK            0x04 ///< ADC0 Synchronization Enable                      
#define DC0CN_SYNC__SHIFT            0x02 ///< ADC0 Synchronization Enable                      
#define DC0CN_SYNC__DISABLED         0x00 ///< The ADC is not synchronized to the dc-dc         
                                          ///< converter.                                       
#define DC0CN_SYNC__ENABLED          0x04 ///< The ADC is synchronized to the dc-dc converter.  
                                                                                                
#define DC0CN_CLKINV__BMASK          0x08 ///< DC-DC Converter Clock Invert                     
#define DC0CN_CLKINV__SHIFT          0x03 ///< DC-DC Converter Clock Invert                     
#define DC0CN_CLKINV__INVERTED       0x00 ///< The dc-dc converter clock is not inverted.       
#define DC0CN_CLKINV__NOT_INVERTED   0x08 ///< The dc-dc converter clock is inverted.           
                                                                                                
#define DC0CN_AD0CKINV__BMASK        0x10 ///< ADC0 Clock Inversion                             
#define DC0CN_AD0CKINV__SHIFT        0x04 ///< ADC0 Clock Inversion                             
#define DC0CN_AD0CKINV__INVERTED     0x00 ///< ADC0 SAR clock is inverted.                      
#define DC0CN_AD0CKINV__NOT_INVERTED 0x10 ///< ADC0 SAR clock is not inverted.                  
                                                                                                
