ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define DC0CN_CLKDIV__FMASK          0x60 ///< DC-DC Clock Divider                              
#define DC0CN_CLKDIV__SHIFT          0x05 ///< DC-DC Clock Divider                              
#define DC0CN_CLKDIV__SYSCLK_DIV_1   0x00 ///< The dc-dc converter clock is system clock divided
                                          ///< by 1.                                            
#define DC0CN_CLKDIV__SYSCLK_DIV_2   0x20 ///< The dc-dc converter clock is system clock divided
                                          ///< by 2.                                            
#define DC0CN_CLKDIV__SYSCLK_DIV_4   0x40 ///< The dc-dc converter clock is system clock divided
                                          ///< by 4.                                            
#define DC0CN_CLKDIV__SYSCLK_DIV_8   0x60 ///< The dc-dc converter clock is system clock divided
                                          ///< by 8.                                            
                                                                                                
#define DC0CN_CLKSEL__BMASK          0x80 ///< DC-DC Converter Clock Source Select              
#define DC0CN_CLKSEL__SHIFT          0x07 ///< DC-DC Converter Clock Source Select              
#define DC0CN_CLKSEL__LOCAL          0x00 ///< The dc-dc converter is clocked from its local    
                                          ///< oscillator.                                      
#define DC0CN_CLKSEL__SYSCLK         0x80 ///< The dc-dc converter is clocked from the system   
                                          ///< clock.                                           
                                                                                                
//------------------------------------------------------------------------------
// DC0MD Enums (DC-DC Converter Mode @ 0xB3)
//------------------------------------------------------------------------------
#define DC0MD_DC0EN__BMASK      0x01 ///< DC-DC Converter Enable                    
#define DC0MD_DC0EN__SHIFT      0x00 ///< DC-DC Converter Enable                    
#define DC0MD_DC0EN__DISABLED   0x00 ///< Disable the DC-DC converter.              
#define DC0MD_DC0EN__ENABLED    0x01 ///< Enable the DC-DC converter.               
                                                                                    
#define DC0MD_AUTOBYP__BMASK    0x04 ///< Automatic Bypass Mode Enable              
#define DC0MD_AUTOBYP__SHIFT    0x02 ///< Automatic Bypass Mode Enable              
#define DC0MD_AUTOBYP__DISABLED 0x00 ///< Disable automatic bypass mode.            
#define DC0MD_AUTOBYP__ENABLED  0x04 ///< Enable automatic bypass mode.             
                                                                                    
#define DC0MD_FORBYP__BMASK     0x08 ///< Forced Bypass Mode Enable                 
#define DC0MD_FORBYP__SHIFT     0x03 ///< Forced Bypass Mode Enable                 
#define DC0MD_FORBYP__DISABLED  0x00 ///< Disable forced bypass mode.               
#define DC0MD_FORBYP__ENABLED   0x08 ///< Enable forced bypass mode.                
                                                                                    
#define DC0MD_ILIMIT__FMASK     0x70 ///< Peak Current Limit Threshold              
#define DC0MD_ILIMIT__SHIFT     0x04 ///< Peak Current Limit Threshold              
#define DC0MD_ILIMIT__200_MA    0x10 ///< Peak Inductor current is limited to 200 mA
#define DC0MD_ILIMIT__300_MA    0x20 ///< Peak Inductor current is limited to 300 mA
#define DC0MD_ILIMIT__400_MA    0x30 ///< Peak Inductor current is limited to 400 mA
#define DC0MD_ILIMIT__500_MA    0x40 ///< Peak Inductor current is limited to 500 mA
#define DC0MD_ILIMIT__600_MA    0x50 ///< Peak Inductor current is limited to 600 mA
                                                                                    
//------------------------------------------------------------------------------
// DC0RDY Enums (DC-DC Converter Ready @ 0xFD)
//------------------------------------------------------------------------------
#define DC0RDY_RDYL__BMASK   0x40 ///< DC0 Ready Indicator (Low Threshold)          
#define DC0RDY_RDYL__SHIFT   0x06 ///< DC0 Ready Indicator (Low Threshold)          
#define DC0RDY_RDYL__NOT_SET 0x00 ///< VDC pin voltage is less than the DCDC0 Low   
                                  ///< Threshold.                                   
#define DC0RDY_RDYL__SET     0x40 ///< VDC pin voltage is higher than the DCDC0 Low 
                                  ///< Threshold.                                   
                                                                                    
#define DC0RDY_RDYH__BMASK   0x80 ///< DC0 Ready Indicator (High Threshold)         
#define DC0RDY_RDYH__SHIFT   0x07 ///< DC0 Ready Indicator (High Threshold)         
#define DC0RDY_RDYH__NOT_SET 0x00 ///< VDC pin voltage is less than the DCDC0 High  
                                  ///< Threshold.                                   
#define DC0RDY_RDYH__SET     0x80 ///< VDC pin voltage is higher than the DCDC0 High
                                  ///< Threshold.                                   
                                                                                    
//------------------------------------------------------------------------------
// DERIVID Enums (Device Identification @ 0xE9)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK           0xFF ///< Derivative ID  
#define DERIVID_DERIVID__SHIFT           0x00 ///< Derivative ID  
#define DERIVID_DERIVID__C8051F960_GM_GU 0xD0 ///< C8051F960-GM/GU
#define DERIVID_DERIVID__C8051F961_GM    0xD1 ///< C8051F961-GM   
#define DERIVID_DERIVID__C8051F962_GM_GU 0xD2 ///< C8051F962-GM/GU
#define DERIVID_DERIVID__C8051F963_GM    0xD3 ///< C8051F963-GM   
#define DERIVID_DERIVID__C8051F964_GM_GU 0xD4 ///< C8051F964-GM/GU
#define DERIVID_DERIVID__C8051F965_GM    0xD5 ///< C8051F965-GM   
#define DERIVID_DERIVID__C8051F966_GM_GU 0xD6 ///< C8051F966-GM/GU
#define DERIVID_DERIVID__C8051F967_GM    0xD7 ///< C8051F967-GM   
#define DERIVID_DERIVID__C8051F968_GM_GU 0xD8 ///< C8051F968-GM/GU
#define DERIVID_DERIVID__C8051F969_GM    0xD9 ///< C8051F969-GM   
                                                                  
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xEA)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A 
                                                
//------------------------------------------------------------------------------
// DMA0BUSY Enums (DMA0 Busy @ 0xD5)
//------------------------------------------------------------------------------
#define DMA0BUSY_CH0BUSY__BMASK   0x01 ///< Channel 0 Busy                                    
#define DMA0BUSY_CH0BUSY__SHIFT   0x00 ///< Channel 0 Busy                                    
#define DMA0BUSY_CH0BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 0.               
#define DMA0BUSY_CH0BUSY__SET     0x01 ///< DMA0 transfer is in progress on channel 0 or force
                                       ///< a DMA0 transfer to start on channel 0.            
                                                                                              
#define DMA0BUSY_CH1BUSY__BMASK   0x02 ///< Channel 1 Busy                                    
#define DMA0BUSY_CH1BUSY__SHIFT   0x01 ///< Channel 1 Busy                                    
#define DMA0BUSY_CH1BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 1.               
#define DMA0BUSY_CH1BUSY__SET     0x02 ///< DMA0 transfer is in progress on channel 1 or force
                                       ///< a DMA0 transfer to start on channel 1.            
                                                                                              
#define DMA0BUSY_CH2BUSY__BMASK   0x04 ///< Channel 2 Busy                                    
#define DMA0BUSY_CH2BUSY__SHIFT   0x02 ///< Channel 2 Busy                                    
#define DMA0BUSY_CH2BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 2.               
#define DMA0BUSY_CH2BUSY__SET     0x04 ///< DMA0 transfer is in progress on channel 2 or force
                                       ///< a DMA0 transfer to start on channel 2.            
                                                                                              
