ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define DMA0BUSY_CH3BUSY__BMASK   0x08 ///< Channel 3 Busy                                    
#define DMA0BUSY_CH3BUSY__SHIFT   0x03 ///< Channel 3 Busy                                    
#define DMA0BUSY_CH3BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 3.               
#define DMA0BUSY_CH3BUSY__SET     0x08 ///< DMA0 transfer is in progress on channel 3 or force
                                       ///< a DMA0 transfer to start on channel 3.            
                                                                                              
#define DMA0BUSY_CH4BUSY__BMASK   0x10 ///< Channel 4 Busy                                    
#define DMA0BUSY_CH4BUSY__SHIFT   0x04 ///< Channel 4 Busy                                    
#define DMA0BUSY_CH4BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 4.               
#define DMA0BUSY_CH4BUSY__SET     0x10 ///< DMA0 transfer is in progress on channel 6 or force
                                       ///< a DMA0 transfer to start on channel 4.            
                                                                                              
#define DMA0BUSY_CH5BUSY__BMASK   0x20 ///< Channel 5 Busy                                    
#define DMA0BUSY_CH5BUSY__SHIFT   0x05 ///< Channel 5 Busy                                    
#define DMA0BUSY_CH5BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 5.               
#define DMA0BUSY_CH5BUSY__SET     0x20 ///< DMA0 transfer is in progress on channel 5 or force
                                       ///< a DMA0 transfer to start on channel 5.            
                                                                                              
#define DMA0BUSY_CH6BUSY__BMASK   0x40 ///< Channel 6 Busy                                    
#define DMA0BUSY_CH6BUSY__SHIFT   0x06 ///< Channel 6 Busy                                    
#define DMA0BUSY_CH6BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 6.               
#define DMA0BUSY_CH6BUSY__SET     0x40 ///< DMA0 transfer is in progress on channel 6 or force
                                       ///< a DMA0 transfer to start on channel 6.            
                                                                                              
//------------------------------------------------------------------------------
// DMA0EN Enums (DMA0 Channel Enable @ 0xD2)
//------------------------------------------------------------------------------
#define DMA0EN_CH0EN__BMASK    0x01 ///< Channel 0 Enable       
#define DMA0EN_CH0EN__SHIFT    0x00 ///< Channel 0 Enable       
#define DMA0EN_CH0EN__DISABLED 0x00 ///< Disable DMA0 channel 0.
#define DMA0EN_CH0EN__ENABLED  0x01 ///< Enable DMA0 channel 0. 
                                                                
#define DMA0EN_CH1EN__BMASK    0x02 ///< Channel 1 Enable       
#define DMA0EN_CH1EN__SHIFT    0x01 ///< Channel 1 Enable       
#define DMA0EN_CH1EN__DISABLED 0x00 ///< Disable DMA0 channel 1.
#define DMA0EN_CH1EN__ENABLED  0x02 ///< Enable DMA0 channel 1. 
                                                                
#define DMA0EN_CH2EN__BMASK    0x04 ///< Channel 2 Enable       
#define DMA0EN_CH2EN__SHIFT    0x02 ///< Channel 2 Enable       
#define DMA0EN_CH2EN__DISABLED 0x00 ///< Disable DMA0 channel 2.
#define DMA0EN_CH2EN__ENABLED  0x04 ///< Enable DMA0 channel 2. 
                                                                
#define DMA0EN_CH3EN__BMASK    0x08 ///< Channel 3 Enable       
#define DMA0EN_CH3EN__SHIFT    0x03 ///< Channel 3 Enable       
#define DMA0EN_CH3EN__DISABLED 0x00 ///< Disable DMA0 channel 3.
#define DMA0EN_CH3EN__ENABLED  0x08 ///< Enable DMA0 channel 3. 
                                                                
#define DMA0EN_CH4EN__BMASK    0x10 ///< Channel 4 Enable       
#define DMA0EN_CH4EN__SHIFT    0x04 ///< Channel 4 Enable       
#define DMA0EN_CH4EN__DISABLED 0x00 ///< Disable DMA0 channel 4.
#define DMA0EN_CH4EN__ENABLED  0x10 ///< Enable DMA0 channel 4. 
                                                                
#define DMA0EN_CH5EN__BMASK    0x20 ///< Channel 5 Enable       
#define DMA0EN_CH5EN__SHIFT    0x05 ///< Channel 5 Enable       
#define DMA0EN_CH5EN__DISABLED 0x00 ///< Disable DMA0 channel 5.
#define DMA0EN_CH5EN__ENABLED  0x20 ///< Enable DMA0 channel 5. 
                                                                
#define DMA0EN_CH6EN__BMASK    0x40 ///< Channel 6 Enable       
#define DMA0EN_CH6EN__SHIFT    0x06 ///< Channel 6 Enable       
#define DMA0EN_CH6EN__DISABLED 0x00 ///< Disable DMA0 channel 6.
#define DMA0EN_CH6EN__ENABLED  0x40 ///< Enable DMA0 channel 6. 
                                                                
//------------------------------------------------------------------------------
// DMA0INT Enums (DMA0 Full-Length Interrupt Flags @ 0xD3)
//------------------------------------------------------------------------------
#define DMA0INT_CH0I__BMASK   0x01 ///< Channel 0 Full-Length Interrupt Flag         
#define DMA0INT_CH0I__SHIFT   0x00 ///< Channel 0 Full-Length Interrupt Flag         
#define DMA0INT_CH0I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH0I__SET     0x01 ///< Full-length interrupt generated in channel 0.
                                                                                     
#define DMA0INT_CH1I__BMASK   0x02 ///< Channel 1 Full-Length Interrupt Flag         
#define DMA0INT_CH1I__SHIFT   0x01 ///< Channel 1 Full-Length Interrupt Flag         
#define DMA0INT_CH1I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH1I__SET     0x02 ///< Full-length interrupt generated in channel 1.
                                                                                     
#define DMA0INT_CH2I__BMASK   0x04 ///< Channel 2 Full-Length Interrupt Flag         
#define DMA0INT_CH2I__SHIFT   0x02 ///< Channel 2 Full-Length Interrupt Flag         
#define DMA0INT_CH2I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH2I__SET     0x04 ///< Full-length interrupt generated in channel 2.
                                                                                     
#define DMA0INT_CH3I__BMASK   0x08 ///< Channel 3 Full-Length Interrupt Flag         
#define DMA0INT_CH3I__SHIFT   0x03 ///< Channel 3 Full-Length Interrupt Flag         
#define DMA0INT_CH3I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH3I__SET     0x08 ///< Full-length interrupt generated in channel 3.
                                                                                     
#define DMA0INT_CH4I__BMASK   0x10 ///< Channel 4 Full-Length Interrupt Flag         
#define DMA0INT_CH4I__SHIFT   0x04 ///< Channel 4 Full-Length Interrupt Flag         
#define DMA0INT_CH4I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH4I__SET     0x10 ///< Full-length interrupt generated in channel 4.
                                                                                     
#define DMA0INT_CH5I__BMASK   0x20 ///< Channel 5 Full-Length Interrupt Flag         
#define DMA0INT_CH5I__SHIFT   0x05 ///< Channel 5 Full-Length Interrupt Flag         
#define DMA0INT_CH5I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH5I__SET     0x20 ///< Full-length interrupt generated in channel 5.
                                                                                     
#define DMA0INT_CH6I__BMASK   0x40 ///< Channel 6 Full-Length Interrupt Flag         
#define DMA0INT_CH6I__SHIFT   0x06 ///< Channel 6 Full-Length Interrupt Flag         
#define DMA0INT_CH6I__NOT_SET 0x00 ///< No Interrupt generated.                      
#define DMA0INT_CH6I__SET     0x40 ///< Full-length interrupt generated in channel 6.
                                                                                     
//------------------------------------------------------------------------------
// DMA0MINT Enums (DMA0 Mid-Point Interrupt Flags @ 0xD4)
//------------------------------------------------------------------------------
#define DMA0MINT_CH0MI__BMASK   0x01 ///< Channel 0 Mid-Point Interrupt Flag         
#define DMA0MINT_CH0MI__SHIFT   0x00 ///< Channel 0 Mid-Point Interrupt Flag         
#define DMA0MINT_CH0MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH0MI__SET     0x01 ///< Mid-point Interrupt generated in channel 0.
                                                                                     
