ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define DMA0MINT_CH1MI__BMASK   0x02 ///< Channel 1 Mid-Point Interrupt Flag         
#define DMA0MINT_CH1MI__SHIFT   0x01 ///< Channel 1 Mid-Point Interrupt Flag         
#define DMA0MINT_CH1MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH1MI__SET     0x02 ///< Mid-point Interrupt generated in channel 1.
                                                                                     
#define DMA0MINT_CH2MI__BMASK   0x04 ///< Channel 2 Mid-Point Interrupt Flag         
#define DMA0MINT_CH2MI__SHIFT   0x02 ///< Channel 2 Mid-Point Interrupt Flag         
#define DMA0MINT_CH2MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH2MI__SET     0x04 ///< Mid-point Interrupt generated in channel 2.
                                                                                     
#define DMA0MINT_CH3MI__BMASK   0x08 ///< Channel 3 Mid-Point Interrupt Flag         
#define DMA0MINT_CH3MI__SHIFT   0x03 ///< Channel 3 Mid-Point Interrupt Flag         
#define DMA0MINT_CH3MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH3MI__SET     0x08 ///< Mid-point Interrupt generated in channel 3.
                                                                                     
#define DMA0MINT_CH4MI__BMASK   0x10 ///< Channel 4 Mid-Point Interrupt Flag         
#define DMA0MINT_CH4MI__SHIFT   0x04 ///< Channel 4 Mid-Point Interrupt Flag         
#define DMA0MINT_CH4MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH4MI__SET     0x10 ///< Mid-point Interrupt generated in channel 4.
                                                                                     
#define DMA0MINT_CH5MI__BMASK   0x20 ///< Channel 5 Mid-Point Interrupt Flag         
#define DMA0MINT_CH5MI__SHIFT   0x05 ///< Channel 5 Mid-Point Interrupt Flag         
#define DMA0MINT_CH5MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH5MI__SET     0x20 ///< Mid-point Interrupt generated in channel 5.
                                                                                     
#define DMA0MINT_CH6MI__BMASK   0x40 ///< Channel 6 Mid-Point Interrupt Flag         
#define DMA0MINT_CH6MI__SHIFT   0x06 ///< Channel 6 Mid-Point Interrupt Flag         
#define DMA0MINT_CH6MI__NOT_SET 0x00 ///< No mid-point Interrupt generated.          
#define DMA0MINT_CH6MI__SET     0x40 ///< Mid-point Interrupt generated in channel 6.
                                                                                     
//------------------------------------------------------------------------------
// DMA0NAOH Enums (Memory Address Offset High @ 0xCD)
//------------------------------------------------------------------------------
#define DMA0NAOH_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOH0 Enums (Channel 0 Memory Address Offset High @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NAOH0_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH0_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOH1 Enums (Channel 1 Memory Address Offset High @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NAOH1_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH1_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOH2 Enums (Channel 2 Memory Address Offset High @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NAOH2_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH2_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOH3 Enums (Channel 3 Memory Address Offset High @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NAOH3_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH3_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOH4 Enums (Channel 4 Memory Address Offset High @ 0x04)
//------------------------------------------------------------------------------
#define DMA0NAOH4_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH4_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOH5 Enums (Channel 5 Memory Address Offset High @ 0x05)
//------------------------------------------------------------------------------
#define DMA0NAOH5_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH5_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOH6 Enums (Channel 6 Memory Address Offset High @ 0x06)
//------------------------------------------------------------------------------
#define DMA0NAOH6_NAOH__FMASK 0x03 ///< Memory Address Offset High
#define DMA0NAOH6_NAOH__SHIFT 0x00 ///< Memory Address Offset High
                                                                  
//------------------------------------------------------------------------------
// DMA0NAOL Enums (Memory Address Offset Low @ 0xCC)
//------------------------------------------------------------------------------
#define DMA0NAOL_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                
//------------------------------------------------------------------------------
// DMA0NAOL0 Enums (Channel 0 Memory Address Offset Low @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NAOL0_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL0_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOL1 Enums (Channel 1 Memory Address Offset Low @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NAOL1_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL1_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOL2 Enums (Channel 2 Memory Address Offset Low @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NAOL2_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL2_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOL3 Enums (Channel 3 Memory Address Offset Low @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NAOL3_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL3_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOL4 Enums (Channel 4 Memory Address Offset Low @ 0x04)
//------------------------------------------------------------------------------
#define DMA0NAOL4_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL4_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOL5 Enums (Channel 5 Memory Address Offset Low @ 0x05)
//------------------------------------------------------------------------------
#define DMA0NAOL5_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL5_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NAOL6 Enums (Channel 6 Memory Address Offset Low @ 0x06)
//------------------------------------------------------------------------------
#define DMA0NAOL6_NAOL__FMASK 0xFF ///< Memory Address Offset Low
#define DMA0NAOL6_NAOL__SHIFT 0x00 ///< Memory Address Offset Low
                                                                 
//------------------------------------------------------------------------------
// DMA0NBAH Enums (Memory Base Address High @ 0xCB)
//------------------------------------------------------------------------------
#define DMA0NBAH_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                               
//------------------------------------------------------------------------------
// DMA0NBAH0 Enums (Channel 0 Memory Base Address High @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NBAH0_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH0_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAH1 Enums (Channel 1 Memory Base Address High @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NBAH1_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH1_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAH2 Enums (Channel 2 Memory Base Address High @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NBAH2_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH2_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAH3 Enums (Channel 3 Memory Base Address High @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NBAH3_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH3_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAH4 Enums (Channel 4 Memory Base Address High @ 0x04)
//------------------------------------------------------------------------------
#define DMA0NBAH4_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH4_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAH5 Enums (Channel 5 Memory Base Address High @ 0x05)
//------------------------------------------------------------------------------
#define DMA0NBAH5_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH5_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAH6 Enums (Channel 6 Memory Base Address High @ 0x06)
//------------------------------------------------------------------------------
#define DMA0NBAH6_NBAH__FMASK 0x0F ///< Memory Base Address High
#define DMA0NBAH6_NBAH__SHIFT 0x00 ///< Memory Base Address High
                                                                
//------------------------------------------------------------------------------
// DMA0NBAL Enums (Memory Base Address Low @ 0xCA)
//------------------------------------------------------------------------------
#define DMA0NBAL_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                              
//------------------------------------------------------------------------------
// DMA0NBAL0 Enums (Channel 0 Memory Base Address Low @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NBAL0_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL0_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NBAL1 Enums (Channel 1 Memory Base Address Low @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NBAL1_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL1_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NBAL2 Enums (Channel 2 Memory Base Address Low @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NBAL2_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL2_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NBAL3 Enums (Channel 3 Memory Base Address Low @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NBAL3_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL3_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NBAL4 Enums (Channel 4 Memory Base Address Low @ 0x04)
//------------------------------------------------------------------------------
#define DMA0NBAL4_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL4_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NBAL5 Enums (Channel 5 Memory Base Address Low @ 0x05)
//------------------------------------------------------------------------------
#define DMA0NBAL5_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL5_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NBAL6 Enums (Channel 6 Memory Base Address Low @ 0x06)
//------------------------------------------------------------------------------
#define DMA0NBAL6_NBAL__FMASK 0xFF ///< Memory Base Address Low
#define DMA0NBAL6_NBAL__SHIFT 0x00 ///< Memory Base Address Low
                                                               
//------------------------------------------------------------------------------
// DMA0NCF Enums (DMA0 Channel Configuration @ 0xC9)
//------------------------------------------------------------------------------
#define DMA0NCF_PERIPH__FMASK            0x0F ///< Peripheral Transfer Select                        
#define DMA0NCF_PERIPH__SHIFT            0x00 ///< Peripheral Transfer Select                        
#define DMA0NCF_PERIPH__XRAM_TO_ENCDEC0  0x00 ///< The DMA channel transfers from XRAM to the        
                                              ///< ENC0H:M:L registers.                              
#define DMA0NCF_PERIPH__ENCDEC0_TO_XRAM  0x01 ///< The DMA channel transfers from the ENC0H:M:L      
                                              ///< registers to XRAM.                                
#define DMA0NCF_PERIPH__XRAM_TO_CRC1     0x02 ///< The DMA channel transfers from XRAM to the CRC1IN 
                                              ///< register.                                         
#define DMA0NCF_PERIPH__XRAM_TO_SPI1     0x03 ///< The DMA channel transfers from XRAM to the SPI1DAT
                                              ///< register.                                         
#define DMA0NCF_PERIPH__SPI1_TO_XRAM     0x04 ///< The DMA channel transfers from the SPI1DAT        
                                              ///< register to XRAM.                                 
#define DMA0NCF_PERIPH__XRAM_TO_AES0_KEY 0x05 ///< The DMA channel transfers from XRAM to the AES0   
                                              ///< key input (AES0KIN) register.                     
#define DMA0NCF_PERIPH__XRAM_TO_AES0_B   0x06 ///< The DMA channel transfers from XRAM to the AES0 B 
                                              ///< input (AES0BIN) register.                         
#define DMA0NCF_PERIPH__XRAM_TO_AES0_XOR 0x07 ///< The DMA channel transfers from XRAM to the AES0   
                                              ///< XOR input (AES0XIN) register.                     
#define DMA0NCF_PERIPH__AES0_Y_TO_XRAM   0x08 ///< The DMA channel transfers from the AES0 Y output  
                                              ///< (AES0YOUT) register to XRAM.                      
                                                                                                     
#define DMA0NCF_ENDIAN__BMASK            0x10 ///< Data Transfer Endianness                          
#define DMA0NCF_ENDIAN__SHIFT            0x04 ///< Data Transfer Endianness                          
#define DMA0NCF_ENDIAN__LITTLE           0x00 ///< Data is written to and read from XRAM in little   
                                              ///< endian order.                                     
#define DMA0NCF_ENDIAN__BIG              0x10 ///< Data is written to and read from XRAM in big      
                                              ///< endian order.                                     
                                                                                                     
#define DMA0NCF_STALL__BMASK             0x20 ///< Channel Stall                                     
#define DMA0NCF_STALL__SHIFT             0x05 ///< Channel Stall                                     
#define DMA0NCF_STALL__NOT_SET           0x00 ///< The DMA transfer of the selected channel is not   
                                              ///< stalled.                                          
#define DMA0NCF_STALL__SET               0x20 ///< The DMA transfer of the selected channel is       
                                              ///< stalled.                                          
                                                                                                     
#define DMA0NCF_MIEN__BMASK              0x40 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF_MIEN__SHIFT              0x06 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF_MIEN__DISABLED           0x00 ///< Disable the DMA0 mid-point interrupt request of   
                                              ///< the selected channel.                             
#define DMA0NCF_MIEN__ENABLED            0x40 ///< Enable the DMA0 mid-point interrupt request of the
                                              ///< selected channel.                                 
                                                                                                     
#define DMA0NCF_IEN__BMASK               0x80 ///< Full-Length Interrupt Enable                      
#define DMA0NCF_IEN__SHIFT               0x07 ///< Full-Length Interrupt Enable                      
#define DMA0NCF_IEN__DISABLED            0x00 ///< Disable the DMA0 full-length interrupt request of 
                                              ///< the selected channel.                             
#define DMA0NCF_IEN__ENABLED             0x80 ///< Enable the DMA0 full-length interrupt request of  
                                              ///< the selected channel.                             
                                                                                                     
//------------------------------------------------------------------------------
// DMA0NCF0 Enums (DMA0 Channel 0 Configuration @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NCF0_PERIPH__FMASK            0x07 ///< Peripheral Transfer Select                        
#define DMA0NCF0_PERIPH__SHIFT            0x00 ///< Peripheral Transfer Select                        
#define DMA0NCF0_PERIPH__XRAM_TO_MAC_A    0x02 ///< The DMA channel transfers from XRAM to the MAC A  
                                               ///< register.                                         
#define DMA0NCF0_PERIPH__XRAM_TO_MAC_B    0x03 ///< The DMA channel transfers from XRAM to the MAC B  
                                               ///< register.                                         
#define DMA0NCF0_PERIPH__XRAM_TO_MAC_ACC  0x04 ///< The DMA channel transfers from XRAM to the MAC    
                                               ///< accumulator registers.                            
#define DMA0NCF0_PERIPH__MAC_ACC_TO_XRAM  0x05 ///< The DMA channel transfers from the MAC accumulator
                                               ///< registers to XRAM.                                
#define DMA0NCF0_PERIPH__XRAM_TO_I2C_DATA 0x06 ///< The DMA channel transfers from XRAM to the I2C    
                                               ///< Slave data register.                              
#define DMA0NCF0_PERIPH__I2C_DATA_TO_XRAM 0x07 ///< The DMA channel transfers from the I2C Slave data 
                                               ///< register to XRAM.                                 
                                                                                                      
#define DMA0NCF0_ENDIAN__BMASK            0x10 ///< Data Transfer Endianness                          
#define DMA0NCF0_ENDIAN__SHIFT            0x04 ///< Data Transfer Endianness                          
#define DMA0NCF0_ENDIAN__LITTLE           0x00 ///< Data is written to and read from XRAM in little   
                                               ///< endian order.                                     
#define DMA0NCF0_ENDIAN__BIG              0x10 ///< Data is written to and read from XRAM in big      
                                               ///< endian order.                                     
                                                                                                      
