ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define DMA0NCF6_STALL__BMASK             0x20 ///< Channel Stall                                     
#define DMA0NCF6_STALL__SHIFT             0x05 ///< Channel Stall                                     
#define DMA0NCF6_STALL__NOT_SET           0x00 ///< The DMA transfer of the selected channel is not   
                                               ///< stalled.                                          
#define DMA0NCF6_STALL__SET               0x20 ///< The DMA transfer of the selected channel is       
                                               ///< stalled.                                          
                                                                                                      
#define DMA0NCF6_MIEN__BMASK              0x40 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF6_MIEN__SHIFT              0x06 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF6_MIEN__DISABLED           0x00 ///< Disable the DMA0 mid-point interrupt request of   
                                               ///< the selected channel.                             
#define DMA0NCF6_MIEN__ENABLED            0x40 ///< Enable the DMA0 mid-point interrupt request of the
                                               ///< selected channel.                                 
                                                                                                      
#define DMA0NCF6_IEN__BMASK               0x80 ///< Full-Length Interrupt Enable                      
#define DMA0NCF6_IEN__SHIFT               0x07 ///< Full-Length Interrupt Enable                      
#define DMA0NCF6_IEN__DISABLED            0x00 ///< Disable the DMA0 full-length interrupt request of 
                                               ///< the selected channel.                             
#define DMA0NCF6_IEN__ENABLED             0x80 ///< Enable the DMA0 full-length interrupt request of  
                                               ///< the selected channel.                             
                                                                                                      
//------------------------------------------------------------------------------
// DMA0NMD Enums (DMA Channel Mode @ 0xD6)
//------------------------------------------------------------------------------
#define DMA0NMD_WRAP__BMASK    0x01 ///< Wrap Enable                                  
#define DMA0NMD_WRAP__SHIFT    0x00 ///< Wrap Enable                                  
#define DMA0NMD_WRAP__DISABLED 0x00 ///< Disable wrapping on the selected DMA channel.
#define DMA0NMD_WRAP__ENABLED  0x01 ///< Enable wrapping on the selected DMA channel. 
                                                                                      
//------------------------------------------------------------------------------
// DMA0NSZH Enums (Memory Transfer Size High @ 0xCF)
//------------------------------------------------------------------------------
#define DMA0NSZH_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                
//------------------------------------------------------------------------------
// DMA0NSZH0 Enums (Channel 0 Memory Transfer Size High @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NSZH0_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH0_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZH1 Enums (Channel 1 Memory Transfer Size High @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NSZH1_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH1_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZH2 Enums (Channel 2 Memory Transfer Size High @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NSZH2_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH2_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZH3 Enums (Channel 3 Memory Transfer Size High @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NSZH3_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH3_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZH4 Enums (Channel 4 Memory Transfer Size High @ 0x04)
//------------------------------------------------------------------------------
#define DMA0NSZH4_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH4_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZH5 Enums (Channel 5 Memory Transfer Size High @ 0x05)
//------------------------------------------------------------------------------
#define DMA0NSZH5_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH5_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZH6 Enums (Channel 6 Memory Transfer Size High @ 0x06)
//------------------------------------------------------------------------------
#define DMA0NSZH6_NSZH__FMASK 0x03 ///< Memory Transfer Size High
#define DMA0NSZH6_NSZH__SHIFT 0x00 ///< Memory Transfer Size High
                                                                 
//------------------------------------------------------------------------------
// DMA0NSZL Enums (Memory Transfer Size Low @ 0xCE)
//------------------------------------------------------------------------------
#define DMA0NSZL_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                               
//------------------------------------------------------------------------------
// DMA0NSZL0 Enums (Channel 0 Memory Transfer Size Low @ 0x00)
//------------------------------------------------------------------------------
#define DMA0NSZL0_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL0_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0NSZL1 Enums (Channel 1 Memory Transfer Size Low @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NSZL1_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL1_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0NSZL2 Enums (Channel 2 Memory Transfer Size Low @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NSZL2_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL2_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0NSZL3 Enums (Channel 3 Memory Transfer Size Low @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NSZL3_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL3_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0NSZL4 Enums (Channel 4 Memory Transfer Size Low @ 0x04)
//------------------------------------------------------------------------------
#define DMA0NSZL4_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL4_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0NSZL5 Enums (Channel 5 Memory Transfer Size Low @ 0x05)
//------------------------------------------------------------------------------
#define DMA0NSZL5_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL5_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0NSZL6 Enums (Channel 6 Memory Transfer Size Low @ 0x06)
//------------------------------------------------------------------------------
#define DMA0NSZL6_NSZL__FMASK 0xFF ///< Memory Transfer Size Low
#define DMA0NSZL6_NSZL__SHIFT 0x00 ///< Memory Transfer Size Low
                                                                
//------------------------------------------------------------------------------
// DMA0SEL Enums (DMA0 Channel Select @ 0xD1)
//------------------------------------------------------------------------------
#define DMA0SEL_SELECT__FMASK 0x07 ///< Channel Select   
#define DMA0SEL_SELECT__SHIFT 0x00 ///< Channel Select   
#define DMA0SEL_SELECT__CH0   0x00 ///< Select channel 0.
#define DMA0SEL_SELECT__CH1   0x01 ///< Select channel 1.
#define DMA0SEL_SELECT__CH2   0x02 ///< Select channel 2.
#define DMA0SEL_SELECT__CH3   0x03 ///< Select channel 3.
#define DMA0SEL_SELECT__CH4   0x04 ///< Select channel 4.
#define DMA0SEL_SELECT__CH5   0x05 ///< Select channel 5.
#define DMA0SEL_SELECT__CH6   0x06 ///< Select channel 6.
                                                         
//------------------------------------------------------------------------------
// ENC0CN Enums (Encoder / Decoder 0 Control @ 0xC5)
//------------------------------------------------------------------------------
#define ENC0CN_MODE__BMASK               0x01 ///< Operation Mode                                    
#define ENC0CN_MODE__SHIFT               0x00 ///< Operation Mode                                    
#define ENC0CN_MODE__MANCHESTER          0x00 ///< Select Manchester encoding or decoding.           
#define ENC0CN_MODE__THREE_OUT_OF_SIX    0x01 ///< Select Three-out-of-Six encoding or decoding.     
                                                                                                     
