ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define ENC0CN_ENDIAN__BMASK             0x02 ///< Big-Endian DMA Mode Select                        
#define ENC0CN_ENDIAN__SHIFT             0x01 ///< Big-Endian DMA Mode Select                        
#define ENC0CN_ENDIAN__DMA_LITTLE_ENDIAN 0x00 ///< Configure the Encoder / Decoder for little-endian 
                                              ///< multiple-byte DMA transfers.                      
#define ENC0CN_ENDIAN__DMA_BIG_ENDIAN    0x02 ///< Configure the Encoder / Decoder for big-endian    
                                              ///< multiple-byte DMA transfers.                      
                                                                                                     
#define ENC0CN_DMA__BMASK                0x04 ///< DMA Mode Enable                                   
#define ENC0CN_DMA__SHIFT                0x02 ///< DMA Mode Enable                                   
#define ENC0CN_DMA__DISABLED             0x00 ///< Disable DMA mode.                                 
#define ENC0CN_DMA__ENABLED              0x04 ///< Enable DMA mode.                                  
                                                                                                     
#define ENC0CN_DEC__BMASK                0x10 ///< Decode                                            
#define ENC0CN_DEC__SHIFT                0x04 ///< Decode                                            
#define ENC0CN_DEC__START                0x10 ///< Start a decode operation.                         
                                                                                                     
#define ENC0CN_ENC__BMASK                0x20 ///< Encode                                            
#define ENC0CN_ENC__SHIFT                0x05 ///< Encode                                            
#define ENC0CN_ENC__START                0x20 ///< Start an encode operation.                        
                                                                                                     
#define ENC0CN_ERROR__BMASK              0x40 ///< Error Flag                                        
#define ENC0CN_ERROR__SHIFT              0x06 ///< Error Flag                                        
#define ENC0CN_ERROR__NOT_SET            0x00 ///< An error did not occur during the decode or encode
                                              ///< operation.                                        
#define ENC0CN_ERROR__SET                0x40 ///< An error occurred during the decode or encode     
                                              ///< operation.                                        
                                                                                                     
#define ENC0CN_READY__BMASK              0x80 ///< Ready Flag                                        
#define ENC0CN_READY__SHIFT              0x07 ///< Ready Flag                                        
#define ENC0CN_READY__NOT_SET            0x00 ///< An encode or decode operation is not in progress. 
#define ENC0CN_READY__SET                0x80 ///< An encode or decode operation is in progress.     
                                                                                                     
//------------------------------------------------------------------------------
// ENC0H Enums (Encoder / Decoder 0 Data High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ENC0H_ENC0H__FMASK 0xFF ///< Encoder / Decoder 0 Data High Byte
#define ENC0H_ENC0H__SHIFT 0x00 ///< Encoder / Decoder 0 Data High Byte
                                                                       
//------------------------------------------------------------------------------
// ENC0L Enums (Encoder / Decoder 0 Data Low Byte @ 0xC2)
//------------------------------------------------------------------------------
#define ENC0L_ENC0L__FMASK 0xFF ///< Encoder / Decoder 0 Data Low Byte
#define ENC0L_ENC0L__SHIFT 0x00 ///< Encoder / Decoder 0 Data Low Byte
                                                                      
//------------------------------------------------------------------------------
// ENC0M Enums (Encoder / Decoder 0 Data Middle Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ENC0M_ENC0M__FMASK 0xFF ///< Encoder / Decoder 0 Data Middle Byte
#define ENC0M_ENC0M__SHIFT 0x00 ///< Encoder / Decoder 0 Data Middle Byte
                                                                         
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__BMASK       0x01 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P1_6        0x06 ///< Select P1.6.              
#define IT01CF_IN0SL__P1_7        0x07 ///< Select P1.7.              
                                                                      
#define IT01CF_IN0PL__BMASK       0x08 ///< INT0 Polarity             
#define IT01CF_IN0PL__SHIFT       0x03 ///< INT0 Polarity             
#define IT01CF_IN0PL__ACTIVE_LOW  0x00 ///< INT0 input is active low. 
#define IT01CF_IN0PL__ACTIVE_HIGH 0x08 ///< INT0 input is active high.
                                                                      
#define IT01CF_IN1SL__BMASK       0x10 ///< INT1 Port Pin Selection   
#define IT01CF_IN1SL__SHIFT       0x04 ///< INT1 Port Pin Selection   
#define IT01CF_IN1SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN1SL__P0_1        0x10 ///< Select P0.1.              
#define IT01CF_IN1SL__P0_2        0x20 ///< Select P0.2.              
#define IT01CF_IN1SL__P0_3        0x30 ///< Select P0.3.              
#define IT01CF_IN1SL__P0_4        0x40 ///< Select P0.4.              
#define IT01CF_IN1SL__P0_5        0x50 ///< Select P0.5.              
#define IT01CF_IN1SL__P1_6        0x60 ///< Select P1.6.              
#define IT01CF_IN1SL__P1_7        0x70 ///< Select P1.7.              
                                                                      
#define IT01CF_IN1PL__BMASK       0x80 ///< INT1 Polarity             
#define IT01CF_IN1PL__SHIFT       0x07 ///< INT1 Polarity             
#define IT01CF_IN1PL__ACTIVE_LOW  0x00 ///< INT1 input is active low. 
#define IT01CF_IN1PL__ACTIVE_HIGH 0x80 ///< INT1 input is active high.
                                                                      
//------------------------------------------------------------------------------
// OSCXCN Enums (External Oscillator Control @ 0xB1)
//------------------------------------------------------------------------------
#define OSCXCN_XFCN__FMASK           0x07 ///< External Oscillator Frequency Control           
#define OSCXCN_XFCN__SHIFT           0x00 ///< External Oscillator Frequency Control           
#define OSCXCN_XFCN__MODE0           0x00 ///< Select external oscillator mode 0: Crystal      
                                          ///< frequency <= 20 kHz, RC/C frequency <= 25 kHz, C
                                          ///< mode K factor = 0.87.                           
#define OSCXCN_XFCN__MODE1           0x01 ///< Select external oscillator mode 1: 20 kHz <     
                                          ///< Crystal frequency <= 58 kHz, 25 kHz < RC/C      
                                          ///< frequency <= 50 kHz, C mode K factor = 2.6.     
#define OSCXCN_XFCN__MODE2           0x02 ///< Select external oscillator mode 2: 58 kHz <     
                                          ///< Crystal frequency <= 155 kHz, 50 kHz < RC/C     
                                          ///< frequency <= 100 kHz, C mode K factor = 7.7.    
#define OSCXCN_XFCN__MODE3           0x03 ///< Select external oscillator mode 3: 155 kHz <    
                                          ///< Crystal frequency <= 415 kHz, 100 kHz < RC/C    
                                          ///< frequency <= 200 kHz, C mode K factor = 22.     
#define OSCXCN_XFCN__MODE4           0x04 ///< Select external oscillator mode 4: 415 kHz <    
                                          ///< Crystal frequency <= 1.1 MHz, 200 kHz < RC/C    
                                          ///< frequency <= 400 kHz, C mode K factor = 65.     
#define OSCXCN_XFCN__MODE5           0x05 ///< Select external oscillator mode 5: 1.1 MHz <    
                                          ///< Crystal frequency <= 3.1 MHz, 400 kHz < RC/C    
                                          ///< frequency <= 800 kHz, C mode K factor = 180.    
#define OSCXCN_XFCN__MODE6           0x06 ///< Select external oscillator mode 6: 3.1 MHz <    
                                          ///< Crystal frequency <= 8.2 MHz, 800 kHz < RC/C    
                                          ///< frequency <= 1.6 MHz, C mode K factor = 664.    
#define OSCXCN_XFCN__MODE7           0x07 ///< Select external oscillator mode 7: 8.2 MHz <    
                                          ///< Crystal frequency <= 25 MHz, 1.6 MHz < RC/C     
                                          ///< frequency <= 3.2 MHz, C mode K factor = 1590.   
                                                                                               
#define OSCXCN_XOSCMD__FMASK         0x70 ///< External Oscillator Mode                        
#define OSCXCN_XOSCMD__SHIFT         0x04 ///< External Oscillator Mode                        
#define OSCXCN_XOSCMD__DISABLED      0x00 ///< External Oscillator circuit disabled.           
#define OSCXCN_XOSCMD__CMOS          0x20 ///< External CMOS Clock Mode.                       
#define OSCXCN_XOSCMD__CMOS_DIV_2    0x30 ///< External CMOS Clock Mode with divide by 2 stage.
#define OSCXCN_XOSCMD__RC            0x40 ///< RC Oscillator Mode.                             
#define OSCXCN_XOSCMD__C             0x50 ///< Capacitor Oscillator Mode.                      
#define OSCXCN_XOSCMD__CRYSTAL       0x60 ///< Crystal Oscillator Mode.                        
#define OSCXCN_XOSCMD__CRYSTAL_DIV_2 0x70 ///< Crystal Oscillator Mode with divide by 2 stage. 
                                                                                               
#define OSCXCN_XCLKVLD__BMASK        0x80 ///< External Oscillator Valid Flag                  
#define OSCXCN_XCLKVLD__SHIFT        0x07 ///< External Oscillator Valid Flag                  
#define OSCXCN_XCLKVLD__NOT_SET      0x00 ///< External Oscillator is unused or not yet stable.
#define OSCXCN_XCLKVLD__SET          0x80 ///< External Oscillator is running and stable.      
                                                                                               
//------------------------------------------------------------------------------
// FLKEY Enums (Flash Lock and Key @ 0xB7)
//------------------------------------------------------------------------------
#define FLKEY_FLKEY__FMASK    0xFF ///< Flash Lock and Key Register                       
#define FLKEY_FLKEY__SHIFT    0x00 ///< Flash Lock and Key Register                       
#define FLKEY_FLKEY__LOCKED   0x00 ///< Flash is write/erase locked.                      
#define FLKEY_FLKEY__FIRST    0x01 ///< The first key code has been written (0xA5).       
#define FLKEY_FLKEY__UNLOCKED 0x02 ///< Flash is unlocked (writes/erases allowed).        
#define FLKEY_FLKEY__DISABLED 0x03 ///< Flash writes/erases disabled until the next reset.
#define FLKEY_FLKEY__KEY1     0xA5 ///< Flash writes and erases are enabled by writing    
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.      
#define FLKEY_FLKEY__KEY2     0xF1 ///< Flash writes and erases are enabled by writing    
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.      
                                                                                          
//------------------------------------------------------------------------------
// FLSCL Enums (Flash Scale @ 0xB6)
//------------------------------------------------------------------------------
#define FLSCL_BYPASS__BMASK    0x40 ///< Flash Read Timing One-Shot Bypass               
#define FLSCL_BYPASS__SHIFT    0x06 ///< Flash Read Timing One-Shot Bypass               
#define FLSCL_BYPASS__ONE_SHOT 0x00 ///< The one-shot determines the Flash read time.    
#define FLSCL_BYPASS__SYSCLK   0x40 ///< The system clock determines the Flash read time.
                                                                                         
//------------------------------------------------------------------------------
// FLWR Enums (Flash Write Only @ 0xE5)
//------------------------------------------------------------------------------
#define FLWR_FLWR__FMASK 0xFF ///< Flash Write Only
#define FLWR_FLWR__SHIFT 0x00 ///< Flash Write Only
                                                   
//------------------------------------------------------------------------------
// FRBCN Enums (Flash Read Buffer Control @ 0xB5)
//------------------------------------------------------------------------------
#define FRBCN_FLBLKWR__BMASK                0x01 ///< Block Write Enable                            
#define FRBCN_FLBLKWR__SHIFT                0x00 ///< Block Write Enable                            
#define FRBCN_FLBLKWR__BLOCK_WRITE_DISABLED 0x00 ///< Each byte of a firmware flash write is written
                                                 ///< individually.                                 
#define FRBCN_FLBLKWR__BLOCK_WRITE_ENABLED  0x01 ///< Flash bytes are written in groups of four.    
                                                                                                    
