ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xE7)
//------------------------------------------------------------------------------
#define EIE2_EWARN__BMASK     0x01 ///< VDD/VBAT Supply Monitor Early Warning Interrupt Enable
#define EIE2_EWARN__SHIFT     0x00 ///< VDD/VBAT Supply Monitor Early Warning Interrupt Enable
#define EIE2_EWARN__DISABLED  0x00 ///< Disable the VDD/VBAT Supply Monitor Early Warning     
                                   ///< interrupt.                                            
#define EIE2_EWARN__ENABLED   0x01 ///< Enable interrupt requests generated by the            
                                   ///< VDD/VBAT Supply Monitor.                              
                                                                                              
#define EIE2_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable                          
#define EIE2_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable                          
#define EIE2_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                    
#define EIE2_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port         
                                   ///< Match.                                                
                                                                                              
#define EIE2_ERTC0F__BMASK    0x04 ///< RTC Oscillator Fail Interrupt Enable                  
#define EIE2_ERTC0F__SHIFT    0x02 ///< RTC Oscillator Fail Interrupt Enable                  
#define EIE2_ERTC0F__DISABLED 0x00 ///< Disable RTC Oscillator Fail interrupts.               
#define EIE2_ERTC0F__ENABLED  0x04 ///< Enable interrupt requests generated by the RTC        
                                   ///< Oscillator Fail event.                                
                                                                                              
#define EIE2_ESPI1__BMASK     0x08 ///< Serial Peripheral Interface (SPI1) Interrupt Enable   
#define EIE2_ESPI1__SHIFT     0x03 ///< Serial Peripheral Interface (SPI1) Interrupt Enable   
#define EIE2_ESPI1__DISABLED  0x00 ///< Disable all SPI1 interrupts.                          
#define EIE2_ESPI1__ENABLED   0x08 ///< Enable interrupt requests generated by SPI1.          
                                                                                              
#define EIE2_EPC0__BMASK      0x10 ///< Pulse Counter (PC0) Interrupt Enable                  
#define EIE2_EPC0__SHIFT      0x04 ///< Pulse Counter (PC0) Interrupt Enable                  
#define EIE2_EPC0__DISABLED   0x00 ///< Disable all PC0 interrupts.                           
#define EIE2_EPC0__ENABLED    0x10 ///< Enable interrupt requests generated by PC0.           
                                                                                              
#define EIE2_EDMA0__BMASK     0x20 ///< DMA0 Interrupt Enable                                 
#define EIE2_EDMA0__SHIFT     0x05 ///< DMA0 Interrupt Enable                                 
#define EIE2_EDMA0__DISABLED  0x00 ///< Disable all DMA0 interrupts.                          
#define EIE2_EDMA0__ENABLED   0x20 ///< Enable interrupt requests generated by DMA0.          
                                                                                              
#define EIE2_EENC0__BMASK     0x40 ///< Encoder / Decoder (ENCDEC0) Interrupt Enable          
#define EIE2_EENC0__SHIFT     0x06 ///< Encoder / Decoder (ENCDEC0) Interrupt Enable          
#define EIE2_EENC0__DISABLED  0x00 ///< Disable all ENCDEC0 interrupts.                       
#define EIE2_EENC0__ENABLED   0x40 ///< Enable interrupt requests generated by ENCDEC0.       
                                                                                              
#define EIE2_EAES0__BMASK     0x80 ///< AES0 Interrupt                                        
#define EIE2_EAES0__SHIFT     0x07 ///< AES0 Interrupt                                        
#define EIE2_EAES0__DISABLED  0x00 ///< Disable all AES0 interrupts.                          
#define EIE2_EAES0__ENABLED   0x80 ///< Enable interrupt requests generated by AES0.          
                                                                                              
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt set to low priority level.                   
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PRTC0A__BMASK 0x02 ///< RTC Alarm Interrupt Priority Control                        
#define EIP1_PRTC0A__SHIFT 0x01 ///< RTC Alarm Interrupt Priority Control                        
#define EIP1_PRTC0A__LOW   0x00 ///< RTC Alarm interrupt set to low priority level.              
#define EIP1_PRTC0A__HIGH  0x02 ///< RTC Alarm interrupt set to high priority level.             
                                                                                                 
#define EIP1_PWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt set to low priority level.            
#define EIP1_PWADC0__HIGH  0x04 ///< ADC0 Window interrupt set to high priority level.           
                                                                                                 
