ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt set to low priority level.                 
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt set to high priority level.                
                                                                                               
#define IP_PS0__BMASK   0x10 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__SHIFT   0x04 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__LOW     0x00 ///< UART0 interrupt set to low priority level.                   
#define IP_PS0__HIGH    0x10 ///< UART0 interrupt set to high priority level.                  
                                                                                               
#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt set to low priority level.                 
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt set to high priority level.                
                                                                                               
#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt set to low priority level.                    
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt set to high priority level.                   
                                                                                               
//------------------------------------------------------------------------------
// IREF0CF Enums (Current Reference Configuration @ 0xB9)
//------------------------------------------------------------------------------
#define IREF0CF_PWMSS__FMASK             0x07 ///< PWM Source Select                               
#define IREF0CF_PWMSS__SHIFT             0x00 ///< PWM Source Select                               
#define IREF0CF_PWMSS__FINE_TUNE_CEX0    0x00 ///< CEX0 selected as the fine-tuning control signal.
#define IREF0CF_PWMSS__FINE_TUNE_CEX1    0x01 ///< CEX1 selected as the fine-tuning control signal.
#define IREF0CF_PWMSS__FINE_TUNE_CEX2    0x02 ///< CEX2 selected as the fine-tuning control signal.
#define IREF0CF_PWMSS__FINE_TUNE_CEX3    0x03 ///< CEX3 selected as the fine-tuning control signal.
#define IREF0CF_PWMSS__FINE_TUNE_CEX4    0x04 ///< CEX4 selected as the fine-tuning control signal.
#define IREF0CF_PWMSS__FINE_TUNE_CEX5    0x05 ///< CEX5 selected as the fine-tuning control signal.
                                                                                                   
#define IREF0CF_PWMEN__BMASK             0x80 ///< PWM Enhanced Mode Enable                        
#define IREF0CF_PWMEN__SHIFT             0x07 ///< PWM Enhanced Mode Enable                        
#define IREF0CF_PWMEN__ENHANCED_DISABLED 0x00 ///< Disable PWM Enhanced Mode.                      
#define IREF0CF_PWMEN__ENHANCED_ENABLED  0x80 ///< Enable PWM Enhanced Mode.                       
                                                                                                   
//------------------------------------------------------------------------------
// IREF0CN Enums (Current Reference Control @ 0xB9)
//------------------------------------------------------------------------------
#define IREF0CN_IREF0DAT__FMASK     0x3F ///< IREF0 Data Word                                  
#define IREF0CN_IREF0DAT__SHIFT     0x00 ///< IREF0 Data Word                                  
                                                                                               
#define IREF0CN_MDSEL__BMASK        0x40 ///< IREF0 Output Mode Select                         
#define IREF0CN_MDSEL__SHIFT        0x06 ///< IREF0 Output Mode Select                         
#define IREF0CN_MDSEL__LOW_POWER    0x00 ///< Low Current Mode is selected (step size = 1 uA). 
#define IREF0CN_MDSEL__HIGH_CURRENT 0x40 ///< High Current Mode is selected (step size = 8 uA).
                                                                                               
#define IREF0CN_SINK__BMASK         0x80 ///< IREF0 Current Sink Enable                        
#define IREF0CN_SINK__SHIFT         0x07 ///< IREF0 Current Sink Enable                        
#define IREF0CN_SINK__DISABLED      0x00 ///< IREF0 is a current source.                       
#define IREF0CN_SINK__ENABLED       0x80 ///< IREF0 is a current sink.                         
                                                                                               
//------------------------------------------------------------------------------
// LCD0BLINK Enums (LCD0 Blink Mask @ 0x9E)
//------------------------------------------------------------------------------
#define LCD0BLINK_LCD0BLKP0__FMASK 0x0F ///< LCD0 Blink Mask Pin 0
#define LCD0BLINK_LCD0BLKP0__SHIFT 0x00 ///< LCD0 Blink Mask Pin 0
                                                                  
#define LCD0BLINK_LCD0BLKP1__FMASK 0xF0 ///< LCD0 Blink Mask Pin 1
#define LCD0BLINK_LCD0BLKP1__SHIFT 0x04 ///< LCD0 Blink Mask Pin 1
                                                                  
//------------------------------------------------------------------------------
// LCD0CF Enums (LCD0 Configuration @ 0xA5)
//------------------------------------------------------------------------------
#define LCD0CF_CMPBYP__BMASK    0x20 ///< VLCD/VIO Supply Comparator Bypass              
#define LCD0CF_CMPBYP__SHIFT    0x05 ///< VLCD/VIO Supply Comparator Bypass              
#define LCD0CF_CMPBYP__NORMAL   0x00 ///< VLCD/VIO supply voltage comparator is not      
                                     ///< bypassed.                                      
#define LCD0CF_CMPBYP__BYPASSED 0x20 ///< VLCD/VIO supply voltage comparator is bypassed.
                                                                                         
//------------------------------------------------------------------------------
// LCD0CLKDIVH Enums (LCD0 Refresh Rate Prescaler High Byte @ 0xAA)
//------------------------------------------------------------------------------
#define LCD0CLKDIVH_LCDDIV__FMASK 0x03 ///< LCD Refresh Rate Prescaler
#define LCD0CLKDIVH_LCDDIV__SHIFT 0x00 ///< LCD Refresh Rate Prescaler
                                                                      
//------------------------------------------------------------------------------
// LCD0CLKDIVL Enums (LCD Refresh Rate Prescaler Low Byte @ 0xA9)
//------------------------------------------------------------------------------
#define LCD0CLKDIVL_LCDDIV__FMASK 0xFF ///< LCD Refresh Rate Prescaler
#define LCD0CLKDIVL_LCDDIV__SHIFT 0x00 ///< LCD Refresh Rate Prescaler
                                                                      
//------------------------------------------------------------------------------
// LCD0CN Enums (LCD0 Control @ 0x9D)
//------------------------------------------------------------------------------
#define LCD0CN_BIAS__BMASK       0x01 ///< Bias Select                                   
#define LCD0CN_BIAS__SHIFT       0x00 ///< Bias Select                                   
#define LCD0CN_BIAS__ONE_THIRD   0x00 ///< LCD0 is configured for 1/3 Bias.              
#define LCD0CN_BIAS__ONE_HALF    0x01 ///< LCD0 is configured for 1/2 Bias.              
                                                                                         
#define LCD0CN_MUXMD__FMASK      0x06 ///< Multiplexer Mode                              
#define LCD0CN_MUXMD__SHIFT      0x01 ///< Multiplexer Mode                              
#define LCD0CN_MUXMD__STATIC     0x00 ///< Select static mode (COM0 used).               
#define LCD0CN_MUXMD__2_MUX_MODE 0x02 ///< Select 2-mux mode (COM0 and COM1 used).       
#define LCD0CN_MUXMD__3_MUX_MODE 0x04 ///< Select 3-mux mode (COM0, COM1, and COM2 used).
#define LCD0CN_MUXMD__4_MUX_MODE 0x06 ///< Select 4-mux mode (COM0, COM1, COM2, and COM3 
                                      ///< used).                                        
                                                                                         
