ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define LCD0CN_SIZE__BMASK       0x08 ///< LCD Size Select                               
#define LCD0CN_SIZE__SHIFT       0x03 ///< LCD Size Select                               
#define LCD0CN_SIZE__16_PINS     0x00 ///< Use P0 and P1 as LCD segment pins.            
#define LCD0CN_SIZE__32_PINS     0x08 ///< Use P0, P1, P2, and P3 as LCD segment pins.   
                                                                                         
#define LCD0CN_BLANK__BMASK      0x10 ///< Blank All Segments Enable                     
#define LCD0CN_BLANK__SHIFT      0x04 ///< Blank All Segments Enable                     
#define LCD0CN_BLANK__DISABLED   0x00 ///< All LCD segments are controlled by the LCD0Dn 
                                      ///< registers.                                    
#define LCD0CN_BLANK__ENABLED    0x10 ///< All LCD segments are blank (turned off).      
                                                                                         
#define LCD0CN_CLKDIV__FMASK     0x60 ///< LCD0 Clock Divider                            
#define LCD0CN_CLKDIV__SHIFT     0x05 ///< LCD0 Clock Divider                            
#define LCD0CN_CLKDIV__RTC_DIV_1 0x00 ///< The LCD clock is the RTC clock divided by 1.  
#define LCD0CN_CLKDIV__RTC_DIV_2 0x20 ///< The LCD clock is the RTC clock divided by 2.  
#define LCD0CN_CLKDIV__RTC_DIV_4 0x40 ///< The LCD clock is the RTC clock divided by 4.  
                                                                                         
//------------------------------------------------------------------------------
// LCD0CNTRST Enums (LCD0 Contrast Adjustment @ 0x9C)
//------------------------------------------------------------------------------
#define LCD0CNTRST_CNTRST__FMASK 0x1F ///< Contrast Setpoint                  
#define LCD0CNTRST_CNTRST__SHIFT 0x00 ///< Contrast Setpoint                  
#define LCD0CNTRST_CNTRST__1P90  0x00 ///< Set the contrast voltage to 1.90 V.
#define LCD0CNTRST_CNTRST__1P96  0x01 ///< Set the contrast voltage to 1.96 V.
#define LCD0CNTRST_CNTRST__2P02  0x02 ///< Set the contrast voltage to 2.02 V.
#define LCD0CNTRST_CNTRST__2P08  0x03 ///< Set the contrast voltage to 2.08 V.
#define LCD0CNTRST_CNTRST__2P13  0x04 ///< Set the contrast voltage to 2.13 V.
#define LCD0CNTRST_CNTRST__2P19  0x05 ///< Set the contrast voltage to 2.19 V.
#define LCD0CNTRST_CNTRST__2P25  0x06 ///< Set the contrast voltage to 2.25 V.
#define LCD0CNTRST_CNTRST__2P31  0x07 ///< Set the contrast voltage to 2.31 V.
#define LCD0CNTRST_CNTRST__2P37  0x08 ///< Set the contrast voltage to 2.37 V.
#define LCD0CNTRST_CNTRST__2P43  0x09 ///< Set the contrast voltage to 2.43 V.
#define LCD0CNTRST_CNTRST__2P49  0x0A ///< Set the contrast voltage to 2.49 V.
#define LCD0CNTRST_CNTRST__2P55  0x0B ///< Set the contrast voltage to 2.55 V.
#define LCD0CNTRST_CNTRST__2P60  0x0C ///< Set the contrast voltage to 2.60 V.
#define LCD0CNTRST_CNTRST__2P66  0x0D ///< Set the contrast voltage to 2.66 V.
#define LCD0CNTRST_CNTRST__2P72  0x0E ///< Set the contrast voltage to 2.72 V.
#define LCD0CNTRST_CNTRST__2P78  0x0F ///< Set the contrast voltage to 2.78 V.
#define LCD0CNTRST_CNTRST__2P84  0x10 ///< Set the contrast voltage to 2.84 V.
#define LCD0CNTRST_CNTRST__2P90  0x11 ///< Set the contrast voltage to 2.90 V.
#define LCD0CNTRST_CNTRST__2P96  0x12 ///< Set the contrast voltage to 2.96 V.
#define LCD0CNTRST_CNTRST__3P02  0x13 ///< Set the contrast voltage to 3.02 V.
#define LCD0CNTRST_CNTRST__3P07  0x14 ///< Set the contrast voltage to 3.07 V.
#define LCD0CNTRST_CNTRST__3P13  0x15 ///< Set the contrast voltage to 3.13 V.
#define LCD0CNTRST_CNTRST__3P19  0x16 ///< Set the contrast voltage to 3.19 V.
#define LCD0CNTRST_CNTRST__3P25  0x17 ///< Set the contrast voltage to 3.25 V.
#define LCD0CNTRST_CNTRST__3P31  0x18 ///< Set the contrast voltage to 3.31 V.
#define LCD0CNTRST_CNTRST__3P37  0x19 ///< Set the contrast voltage to 3.37 V.
#define LCD0CNTRST_CNTRST__3P43  0x1A ///< Set the contrast voltage to 3.43 V.
#define LCD0CNTRST_CNTRST__3P49  0x1B ///< Set the contrast voltage to 3.49 V.
#define LCD0CNTRST_CNTRST__3P54  0x1C ///< Set the contrast voltage to 3.54 V.
#define LCD0CNTRST_CNTRST__3P60  0x1D ///< Set the contrast voltage to 3.60 V.
#define LCD0CNTRST_CNTRST__3P66  0x1E ///< Set the contrast voltage to 3.66 V.
#define LCD0CNTRST_CNTRST__3P72  0x1F ///< Set the contrast voltage to 3.72 V.
                                                                              
//------------------------------------------------------------------------------
// LCD0D0 Enums (LCD0 Data 0 @ 0x89)
//------------------------------------------------------------------------------
#define LCD0D0_LCD0P0__FMASK 0x0F ///< LCD Pin 0 Data
#define LCD0D0_LCD0P0__SHIFT 0x00 ///< LCD Pin 0 Data
                                                     
#define LCD0D0_LCD0P1__FMASK 0xF0 ///< LCD Pin 1 Data
#define LCD0D0_LCD0P1__SHIFT 0x04 ///< LCD Pin 1 Data
                                                     
//------------------------------------------------------------------------------
// LCD0D1 Enums (LCD0 Data 1 @ 0x8A)
//------------------------------------------------------------------------------
#define LCD0D1_LCD0P2__FMASK 0x0F ///< LCD Pin 2 Data
#define LCD0D1_LCD0P2__SHIFT 0x00 ///< LCD Pin 2 Data
                                                     
#define LCD0D1_LCD0P3__FMASK 0xF0 ///< LCD Pin 3 Data
#define LCD0D1_LCD0P3__SHIFT 0x04 ///< LCD Pin 3 Data
                                                     
//------------------------------------------------------------------------------
// LCD0D2 Enums (LCD0 Data 2 @ 0x8B)
//------------------------------------------------------------------------------
#define LCD0D2_LCD0P4__FMASK 0x0F ///< LCD Pin 4 Data
#define LCD0D2_LCD0P4__SHIFT 0x00 ///< LCD Pin 4 Data
                                                     
#define LCD0D2_LCD0P5__FMASK 0xF0 ///< LCD Pin 5 Data
#define LCD0D2_LCD0P5__SHIFT 0x04 ///< LCD Pin 5 Data
                                                     
//------------------------------------------------------------------------------
// LCD0D3 Enums (LCD0 Data 3 @ 0x8C)
//------------------------------------------------------------------------------
#define LCD0D3_LCD0P6__FMASK 0x0F ///< LCD Pin 6 Data
#define LCD0D3_LCD0P6__SHIFT 0x00 ///< LCD Pin 6 Data
                                                     
#define LCD0D3_LCD0P7__FMASK 0xF0 ///< LCD Pin 7 Data
#define LCD0D3_LCD0P7__SHIFT 0x04 ///< LCD Pin 7 Data
                                                     
//------------------------------------------------------------------------------
// LCD0D4 Enums (LCD0 Data 4 @ 0x8D)
//------------------------------------------------------------------------------
#define LCD0D4_LCD0P8__FMASK 0x0F ///< LCD Pin 8 Data
#define LCD0D4_LCD0P8__SHIFT 0x00 ///< LCD Pin 8 Data
                                                     
#define LCD0D4_LCD0P9__FMASK 0xF0 ///< LCD Pin 9 Data
#define LCD0D4_LCD0P9__SHIFT 0x04 ///< LCD Pin 9 Data
                                                     
//------------------------------------------------------------------------------
// LCD0D5 Enums (LCD0 Data 5 @ 0x8E)
//------------------------------------------------------------------------------
#define LCD0D5_LCD0P10__FMASK 0x0F ///< LCD Pin 10 Data
#define LCD0D5_LCD0P10__SHIFT 0x00 ///< LCD Pin 10 Data
                                                       
#define LCD0D5_LCD0P11__FMASK 0xF0 ///< LCD Pin 11 Data
#define LCD0D5_LCD0P11__SHIFT 0x04 ///< LCD Pin 11 Data
                                                       
//------------------------------------------------------------------------------
// LCD0D6 Enums (LCD0 Data 6 @ 0x91)
//------------------------------------------------------------------------------
#define LCD0D6_LCD0P12__FMASK 0x0F ///< LCD Pin 12 Data
#define LCD0D6_LCD0P12__SHIFT 0x00 ///< LCD Pin 12 Data
                                                       
#define LCD0D6_LCD0P13__FMASK 0xF0 ///< LCD Pin 13 Data
#define LCD0D6_LCD0P13__SHIFT 0x04 ///< LCD Pin 13 Data
                                                       
//------------------------------------------------------------------------------
// LCD0D7 Enums (LCD0 Data 7 @ 0x92)
//------------------------------------------------------------------------------
#define LCD0D7_LCD0P14__FMASK 0x0F ///< LCD Pin 14 Data
#define LCD0D7_LCD0P14__SHIFT 0x00 ///< LCD Pin 14 Data
                                                       
