ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define LCD0D7_LCD0P15__FMASK 0xF0 ///< LCD Pin 15 Data
#define LCD0D7_LCD0P15__SHIFT 0x04 ///< LCD Pin 15 Data
                                                       
//------------------------------------------------------------------------------
// LCD0D8 Enums (LCD0 Data 8 @ 0x93)
//------------------------------------------------------------------------------
#define LCD0D8_LCD0P16__FMASK 0x0F ///< LCD Pin 16 Data
#define LCD0D8_LCD0P16__SHIFT 0x00 ///< LCD Pin 16 Data
                                                       
#define LCD0D8_LCD0P17__FMASK 0xF0 ///< LCD Pin 17 Data
#define LCD0D8_LCD0P17__SHIFT 0x04 ///< LCD Pin 17 Data
                                                       
//------------------------------------------------------------------------------
// LCD0D9 Enums (LCD0 Data 9 @ 0x94)
//------------------------------------------------------------------------------
#define LCD0D9_LCD0P18__FMASK 0x0F ///< LCD Pin 18 Data
#define LCD0D9_LCD0P18__SHIFT 0x00 ///< LCD Pin 18 Data
                                                       
#define LCD0D9_LCD0P19__FMASK 0xF0 ///< LCD Pin 19 Data
#define LCD0D9_LCD0P19__SHIFT 0x04 ///< LCD Pin 19 Data
                                                       
//------------------------------------------------------------------------------
// LCD0DA Enums (LCD0 Data 10 @ 0x95)
//------------------------------------------------------------------------------
#define LCD0DA_LCD0P20__FMASK 0x0F ///< LCD Pin 20 Data
#define LCD0DA_LCD0P20__SHIFT 0x00 ///< LCD Pin 20 Data
                                                       
#define LCD0DA_LCD0P21__FMASK 0xF0 ///< LCD Pin 21 Data
#define LCD0DA_LCD0P21__SHIFT 0x04 ///< LCD Pin 21 Data
                                                       
//------------------------------------------------------------------------------
// LCD0DB Enums (LCD0 Data 11 @ 0x96)
//------------------------------------------------------------------------------
#define LCD0DB_LCD0P22__FMASK 0x0F ///< LCD Pin 22 Data
#define LCD0DB_LCD0P22__SHIFT 0x00 ///< LCD Pin 22 Data
                                                       
#define LCD0DB_LCD0P23__FMASK 0xF0 ///< LCD Pin 23 Data
#define LCD0DB_LCD0P23__SHIFT 0x04 ///< LCD Pin 23 Data
                                                       
//------------------------------------------------------------------------------
// LCD0DC Enums (LCD0 Data 12 @ 0x97)
//------------------------------------------------------------------------------
#define LCD0DC_LCD0P24__FMASK 0x0F ///< LCD Pin 24 Data
#define LCD0DC_LCD0P24__SHIFT 0x00 ///< LCD Pin 24 Data
                                                       
#define LCD0DC_LCD0P25__FMASK 0xF0 ///< LCD Pin 25 Data
#define LCD0DC_LCD0P25__SHIFT 0x04 ///< LCD Pin 25 Data
                                                       
//------------------------------------------------------------------------------
// LCD0DD Enums (LCD0 Data 13 @ 0x99)
//------------------------------------------------------------------------------
#define LCD0DD_LCD0P26__FMASK 0x0F ///< LCD Pin 26 Data
#define LCD0DD_LCD0P26__SHIFT 0x00 ///< LCD Pin 26 Data
                                                       
#define LCD0DD_LCD0P27__FMASK 0xF0 ///< LCD Pin 27 Data
#define LCD0DD_LCD0P27__SHIFT 0x04 ///< LCD Pin 27 Data
                                                       
//------------------------------------------------------------------------------
// LCD0DE Enums (LCD0 Data 14 @ 0x9A)
//------------------------------------------------------------------------------
#define LCD0DE_LCD0P28__FMASK 0x0F ///< LCD Pin 28 Data
#define LCD0DE_LCD0P28__SHIFT 0x00 ///< LCD Pin 28 Data
                                                       
#define LCD0DE_LCD0P29__FMASK 0xF0 ///< LCD Pin 29 Data
#define LCD0DE_LCD0P29__SHIFT 0x04 ///< LCD Pin 29 Data
                                                       
//------------------------------------------------------------------------------
// LCD0DF Enums (LCD0 Data 15 @ 0x9B)
//------------------------------------------------------------------------------
#define LCD0DF_LCD0P30__FMASK 0x0F ///< LCD Pin 30 Data
#define LCD0DF_LCD0P30__SHIFT 0x00 ///< LCD Pin 30 Data
                                                       
#define LCD0DF_LCD0P31__FMASK 0xF0 ///< LCD Pin 31 Data
#define LCD0DF_LCD0P31__SHIFT 0x04 ///< LCD Pin 31 Data
                                                       
//------------------------------------------------------------------------------
// LCD0MSCF Enums (LCD0 Master Configuration @ 0xAC)
//------------------------------------------------------------------------------
#define LCD0MSCF_CHPBYP__BMASK     0x01 ///< LCD0 Charge Pump Bypass                  
#define LCD0MSCF_CHPBYP__SHIFT     0x00 ///< LCD0 Charge Pump Bypass                  
#define LCD0MSCF_CHPBYP__NORMAL    0x00 ///< LCD0 charge pump is not bypassed.        
#define LCD0MSCF_CHPBYP__BYPASSED  0x01 ///< LCD0 charge pump is bypassed.            
                                                                                      
#define LCD0MSCF_DCENSLP__BMASK    0x02 ///< DCDC Converter Sleep Mode Enable         
#define LCD0MSCF_DCENSLP__SHIFT    0x01 ///< DCDC Converter Sleep Mode Enable         
#define LCD0MSCF_DCENSLP__DISABLED 0x00 ///< Disable the DCDC Converter in Sleep mode.
#define LCD0MSCF_DCENSLP__ENABLED  0x02 ///< Enable the DCDC Converter in Sleep mode. 
                                                                                      
//------------------------------------------------------------------------------
// LCD0MSCN Enums (LCD0 Master Control @ 0xAB)
//------------------------------------------------------------------------------
#define LCD0MSCN_LCDEN__BMASK       0x01 ///< LCD0 Enable                                      
#define LCD0MSCN_LCDEN__SHIFT       0x00 ///< LCD0 Enable                                      
#define LCD0MSCN_LCDEN__DISABLED    0x00 ///< Disable the LCD0 module.                         
#define LCD0MSCN_LCDEN__ENABLED     0x01 ///< Enable the LCD0 module.                          
                                                                                               
#define LCD0MSCN_LCDRST__BMASK      0x02 ///< LCD0 Reset                                       
#define LCD0MSCN_LCDRST__SHIFT      0x01 ///< LCD0 Reset                                       
#define LCD0MSCN_LCDRST__DISABLED   0x00 ///< Disable the LCD0 reset.                          
#define LCD0MSCN_LCDRST__ENABLED    0x02 ///< Clear all of the LCD0Dn registers to 0x00.       
                                                                                               
#define LCD0MSCN_LOWDRV__BMASK      0x04 ///< Charge Pump Reduced Drive Mode                   
#define LCD0MSCN_LOWDRV__SHIFT      0x02 ///< Charge Pump Reduced Drive Mode                   
#define LCD0MSCN_LOWDRV__DISABLED   0x00 ///< The charge pump operates at full power.          
#define LCD0MSCN_LOWDRV__ENABLED    0x04 ///< The charge pump operates at reduced power.       
                                                                                               
#define LCD0MSCN_CLKOE__BMASK       0x10 ///< LCD Clock Output Enable                          
#define LCD0MSCN_CLKOE__SHIFT       0x04 ///< LCD Clock Output Enable                          
#define LCD0MSCN_CLKOE__DISABLED    0x00 ///< Disable the clock to the LCD0 module.            
#define LCD0MSCN_CLKOE__ENABLED     0x10 ///< Enable the clock to the LCD0 module from the RTC.
                                                                                               
