ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define LCD0MSCN_DCBIASOE__BMASK    0x20 ///< DCDC Converter Bias Output Enable                
#define LCD0MSCN_DCBIASOE__SHIFT    0x05 ///< DCDC Converter Bias Output Enable                
#define LCD0MSCN_DCBIASOE__DISABLED 0x00 ///< Disable the bias output from the LCD0 module for 
                                         ///< the DCDC converter.                              
#define LCD0MSCN_DCBIASOE__ENABLED  0x20 ///< Enable the bias output from the LCD0 module for  
                                         ///< the DCDC converter.                              
                                                                                               
#define LCD0MSCN_BIASEN__BMASK      0x40 ///< LCD0 Bias Enable                                 
#define LCD0MSCN_BIASEN__SHIFT      0x06 ///< LCD0 Bias Enable                                 
#define LCD0MSCN_BIASEN__DISABLED   0x00 ///< Disable the LCD0 bias.                           
#define LCD0MSCN_BIASEN__ENABLED    0x40 ///< Enable the LCD0 bias.                            
                                                                                               
//------------------------------------------------------------------------------
// LCD0PWR Enums (LCD0 Power @ 0xA4)
//------------------------------------------------------------------------------
#define LCD0PWR_MODE__BMASK  0x08 ///< LCD0 Contrast Control Mode Selection          
#define LCD0PWR_MODE__SHIFT  0x03 ///< LCD0 Contrast Control Mode Selection          
#define LCD0PWR_MODE__1_OR_4 0x00 ///< Select LCD0 Contrast Control Mode 1 or Mode 4.
#define LCD0PWR_MODE__2_OR_3 0x08 ///< Select LCD0 Contrast Control Mode 2 or Mode 3.
                                                                                     
//------------------------------------------------------------------------------
// LCD0TOGR Enums (LCD0 Toggle Rate @ 0x9F)
//------------------------------------------------------------------------------
#define LCD0TOGR_TOGR__FMASK    0x0F ///< LCD Toggle Rate Divider                      
#define LCD0TOGR_TOGR__SHIFT    0x00 ///< LCD Toggle Rate Divider                      
#define LCD0TOGR_TOGR__DIV_2    0x02 ///< Toggle Rate Divider is set to divide by 2.   
#define LCD0TOGR_TOGR__DIV_4    0x03 ///< Toggle Rate Divider is set to divide by 4.   
#define LCD0TOGR_TOGR__DIV_8    0x04 ///< Toggle Rate Divider is set to divide by 8.   
#define LCD0TOGR_TOGR__DIV_16   0x05 ///< Toggle Rate Divider is set to divide by 16.  
#define LCD0TOGR_TOGR__DIV_32   0x06 ///< Toggle Rate Divider is set to divide by 32.  
#define LCD0TOGR_TOGR__DIV_64   0x07 ///< Toggle Rate Divider is set to divide by 64.  
#define LCD0TOGR_TOGR__DIV_128  0x08 ///< Toggle Rate Divider is set to divide by 128. 
#define LCD0TOGR_TOGR__DIV_256  0x09 ///< Toggle Rate Divider is set to divide by 256. 
#define LCD0TOGR_TOGR__DIV_512  0x0A ///< Toggle Rate Divider is set to divide by 512. 
#define LCD0TOGR_TOGR__DIV_1024 0x0B ///< Toggle Rate Divider is set to divide by 1024.
#define LCD0TOGR_TOGR__DIV_2048 0x0C ///< Toggle Rate Divider is set to divide by 2048.
#define LCD0TOGR_TOGR__DIV_4096 0x0D ///< Toggle Rate Divider is set to divide by 4096.
                                                                                       
//------------------------------------------------------------------------------
// LCD0VBMCN Enums (LCD0 VBAT Monitor Control @ 0xA6)
//------------------------------------------------------------------------------
#define LCD0VBMCN_THRLD__FMASK      0x1F ///< VBAT Monitor Threshold                          
#define LCD0VBMCN_THRLD__SHIFT      0x00 ///< VBAT Monitor Threshold                          
                                                                                              
#define LCD0VBMCN_OFFSET__BMASK     0x40 ///< VBAT Monitor Offset Enable                      
#define LCD0VBMCN_OFFSET__SHIFT     0x06 ///< VBAT Monitor Offset Enable                      
#define LCD0VBMCN_OFFSET__DISABLED  0x00 ///< The VBAT Monitor threshold is independent of the
                                         ///< contrast setting.                               
#define LCD0VBMCN_OFFSET__ENABLED   0x40 ///< The VBAT Monitor threshold is linked to the     
                                         ///< contrast setting.                               
                                                                                              
#define LCD0VBMCN_VBATMEN__BMASK    0x80 ///< VBAT Monitor Enable                             
#define LCD0VBMCN_VBATMEN__SHIFT    0x07 ///< VBAT Monitor Enable                             
#define LCD0VBMCN_VBATMEN__DISABLED 0x00 ///< Disable the VBAT Monitor.                       
#define LCD0VBMCN_VBATMEN__ENABLED  0x80 ///< Enable the VBAT Monitor.                        
                                                                                              
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK     0x01 ///< UART0 I/O Output Enable                       
#define XBR0_URT0E__SHIFT     0x00 ///< UART0 I/O Output Enable                       
#define XBR0_URT0E__DISABLED  0x00 ///< UART I/O unavailable at Port pin.             
#define XBR0_URT0E__ENABLED   0x01 ///< TX0 and RX0 routed to Port pins P0.4 and P0.5.
                                                                                      
#define XBR0_SPI0E__BMASK     0x02 ///< SPI0 I/O Enable                               
#define XBR0_SPI0E__SHIFT     0x01 ///< SPI0 I/O Enable                               
#define XBR0_SPI0E__DISABLED  0x00 ///< SPI I/O unavailable at Port pins.             
#define XBR0_SPI0E__ENABLED   0x02 ///< SPI I/O routed to Port pins. The SPI can be   
                                   ///< assigned either 3 or 4 GPIO pins.             
                                                                                      
#define XBR0_SMB0E__BMASK     0x04 ///< SMBus0 I/O Enable                             
#define XBR0_SMB0E__SHIFT     0x02 ///< SMBus0 I/O Enable                             
#define XBR0_SMB0E__DISABLED  0x00 ///< SMBus0 I/O unavailable at Port pins.          
#define XBR0_SMB0E__ENABLED   0x04 ///< SMBus0 I/O routed to Port pins.               
                                                                                      
#define XBR0_SYSCKE__BMASK    0x08 ///< SYSCLK Output Enable                          
#define XBR0_SYSCKE__SHIFT    0x03 ///< SYSCLK Output Enable                          
#define XBR0_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.               
#define XBR0_SYSCKE__ENABLED  0x08 ///< SYSCLK output routed to Port pin.             
                                                                                      
#define XBR0_CP0E__BMASK      0x10 ///< Comparator0 Output Enable                     
#define XBR0_CP0E__SHIFT      0x04 ///< Comparator0 Output Enable                     
#define XBR0_CP0E__DISABLED   0x00 ///< CP0 unavailable at Port pin.                  
#define XBR0_CP0E__ENABLED    0x10 ///< CP0 routed to Port pin.                       
                                                                                      
#define XBR0_CP0AE__BMASK     0x20 ///< Comparator0 Asynchronous Output Enable        
#define XBR0_CP0AE__SHIFT     0x05 ///< Comparator0 Asynchronous Output Enable        
#define XBR0_CP0AE__DISABLED  0x00 ///< Asynchronous CP0 unavailable at Port pin.     
#define XBR0_CP0AE__ENABLED   0x20 ///< Asynchronous CP0 routed to Port pin.          
                                                                                      
