ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define PCA0MD_WDTE__BMASK           0x40 ///< Watchdog Timer Enable                             
#define PCA0MD_WDTE__SHIFT           0x06 ///< Watchdog Timer Enable                             
#define PCA0MD_WDTE__DISABLED        0x00 ///< Disable Watchdog Timer.                           
#define PCA0MD_WDTE__ENABLED         0x40 ///< Enable PCA Module 5 as the Watchdog Timer.        
                                                                                                 
#define PCA0MD_CIDL__BMASK           0x80 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__SHIFT           0x07 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__NORMAL          0x00 ///< PCA continues to function normally while the      
                                          ///< system controller is in Idle Mode.                
#define PCA0MD_CIDL__SUSPEND         0x80 ///< PCA operation is suspended while the system       
                                          ///< controller is in Idle Mode.                       
                                                                                                 
//------------------------------------------------------------------------------
// PCA0PWM Enums (PCA PWM Configuration @ 0xDF)
//------------------------------------------------------------------------------
#define PCA0PWM_CLSEL__FMASK             0x03 ///< Cycle Length Select                              
#define PCA0PWM_CLSEL__SHIFT             0x00 ///< Cycle Length Select                              
#define PCA0PWM_CLSEL__8_BITS            0x00 ///< 8 bits.                                          
#define PCA0PWM_CLSEL__9_BITS            0x01 ///< 9 bits.                                          
#define PCA0PWM_CLSEL__10_BITS           0x02 ///< 10 bits.                                         
#define PCA0PWM_CLSEL__11_BITS           0x03 ///< 11 bits.                                         
                                                                                                    
#define PCA0PWM_COVF__BMASK              0x20 ///< Cycle Overflow Flag                              
#define PCA0PWM_COVF__SHIFT              0x05 ///< Cycle Overflow Flag                              
#define PCA0PWM_COVF__NO_OVERFLOW        0x00 ///< No overflow has occurred since the last time this
                                              ///< bit was cleared.                                 
#define PCA0PWM_COVF__OVERFLOW           0x20 ///< An overflow has occurred since the last time this
                                              ///< bit was cleared.                                 
                                                                                                    
#define PCA0PWM_ECOV__BMASK              0x40 ///< Cycle Overflow Interrupt Enable                  
#define PCA0PWM_ECOV__SHIFT              0x06 ///< Cycle Overflow Interrupt Enable                  
#define PCA0PWM_ECOV__COVF_MASK_DISABLED 0x00 ///< COVF will not generate PCA interrupts.           
#define PCA0PWM_ECOV__COVF_MASK_ENABLED  0x40 ///< A PCA interrupt will be generated when COVF is   
                                              ///< set.                                             
                                                                                                    
#define PCA0PWM_ARSEL__BMASK             0x80 ///< Auto-Reload Register Select                      
#define PCA0PWM_ARSEL__SHIFT             0x07 ///< Auto-Reload Register Select                      
#define PCA0PWM_ARSEL__CAPTURE_COMPARE   0x00 ///< Read/Write Capture/Compare Registers at PCA0CPHn 
                                              ///< and PCA0CPLn.                                    
#define PCA0PWM_ARSEL__AUTORELOAD        0x80 ///< Read/Write Auto-Reload Registers at PCA0CPHn and 
                                              ///< PCA0CPLn.                                        
                                                                                                    
//------------------------------------------------------------------------------
// PC0CMP0H Enums (PC0 Comparator 0 High Byte @ 0xE3)
//------------------------------------------------------------------------------
#define PC0CMP0H_PC0CMP0H__FMASK 0xFF ///< PC0 Comparator 0 High Byte
#define PC0CMP0H_PC0CMP0H__SHIFT 0x00 ///< PC0 Comparator 0 High Byte
                                                                     
//------------------------------------------------------------------------------
// PC0CMP0L Enums (PC0 Comparator 0 Low Byte @ 0xE1)
//------------------------------------------------------------------------------
#define PC0CMP0L_PC0CMP0L__FMASK 0xFF ///< PC0 Comparator 0 Low Byte
#define PC0CMP0L_PC0CMP0L__SHIFT 0x00 ///< PC0 Comparator 0 Low Byte
                                                                    
//------------------------------------------------------------------------------
// PC0CMP0M Enums (PC0 Comparator 0 Middle Byte @ 0xE2)
//------------------------------------------------------------------------------
#define PC0CMP0M_PC0CMP0M__FMASK 0xFF ///< PC0 Comparator 0 Middle Byte
#define PC0CMP0M_PC0CMP0M__SHIFT 0x00 ///< PC0 Comparator 0 Middle Byte
                                                                       
//------------------------------------------------------------------------------
// PC0CMP1H Enums (PC0 Comparator 1 High Byte @ 0xF3)
//------------------------------------------------------------------------------
#define PC0CMP1H_PC0CMP1H__FMASK 0xFF ///< PC0 Comparator 1 High Byte
#define PC0CMP1H_PC0CMP1H__SHIFT 0x00 ///< PC0 Comparator 1 High Byte
                                                                     
//------------------------------------------------------------------------------
// PC0CMP1L Enums (PC0 Comparator 1 Low Byte @ 0xF1)
//------------------------------------------------------------------------------
#define PC0CMP1L_PC0CMP1L__FMASK 0xFF ///< PC0 Comparator 1 Low Byte
#define PC0CMP1L_PC0CMP1L__SHIFT 0x00 ///< PC0 Comparator 1 Low Byte
                                                                    
//------------------------------------------------------------------------------
// PC0CMP1M Enums (PC0 Comparator 1 Middle Byte @ 0xF2)
//------------------------------------------------------------------------------
#define PC0CMP1M_PC0CMP1M__FMASK 0xFF ///< PC0 Comparator 1 Middle Byte
#define PC0CMP1M_PC0CMP1M__SHIFT 0x00 ///< PC0 Comparator 1 Middle Byte
                                                                       
//------------------------------------------------------------------------------
// PC0CTR0H Enums (PC0 Counter 0 High Byte @ 0xDC)
//------------------------------------------------------------------------------
#define PC0CTR0H_PC0CTR0H__FMASK 0xFF ///< PC0 Counter 0 High Byte
#define PC0CTR0H_PC0CTR0H__SHIFT 0x00 ///< PC0 Counter 0 High Byte
                                                                  
//------------------------------------------------------------------------------
// PC0CTR0L Enums (PC0 Counter 0 Low Byte @ 0xDA)
//------------------------------------------------------------------------------
#define PC0CTR0L_PC0CTR0L__FMASK 0xFF ///< PC0 Counter 0 Low Byte
#define PC0CTR0L_PC0CTR0L__SHIFT 0x00 ///< PC0 Counter 0 Low Byte
                                                                 
//------------------------------------------------------------------------------
// PC0CTR0M Enums (PC0 Counter 0 Middle Byte @ 0xDB)
//------------------------------------------------------------------------------
#define PC0CTR0M_PC0CTR0M__FMASK 0xFF ///< PC0 Counter 0 Middle Byte
#define PC0CTR0M_PC0CTR0M__SHIFT 0x00 ///< PC0 Counter 0 Middle Byte
                                                                    
//------------------------------------------------------------------------------
// PC0CTR1H Enums (PC0 Counter 1 High Byte @ 0xDF)
//------------------------------------------------------------------------------
#define PC0CTR1H_PC0CTR1H__FMASK 0xFF ///< PC0 Counter 1 High Byte
#define PC0CTR1H_PC0CTR1H__SHIFT 0x00 ///< PC0 Counter 1 High Byte
                                                                  
//------------------------------------------------------------------------------
// PC0CTR1L Enums (PC0 Counter 1 Low Byte @ 0xDD)
//------------------------------------------------------------------------------
#define PC0CTR1L_PC0CTR1L__FMASK 0xFF ///< PC0 Counter 1 Low Byte
#define PC0CTR1L_PC0CTR1L__SHIFT 0x00 ///< PC0 Counter 1 Low Byte
                                                                 
//------------------------------------------------------------------------------
// PC0CTR1M Enums (PC0 Counter 1 Middle Byte @ 0xDE)
//------------------------------------------------------------------------------
#define PC0CTR1M_PC0CTR1M__FMASK 0xFF ///< PC0 Counter 1 Middle Byte
#define PC0CTR1M_PC0CTR1M__SHIFT 0x00 ///< PC0 Counter 1 Middle Byte
                                                                    
//------------------------------------------------------------------------------
// PC0DCH Enums (PC0 Debounce Configuration High Byte @ 0xFA)
//------------------------------------------------------------------------------
#define PC0DCH_PC0DCH__FMASK 0xFF ///< Debounce High Byte
#define PC0DCH_PC0DCH__SHIFT 0x00 ///< Debounce High Byte
                                                         
//------------------------------------------------------------------------------
// PC0DCL Enums (PC0 Debounce Configuration Low Byte @ 0xF9)
//------------------------------------------------------------------------------
#define PC0DCL_PC0DCL__FMASK 0xFF ///< Debounce Low Byte
#define PC0DCL_PC0DCL__SHIFT 0x00 ///< Debounce Low Byte
                                                        
//------------------------------------------------------------------------------
// PC0HIST Enums (PC0 Direction History @ 0xF4)
//------------------------------------------------------------------------------
#define PC0HIST_DIRHIST0__BMASK 0x01 ///< PC0 Direction History Slot 0                 
#define PC0HIST_DIRHIST0__SHIFT 0x00 ///< PC0 Direction History Slot 0                 
#define PC0HIST_DIRHIST0__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST0__CW    0x01 ///< The recorded direction was clock-wise.       
                                                                                       
#define PC0HIST_DIRHIST1__BMASK 0x02 ///< PC0 Direction History Slot 1                 
#define PC0HIST_DIRHIST1__SHIFT 0x01 ///< PC0 Direction History Slot 1                 
#define PC0HIST_DIRHIST1__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST1__CW    0x02 ///< The recorded direction was clock-wise.       
                                                                                       
