ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define PC0HIST_DIRHIST2__BMASK 0x04 ///< PC0 Direction History Slot 2                 
#define PC0HIST_DIRHIST2__SHIFT 0x02 ///< PC0 Direction History Slot 2                 
#define PC0HIST_DIRHIST2__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST2__CW    0x04 ///< The recorded direction was clock-wise.       
                                                                                       
#define PC0HIST_DIRHIST3__BMASK 0x08 ///< PC0 Direction History Slot 3                 
#define PC0HIST_DIRHIST3__SHIFT 0x03 ///< PC0 Direction History Slot 3                 
#define PC0HIST_DIRHIST3__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST3__CW    0x08 ///< The recorded direction was clock-wise.       
                                                                                       
#define PC0HIST_DIRHIST4__BMASK 0x10 ///< PC0 Direction History Slot 4                 
#define PC0HIST_DIRHIST4__SHIFT 0x04 ///< PC0 Direction History Slot 4                 
#define PC0HIST_DIRHIST4__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST4__CW    0x10 ///< The recorded direction was clock-wise.       
                                                                                       
#define PC0HIST_DIRHIST5__BMASK 0x20 ///< PC0 Direction History Slot 5                 
#define PC0HIST_DIRHIST5__SHIFT 0x05 ///< PC0 Direction History Slot 5                 
#define PC0HIST_DIRHIST5__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST5__CW    0x20 ///< The recorded direction was clock-wise.       
                                                                                       
#define PC0HIST_DIRHIST6__BMASK 0x40 ///< PC0 Direction History Slot 6                 
#define PC0HIST_DIRHIST6__SHIFT 0x06 ///< PC0 Direction History Slot 6                 
#define PC0HIST_DIRHIST6__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST6__CW    0x40 ///< The recorded direction was clock-wise.       
                                                                                       
#define PC0HIST_DIRHIST7__BMASK 0x80 ///< PC0 Direction History Slot 7                 
#define PC0HIST_DIRHIST7__SHIFT 0x07 ///< PC0 Direction History Slot 7                 
#define PC0HIST_DIRHIST7__CCW   0x00 ///< The recorded direction was counter clock-wise
#define PC0HIST_DIRHIST7__CW    0x80 ///< The recorded direction was clock-wise.       
                                                                                       
//------------------------------------------------------------------------------
// PC0INT0 Enums (PC0 Interrupt 0 @ 0xFB)
//------------------------------------------------------------------------------
#define PC0INT0_DIRCHGEN__BMASK    0x01 ///< Direction Change Interrupt/Wake-up Source Enable  
#define PC0INT0_DIRCHGEN__SHIFT    0x00 ///< Direction Change Interrupt/Wake-up Source Enable  
#define PC0INT0_DIRCHGEN__DISABLED 0x00 ///< Disable a direction change as an interrupt or     
                                        ///< wake-up source.                                   
#define PC0INT0_DIRCHGEN__ENABLED  0x01 ///< Enable a direction change as an interrupt or wake-
                                        ///< up source.                                        
                                                                                               
#define PC0INT0_DIRCHGF__BMASK     0x02 ///< Direction Change Flag                             
#define PC0INT0_DIRCHGF__SHIFT     0x01 ///< Direction Change Flag                             
#define PC0INT0_DIRCHGF__NOT_SET   0x00 ///< No change in direction was detected.              
#define PC0INT0_DIRCHGF__SET       0x02 ///< A change in direction was detected.               
                                                                                               
#define PC0INT0_OVREN__BMASK       0x04 ///< Counter Overflow Interrupt/Wake-up Source Enable  
#define PC0INT0_OVREN__SHIFT       0x02 ///< Counter Overflow Interrupt/Wake-up Source Enable  
#define PC0INT0_OVREN__DISABLED    0x00 ///< Disable a counter overflow as an interrupt or     
                                        ///< wake-up source.                                   
#define PC0INT0_OVREN__ENABLED     0x04 ///< Enable a counter overflow as an interrupt or wake-
                                        ///< up source.                                        
                                                                                               
#define PC0INT0_OVRF__BMASK        0x08 ///< Counter Overflow Flag                             
#define PC0INT0_OVRF__SHIFT        0x03 ///< Counter Overflow Flag                             
#define PC0INT0_OVRF__SET          0x08 ///< One of the counters has overflowed.               
                                                                                               
#define PC0INT0_CMP0EN__BMASK      0x10 ///< Comparator 0 Interrupt/Wake-up Source Enable      
#define PC0INT0_CMP0EN__SHIFT      0x04 ///< Comparator 0 Interrupt/Wake-up Source Enable      
#define PC0INT0_CMP0EN__DISABLED   0x00 ///< Disable the counter 0 comparator as an interrupt  
                                        ///< or wake-up source.                                
#define PC0INT0_CMP0EN__ENABLED    0x10 ///< Enable the counter 0 comparator as an interrupt or
                                        ///< wake-up source.                                   
                                                                                               
#define PC0INT0_CMP0F__BMASK       0x20 ///< Comparator 0 Flag                                 
#define PC0INT0_CMP0F__SHIFT       0x05 ///< Comparator 0 Flag                                 
#define PC0INT0_CMP0F__NOT_SET     0x00 ///< Counter 0 did not match counter 0 comparator      
                                        ///< value.                                            
#define PC0INT0_CMP0F__SET         0x20 ///< Counter 0 matched counter 0 comparator value.     
                                                                                               
#define PC0INT0_CMP1EN__BMASK      0x40 ///< Comparator 1 Interrupt/Wake-up Source Enable      
#define PC0INT0_CMP1EN__SHIFT      0x06 ///< Comparator 1 Interrupt/Wake-up Source Enable      
#define PC0INT0_CMP1EN__DISABLED   0x00 ///< Disable the counter 1 comparator as an interrupt  
                                        ///< or wake-up source.                                
#define PC0INT0_CMP1EN__ENABLED    0x40 ///< Enable the counter 1 comparator as an interrupt or
                                        ///< wake-up source.                                   
                                                                                               
