ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define PC0INT0_CMP1F__BMASK       0x80 ///< Comparator 1 Flag                                 
#define PC0INT0_CMP1F__SHIFT       0x07 ///< Comparator 1 Flag                                 
#define PC0INT0_CMP1F__NOT_SET     0x00 ///< Counter 1 did not match counter 1 comparator      
                                        ///< value.                                            
#define PC0INT0_CMP1F__SET         0x80 ///< Counter 1 matched counter 1 comparator value.     
                                                                                               
//------------------------------------------------------------------------------
// PC0INT1 Enums (PC0 Interrupt 1 @ 0xFC)
//------------------------------------------------------------------------------
#define PC0INT1_TRANSEN__BMASK      0x01 ///< Transition Interrupt/Wake-up Source Enable        
#define PC0INT1_TRANSEN__SHIFT      0x00 ///< Transition Interrupt/Wake-up Source Enable        
#define PC0INT1_TRANSEN__DISABLED   0x00 ///< Disable transitions on PC0 or PC1 as an interrupt 
                                         ///< or wake-up source.                                
#define PC0INT1_TRANSEN__ENABLED    0x01 ///< Enable transitions on PC0 or PC1 as an interrupt  
                                         ///< or wake-up source.                                
                                                                                                
#define PC0INT1_TRANSF__BMASK       0x02 ///< Transition Flag                                   
#define PC0INT1_TRANSF__SHIFT       0x01 ///< Transition Flag                                   
#define PC0INT1_TRANSF__NOT_SET     0x00 ///< No transitions detected.                          
#define PC0INT1_TRANSF__SET         0x02 ///< A transition was detected on the PC0 or PC1       
                                         ///< inputs.                                           
                                                                                                
#define PC0INT1_ERROREN__BMASK      0x04 ///< Quadrature Error Interrupt/Wake-up Source Enable  
#define PC0INT1_ERROREN__SHIFT      0x02 ///< Quadrature Error Interrupt/Wake-up Source Enable  
#define PC0INT1_ERROREN__DISABLED   0x00 ///< Disable a quadrature error as an interrupt or     
                                         ///< wake-up source.                                   
#define PC0INT1_ERROREN__ENABLED    0x04 ///< Enable a quadrature error as an interrupt or wake-
                                         ///< up source.                                        
                                                                                                
#define PC0INT1_ERRORF__BMASK       0x08 ///< Quadrature Error Flag                             
#define PC0INT1_ERRORF__SHIFT       0x03 ///< Quadrature Error Flag                             
#define PC0INT1_ERRORF__NOT_SET     0x00 ///< No quadrature error detected.                     
#define PC0INT1_ERRORF__SET         0x08 ///< Quadrature error detected.                        
                                                                                                
#define PC0INT1_FLTRSTPEN__BMASK    0x10 ///< Flutter Stop Interrupt/Wake-up Source Enable      
#define PC0INT1_FLTRSTPEN__SHIFT    0x04 ///< Flutter Stop Interrupt/Wake-up Source Enable      
#define PC0INT1_FLTRSTPEN__DISABLED 0x00 ///< Disable the end of a flutter event as an interrupt
                                         ///< or wake-up source.                                
#define PC0INT1_FLTRSTPEN__ENABLED  0x10 ///< Enable the end of a flutter event as an interrupt 
                                         ///< or wake-up source.                                
                                                                                                
#define PC0INT1_FLTRSTPF__BMASK     0x20 ///< Flutter Stop Flag                                 
#define PC0INT1_FLTRSTPF__SHIFT     0x05 ///< Flutter Stop Flag                                 
#define PC0INT1_FLTRSTPF__NOT_SET   0x00 ///< The end of a flutter event was not detected.      
#define PC0INT1_FLTRSTPF__SET       0x20 ///< The end of a flutter event was detected.          
                                                                                                
#define PC0INT1_FLTRSTREN__BMASK    0x40 ///< Flutter Start Interrupt/Wake-up Source Enable     
#define PC0INT1_FLTRSTREN__SHIFT    0x06 ///< Flutter Start Interrupt/Wake-up Source Enable     
#define PC0INT1_FLTRSTREN__DISABLED 0x00 ///< Disable the start of a flutter event as an        
                                         ///< interrupt or wake-up source.                      
#define PC0INT1_FLTRSTREN__ENABLED  0x40 ///< Enable the start of a flutter event as an         
                                         ///< interrupt or wake-up source.                      
                                                                                                
#define PC0INT1_FLTRSTRF__BMASK     0x80 ///< Flutter Start Flag                                
#define PC0INT1_FLTRSTRF__SHIFT     0x07 ///< Flutter Start Flag                                
#define PC0INT1_FLTRSTRF__NOT_SET   0x00 ///< The start of a flutter event was not detected.    
#define PC0INT1_FLTRSTRF__SET       0x80 ///< The start of a flutter event was detected.        
                                                                                                
//------------------------------------------------------------------------------
// PC0MD Enums (PC0 Mode Configuration @ 0xD9)
//------------------------------------------------------------------------------
#define PC0MD_DUALSTCH__BMASK    0x02 ///< Flutter Dual Mode Switch Enable                  
#define PC0MD_DUALSTCH__SHIFT    0x01 ///< Flutter Dual Mode Switch Enable                  
#define PC0MD_DUALSTCH__DISABLED 0x00 ///< Disable dual mode switching. The counter remains 
                                      ///< in quadrature mode during flutter.               
#define PC0MD_DUALSTCH__ENABLED  0x02 ///< Enable dual mode switching. The counter switches 
                                      ///< to dual mode during flutter.                     
                                                                                            
#define PC0MD_FLTRSTOP__BMASK    0x04 ///< Flutter Counter Stop Enable                      
#define PC0MD_FLTRSTOP__SHIFT    0x02 ///< Flutter Counter Stop Enable                      
#define PC0MD_FLTRSTOP__DISABLED 0x00 ///< Disable counter stops on flutter.                
#define PC0MD_FLTRSTOP__ENABLED  0x04 ///< Stop the counter when flutter occurs.            
                                                                                            
#define PC0MD_PCRATE__FMASK      0x30 ///< PC Sample Rate                                   
#define PC0MD_PCRATE__SHIFT      0x04 ///< PC Sample Rate                                   
#define PC0MD_PCRATE__250_US     0x00 ///< Set the pulse counter sample rate to 250 us.     
#define PC0MD_PCRATE__500_US     0x10 ///< Set the pulse counter sample rate to 500 us.     
#define PC0MD_PCRATE__1_MS       0x20 ///< Set the pulse counter sample rate to 1 ms.       
#define PC0MD_PCRATE__2_MS       0x30 ///< Set the pulse counter sample rate to 2 ms.       
                                                                                            
#define PC0MD_PCMODE__FMASK      0xC0 ///< Counter Mode                                     
#define PC0MD_PCMODE__SHIFT      0x06 ///< Counter Mode                                     
#define PC0MD_PCMODE__DISABLED   0x00 ///< Disable the pulse counter.                       
#define PC0MD_PCMODE__SINGLE     0x40 ///< Select single counter mode for the pulse counter.
#define PC0MD_PCMODE__DUAL       0x80 ///< Select dual counter mode for the pulse counter.  
#define PC0MD_PCMODE__QUADRATURE 0xC0 ///< Select quadrature counter mode for the pulse     
                                      ///< counter.                                         
                                                                                            
//------------------------------------------------------------------------------
// PC0PCF Enums (PC0 Pull-Up Configuration @ 0xD7)
//------------------------------------------------------------------------------
#define PC0PCF_DUTY__FMASK        0x03 ///< Pull-Up Resistor Duty Cycle Multiplier            
#define PC0PCF_DUTY__SHIFT        0x00 ///< Pull-Up Resistor Duty Cycle Multiplier            
#define PC0PCF_DUTY__25_PERCENT   0x00 ///< Set the pull-up resistor duty cycle to 1/4 (25%). 
#define PC0PCF_DUTY__37P5_PERCENT 0x01 ///< Set the pull-up resistor duty cycle to 3/8        
                                       ///< (37.5%).                                          
#define PC0PCF_DUTY__50_PERCENT   0x02 ///< Set the pull-up resistor duty cycle to 1/2 (50%). 
#define PC0PCF_DUTY__75_PERCENT   0x03 ///< Set the pull-up resistor duty cycle to 3/4 (75%). 
                                                                                              
