ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define PC0PCF_RES__FMASK         0x1C ///< Pull-Up Resistor Value                            
#define PC0PCF_RES__SHIFT         0x02 ///< Pull-Up Resistor Value                            
#define PC0PCF_RES__DISABLED      0x00 ///< Disable the pull-up resistors.                    
#define PC0PCF_RES__1_UA          0x04 ///< Set the pull-up resistor current to 1 uA.         
#define PC0PCF_RES__4_UA          0x08 ///< Set the pull-up resistor current to 4 uA.         
#define PC0PCF_RES__16_UA         0x0C ///< Set the pull-up resistor current to 16 uA.        
#define PC0PCF_RES__64_UA         0x10 ///< Set the pull-up resistor current to 64 uA.        
#define PC0PCF_RES__256_UA        0x14 ///< Set the pull-up resistor current to 256 uA.       
#define PC0PCF_RES__1_MA          0x18 ///< Set the pull-up resistor current to 1 mA.         
#define PC0PCF_RES__4_MA          0x1C ///< Set the pull-up resistor current to 4 mA.         
                                                                                              
#define PC0PCF_CALPORT__BMASK     0x20 ///< Calibration Port                                  
#define PC0PCF_CALPORT__SHIFT     0x05 ///< Calibration Port                                  
#define PC0PCF_CALPORT__CHANNEL_0 0x00 ///< Perform a pull-up calibration on channel 0 only   
                                       ///< (PC0).                                            
#define PC0PCF_CALPORT__CHANNEL_1 0x20 ///< Perform a pull-up calibration on channel 1 only   
                                       ///< (PC1).                                            
                                                                                              
#define PC0PCF_CALRES__BMASK      0x40 ///< Calibration Result                                
#define PC0PCF_CALRES__SHIFT      0x06 ///< Calibration Result                                
#define PC0PCF_CALRES__FAILED     0x00 ///< The pull-up calibration operation failed.         
#define PC0PCF_CALRES__PASSED     0x40 ///< The pull-up calibration operation passed.         
                                                                                              
#define PC0PCF_PUCAL__BMASK       0x80 ///< Pull-Up Driver Calibration                        
#define PC0PCF_PUCAL__SHIFT       0x07 ///< Pull-Up Driver Calibration                        
#define PC0PCF_PUCAL__NOT_SET     0x00 ///< The pull-up calibration is complete or not in     
                                       ///< progress.                                         
#define PC0PCF_PUCAL__SET         0x80 ///< Start a pull-up calibration operation. The        
                                       ///< calibration operation determines the lowest usable
                                       ///< pull-up strength.                                 
                                                                                              
//------------------------------------------------------------------------------
// PC0STAT Enums (PC0 Status @ 0xC1)
//------------------------------------------------------------------------------
#define PC0STAT_PC0__BMASK            0x01 ///< Current PC0 Integrator Output                     
#define PC0STAT_PC0__SHIFT            0x00 ///< Current PC0 Integrator Output                     
#define PC0STAT_PC0__LOW              0x00 ///< The PC0 integrator output is currently low.       
#define PC0STAT_PC0__HIGH             0x01 ///< The PC0 integrator output is currently high.      
                                                                                                  
#define PC0STAT_PC1__BMASK            0x02 ///< Current PC1 Integrator Output                     
#define PC0STAT_PC1__SHIFT            0x01 ///< Current PC1 Integrator Output                     
#define PC0STAT_PC1__LOW              0x00 ///< The PC1 integrator output is currently low.       
#define PC0STAT_PC1__HIGH             0x02 ///< The PC1 integrator output is currently high.      
                                                                                                  
#define PC0STAT_PC0PREV__BMASK        0x04 ///< Previous PC0 Integrator Output                    
#define PC0STAT_PC0PREV__SHIFT        0x02 ///< Previous PC0 Integrator Output                    
#define PC0STAT_PC0PREV__LOW          0x00 ///< The PC0 integrator output was previously low.     
#define PC0STAT_PC0PREV__HIGH         0x04 ///< The PC0 integrator output was previously high.    
                                                                                                  
#define PC0STAT_PC1PREV__BMASK        0x08 ///< Previous PC1 Integrator Output                    
#define PC0STAT_PC1PREV__SHIFT        0x03 ///< Previous PC1 Integrator Output                    
#define PC0STAT_PC1PREV__LOW          0x00 ///< The PC1 integrator output was previously low.     
#define PC0STAT_PC1PREV__HIGH         0x08 ///< The PC1 integrator output was previously high.    
                                                                                                  
#define PC0STAT_STATE__FMASK          0x30 ///< PC0 State                                         
#define PC0STAT_STATE__SHIFT          0x04 ///< PC0 State                                         
#define PC0STAT_STATE__LL             0x00 ///< The state of the pulse counter is LL (PC1 low, PC0
                                           ///< low).                                             
#define PC0STAT_STATE__LH             0x10 ///< The state of the pulse counter is LH (PC1 low, PC0
                                           ///< high).                                            
#define PC0STAT_STATE__HL             0x20 ///< The state of the pulse counter is HL (PC1 high,   
                                           ///< PC0 low).                                         
#define PC0STAT_STATE__HH             0x30 ///< The state of the pulse counter is HH (PC1 high,   
                                           ///< PC0 high).                                        
                                                                                                  
#define PC0STAT_DIRECTION__BMASK      0x40 ///< Direction                                         
#define PC0STAT_DIRECTION__SHIFT      0x06 ///< Direction                                         
#define PC0STAT_DIRECTION__CCW        0x00 ///< The current direction is counter clock-wise: LL-  
                                           ///< LH-HH-HL.                                         
#define PC0STAT_DIRECTION__CW         0x40 ///< The current direction is clock-wise: LL-HL-HH-LH. 
                                                                                                  
#define PC0STAT_FLUTTER__BMASK        0x80 ///< Flutter                                           
#define PC0STAT_FLUTTER__SHIFT        0x07 ///< Flutter                                           
#define PC0STAT_FLUTTER__NOT_DETECTED 0x00 ///< No flutter detected.                              
#define PC0STAT_FLUTTER__DETECTED     0x80 ///< Flutter detected.                                 
                                                                                                  
//------------------------------------------------------------------------------
// PC0TH Enums (PC0 Threshold Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define PC0TH_RDVALID__BMASK         0x01 ///< Read Valid                                        
#define PC0TH_RDVALID__SHIFT         0x00 ///< Read Valid                                        
#define PC0TH_RDVALID__NOT_SET       0x00 ///< The last read was invalid.                        
#define PC0TH_RDVALID__SET           0x01 ///< The last read was valid.                          
                                                                                                 
#define PC0TH_PUP__BMASK             0x04 ///< Force Pull-Up Enable                              
#define PC0TH_PUP__SHIFT             0x02 ///< Force Pull-Up Enable                              
#define PC0TH_PUP__FORCE_DISABLED    0x00 ///< Channel 0 (PC0) and channel 1 (PC1) pull-ups are  
                                          ///< not forced on continuously.                       
#define PC0TH_PUP__FORCE_ENABLED     0x04 ///< Channel 0 (PC0) and channel 1 (PC1) pull-ups are  
                                          ///< forced on continuously.                           
                                                                                                 
#define PC0TH_PDOWN__BMASK           0x08 ///< Force Pull-Down Enable                            
#define PC0TH_PDOWN__SHIFT           0x03 ///< Force Pull-Down Enable                            
#define PC0TH_PDOWN__FORCE_DISABLED  0x00 ///< Channel 0 (PC0) and channel 1 (PC1) pull-downs are
                                          ///< not forced on continuously.                       
#define PC0TH_PDOWN__FORCE_ENABLED   0x08 ///< Channel 0 (PC0) and channel 1 (PC1) pull-downs are
                                          ///< forced on continuously, grounding the PC0 and PC1 
                                          ///< inputs.                                           
                                                                                                 
#define PC0TH_PCTHRESLO__FMASK       0x30 ///< Input Comparator VIL Threshold                    
#define PC0TH_PCTHRESLO__SHIFT       0x04 ///< Input Comparator VIL Threshold                    
#define PC0TH_PCTHRESLO__42_PERCENT  0x00 ///< Set the input comparator VIL threshold to 42% of  
                                          ///< VIO.                                              
#define PC0TH_PCTHRESLO__46_PERCENT  0x10 ///< Set the input comparator VIL threshold to 46% of  
                                          ///< VIO.                                              
#define PC0TH_PCTHRESLO__34_PERCENT  0x20 ///< Set the input comparator VIL threshold to 34% of  
                                          ///< VIO.                                              
#define PC0TH_PCTHRESLO__38_PERCENT  0x30 ///< Set the input comparator VIL threshold to 38% of  
                                          ///< VIO.                                              
                                                                                                 
#define PC0TH_PCTTHRESHI__FMASK      0xC0 ///< Input Comparator VIH Threshold                    
#define PC0TH_PCTTHRESHI__SHIFT      0x06 ///< Input Comparator VIH Threshold                    
#define PC0TH_PCTTHRESHI__59_PERCENT 0x00 ///< Set the input comparator VIH threshold to 59% of  
                                          ///< VIO.                                              
#define PC0TH_PCTTHRESHI__63_PERCENT 0x40 ///< Set the input comparator VIH threshold to 63% of  
                                          ///< VIO.                                              
#define PC0TH_PCTTHRESHI__50_PERCENT 0x80 ///< Set the input comparator VIH threshold to 50% of  
                                          ///< VIO.                                              
#define PC0TH_PCTTHRESHI__55_PERCENT 0xC0 ///< Set the input comparator VIH threshold to 55% of  
                                          ///< VIO.                                              
                                                                                                 
//------------------------------------------------------------------------------
// PCON Enums (Power Control @ 0x87)
//------------------------------------------------------------------------------
#define PCON_IDLE__BMASK  0x01 ///< Idle Mode Select                                
#define PCON_IDLE__SHIFT  0x00 ///< Idle Mode Select                                
#define PCON_IDLE__NORMAL 0x00 ///< Idle mode not activated.                        
#define PCON_IDLE__IDLE   0x01 ///< CPU goes into Idle mode (shuts off clock to CPU,
                               ///< but clocks to enabled peripherals are still     
                               ///< active).                                        
                                                                                    
