ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define PCON_STOP__BMASK  0x02 ///< Stop Mode Select                                
#define PCON_STOP__SHIFT  0x01 ///< Stop Mode Select                                
#define PCON_STOP__NORMAL 0x00 ///< Stop mode not activated.                        
#define PCON_STOP__STOP   0x02 ///< CPU goes into Stop mode (internal oscillator    
                               ///< stopped).                                       
                                                                                    
#define PCON_GF0__BMASK   0x04 ///< General Purpose Flag 0                          
#define PCON_GF0__SHIFT   0x02 ///< General Purpose Flag 0                          
#define PCON_GF0__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.    
#define PCON_GF0__SET     0x04 ///< The GF0 flag is set. Set the GF0 flag.          
                                                                                    
#define PCON_GF1__BMASK   0x08 ///< General Purpose Flag 1                          
#define PCON_GF1__SHIFT   0x03 ///< General Purpose Flag 1                          
#define PCON_GF1__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.    
#define PCON_GF1__SET     0x08 ///< The GF0 flag is set. Set the GF0 flag.          
                                                                                    
#define PCON_GF2__BMASK   0x10 ///< General Purpose Flag 2                          
#define PCON_GF2__SHIFT   0x04 ///< General Purpose Flag 2                          
#define PCON_GF2__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.    
#define PCON_GF2__SET     0x10 ///< The GF0 flag is set. Set the GF0 flag.          
                                                                                    
#define PCON_GF3__BMASK   0x20 ///< General Purpose Flag 3                          
#define PCON_GF3__SHIFT   0x05 ///< General Purpose Flag 3                          
#define PCON_GF3__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.    
#define PCON_GF3__SET     0x20 ///< The GF0 flag is set. Set the GF0 flag.          
                                                                                    
#define PCON_GF4__BMASK   0x40 ///< General Purpose Flag 4                          
#define PCON_GF4__SHIFT   0x06 ///< General Purpose Flag 4                          
#define PCON_GF4__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.    
#define PCON_GF4__SET     0x40 ///< The GF0 flag is set. Set the GF0 flag.          
                                                                                    
#define PCON_GF5__BMASK   0x80 ///< General Purpose Flag 5                          
#define PCON_GF5__SHIFT   0x07 ///< General Purpose Flag 5                          
#define PCON_GF5__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.    
#define PCON_GF5__SET     0x80 ///< The GF0 flag is set. Set the GF0 flag.          
                                                                                    
//------------------------------------------------------------------------------
// PMU0CF Enums (Power Management Unit Configuration @ 0xB5)
//------------------------------------------------------------------------------
#define PMU0CF_CPT0WK__BMASK    0x01 ///< Comparator0 Wake-up Source Enable and Flag        
#define PMU0CF_CPT0WK__SHIFT    0x00 ///< Comparator0 Wake-up Source Enable and Flag        
#define PMU0CF_CPT0WK__NOT_SET  0x00 ///< Comparator 0 rising edge did not cause the last   
                                     ///< wake-up.                                          
#define PMU0CF_CPT0WK__SET      0x01 ///< Comparator 0 rising edge caused the last wake-up. 
                                                                                            
#define PMU0CF_PMATWK__BMASK    0x02 ///< Port Match Wake-up Source Enable and Flag         
#define PMU0CF_PMATWK__SHIFT    0x01 ///< Port Match Wake-up Source Enable and Flag         
#define PMU0CF_PMATWK__NOT_SET  0x00 ///< A Port Match event did not cause the last wake-up.
#define PMU0CF_PMATWK__SET      0x02 ///< A Port Match event caused the last wake-up.       
                                                                                            
#define PMU0CF_RTCAWK__BMASK    0x04 ///< RTC Alarm Wake-up Source Enable and Flag          
#define PMU0CF_RTCAWK__SHIFT    0x02 ///< RTC Alarm Wake-up Source Enable and Flag          
#define PMU0CF_RTCAWK__NOT_SET  0x00 ///< A RTC Alarm did not cause the last wake-up.       
#define PMU0CF_RTCAWK__SET      0x04 ///< A RTC Alarm caused the last wake-up.              
                                                                                            
#define PMU0CF_RTCFWK__BMASK    0x08 ///< RTC Oscillator Fail Wake-up Source Enable and Flag
#define PMU0CF_RTCFWK__SHIFT    0x03 ///< RTC Oscillator Fail Wake-up Source Enable and Flag
#define PMU0CF_RTCFWK__NOT_SET  0x00 ///< An RTC oscillator fail event did not cause the    
                                     ///< last wake-up.                                     
#define PMU0CF_RTCFWK__SET      0x08 ///< An RTC oscillator fail event caused the last wake-
                                     ///< up.                                               
                                                                                            
#define PMU0CF_RSTWK__BMASK     0x10 ///< Reset Pin Wake-up Flag                            
#define PMU0CF_RSTWK__SHIFT     0x04 ///< Reset Pin Wake-up Flag                            
#define PMU0CF_RSTWK__NOT_SET   0x00 ///< No glitch detected on /RST.                       
#define PMU0CF_RSTWK__SET       0x10 ///< Glitch detected on /RST.                          
                                                                                            
#define PMU0CF_CLEAR__BMASK     0x20 ///< Wake-up Flag Clear                                
#define PMU0CF_CLEAR__SHIFT     0x05 ///< Wake-up Flag Clear                                
#define PMU0CF_CLEAR__ALL_FLAGS 0x20 ///< Clear all wake-up flags.                          
                                                                                            
#define PMU0CF_SUSPEND__BMASK   0x40 ///< Suspend Mode Select                               
#define PMU0CF_SUSPEND__SHIFT   0x06 ///< Suspend Mode Select                               
#define PMU0CF_SUSPEND__NORMAL  0x00 ///< Suspend mode not activated.                       
#define PMU0CF_SUSPEND__START   0x40 ///< Place the device in Suspend mode.                 
                                                                                            
#define PMU0CF_SLEEP__BMASK     0x80 ///< Sleep Mode Select                                 
#define PMU0CF_SLEEP__SHIFT     0x07 ///< Sleep Mode Select                                 
#define PMU0CF_SLEEP__NORMAL    0x00 ///< Sleep mode not activated.                         
#define PMU0CF_SLEEP__START     0x80 ///< Place the device in Sleep mode.                   
                                                                                            
//------------------------------------------------------------------------------
// PMU0FL Enums (Power Management Unit Flag @ 0xB6)
//------------------------------------------------------------------------------
#define PMU0FL_PC0WK__BMASK    0x01 ///< Pulse Counter Wake-up Source Enable and Flag      
#define PMU0FL_PC0WK__SHIFT    0x00 ///< Pulse Counter Wake-up Source Enable and Flag      
#define PMU0FL_PC0WK__NOT_SET  0x00 ///< A Pulse Counter event did not cause the last wake-
                                    ///< up.                                               
#define PMU0FL_PC0WK__SET      0x01 ///< A Pulse Counter event caused the last wake-up.    
                                                                                           
#define PMU0FL_BATMWK__BMASK   0x04 ///< VBAT Monitor Wake-up Source Enable and Flag       
#define PMU0FL_BATMWK__SHIFT   0x02 ///< VBAT Monitor Wake-up Source Enable and Flag       
#define PMU0FL_BATMWK__NOT_SET 0x00 ///< A VBAT Monitor event did not cause the last wake- 
                                    ///< up.                                               
#define PMU0FL_BATMWK__SET     0x04 ///< A VBAT Monitor event caused the last wake-up.     
                                                                                           
//------------------------------------------------------------------------------
// PMU0MD Enums (Power Management Unit Mode @ 0xB3)
//------------------------------------------------------------------------------
#define PMU0MD_MONDIS__BMASK    0x20 ///< POR Supply Monitor Disable         
#define PMU0MD_MONDIS__SHIFT    0x05 ///< POR Supply Monitor Disable         
#define PMU0MD_MONDIS__ENABLED  0x00 ///< Enable the POR supply monitor.     
#define PMU0MD_MONDIS__DISABLED 0x20 ///< Disable the POR supply monitor.    
                                                                             
#define PMU0MD_WAKEOE__BMASK    0x40 ///< Wakeup Request Output Enable       
#define PMU0MD_WAKEOE__SHIFT    0x06 ///< Wakeup Request Output Enable       
#define PMU0MD_WAKEOE__DISABLED 0x00 ///< Disable the wake-up request signal.
#define PMU0MD_WAKEOE__ENABLED  0x40 ///< Enable the wake-up request signal. 
                                                                             
#define PMU0MD_RTCOE__BMASK     0x80 ///< Buffered RTC Output Enable         
#define PMU0MD_RTCOE__SHIFT     0x07 ///< Buffered RTC Output Enable         
#define PMU0MD_RTCOE__DISABLED  0x00 ///< Disable the buffered RTC output.   
#define PMU0MD_RTCOE__ENABLED   0x80 ///< Enable the buffered RTC output.    
                                                                             
//------------------------------------------------------------------------------
// P0 Enums (Port 0 Pin Latch @ 0x80)
//------------------------------------------------------------------------------
#define P0_B0__BMASK 0x01 ///< Port 0 Bit 0 Latch                            
#define P0_B0__SHIFT 0x00 ///< Port 0 Bit 0 Latch                            
#define P0_B0__LOW   0x00 ///< P0.0 is low. Set P0.0 to drive low.           
#define P0_B0__HIGH  0x01 ///< P0.0 is high. Set P0.0 to drive or float high.
                                                                             
#define P0_B1__BMASK 0x02 ///< Port 0 Bit 1 Latch                            
#define P0_B1__SHIFT 0x01 ///< Port 0 Bit 1 Latch                            
#define P0_B1__LOW   0x00 ///< P0.1 is low. Set P0.1 to drive low.           
#define P0_B1__HIGH  0x02 ///< P0.1 is high. Set P0.1 to drive or float high.
                                                                             
