ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define P2SKIP_B5__BMASK       0x20 ///< Port 2 Bit 5 Skip                       
#define P2SKIP_B5__SHIFT       0x05 ///< Port 2 Bit 5 Skip                       
#define P2SKIP_B5__NOT_SKIPPED 0x00 ///< P2.5 pin is not skipped by the crossbar.
#define P2SKIP_B5__SKIPPED     0x20 ///< P2.5 pin is skipped by the crossbar.    
                                                                                 
#define P2SKIP_B6__BMASK       0x40 ///< Port 2 Bit 6 Skip                       
#define P2SKIP_B6__SHIFT       0x06 ///< Port 2 Bit 6 Skip                       
#define P2SKIP_B6__NOT_SKIPPED 0x00 ///< P2.6 pin is not skipped by the crossbar.
#define P2SKIP_B6__SKIPPED     0x40 ///< P2.6 pin is skipped by the crossbar.    
                                                                                 
#define P2SKIP_B7__BMASK       0x80 ///< Port 2 Bit 7 Skip                       
#define P2SKIP_B7__SHIFT       0x07 ///< Port 2 Bit 7 Skip                       
#define P2SKIP_B7__NOT_SKIPPED 0x00 ///< P2.7 pin is not skipped by the crossbar.
#define P2SKIP_B7__SKIPPED     0x80 ///< P2.7 pin is skipped by the crossbar.    
                                                                                 
//------------------------------------------------------------------------------
// P3 Enums (Port 3 Pin Latch @ 0xB0)
//------------------------------------------------------------------------------
#define P3_B0__BMASK 0x01 ///< Port 3 Bit 0 Latch                            
#define P3_B0__SHIFT 0x00 ///< Port 3 Bit 0 Latch                            
#define P3_B0__LOW   0x00 ///< P3.0 is low. Set P3.0 to drive low.           
#define P3_B0__HIGH  0x01 ///< P3.0 is high. Set P3.0 to drive or float high.
                                                                             
#define P3_B1__BMASK 0x02 ///< Port 3 Bit 1 Latch                            
#define P3_B1__SHIFT 0x01 ///< Port 3 Bit 1 Latch                            
#define P3_B1__LOW   0x00 ///< P3.1 is low. Set P3.1 to drive low.           
#define P3_B1__HIGH  0x02 ///< P3.1 is high. Set P3.1 to drive or float high.
                                                                             
#define P3_B2__BMASK 0x04 ///< Port 3 Bit 2 Latch                            
#define P3_B2__SHIFT 0x02 ///< Port 3 Bit 2 Latch                            
#define P3_B2__LOW   0x00 ///< P3.2 is low. Set P3.2 to drive low.           
#define P3_B2__HIGH  0x04 ///< P3.2 is high. Set P3.2 to drive or float high.
                                                                             
#define P3_B3__BMASK 0x08 ///< Port 3 Bit 3 Latch                            
#define P3_B3__SHIFT 0x03 ///< Port 3 Bit 3 Latch                            
#define P3_B3__LOW   0x00 ///< P3.3 is low. Set P3.3 to drive low.           
#define P3_B3__HIGH  0x08 ///< P3.3 is high. Set P3.3 to drive or float high.
                                                                             
#define P3_B4__BMASK 0x10 ///< Port 3 Bit 4 Latch                            
#define P3_B4__SHIFT 0x04 ///< Port 3 Bit 4 Latch                            
#define P3_B4__LOW   0x00 ///< P3.4 is low. Set P3.4 to drive low.           
#define P3_B4__HIGH  0x10 ///< P3.4 is high. Set P3.4 to drive or float high.
                                                                             
#define P3_B5__BMASK 0x20 ///< Port 3 Bit 5 Latch                            
#define P3_B5__SHIFT 0x05 ///< Port 3 Bit 5 Latch                            
#define P3_B5__LOW   0x00 ///< P3.5 is low. Set P3.5 to drive low.           
#define P3_B5__HIGH  0x20 ///< P3.5 is high. Set P3.5 to drive or float high.
                                                                             
#define P3_B6__BMASK 0x40 ///< Port 3 Bit 6 Latch                            
#define P3_B6__SHIFT 0x06 ///< Port 3 Bit 6 Latch                            
#define P3_B6__LOW   0x00 ///< P3.6 is low. Set P3.6 to drive low.           
#define P3_B6__HIGH  0x40 ///< P3.6 is high. Set P3.6 to drive or float high.
                                                                             
#define P3_B7__BMASK 0x80 ///< Port 3 Bit 7 Latch                            
#define P3_B7__SHIFT 0x07 ///< Port 3 Bit 7 Latch                            
#define P3_B7__LOW   0x00 ///< P3.7 is low. Set P3.7 to drive low.           
#define P3_B7__HIGH  0x80 ///< P3.7 is high. Set P3.7 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P3DRV Enums (Port 3 Drive Strength @ 0xA1)
//------------------------------------------------------------------------------
#define P3DRV_B0__BMASK      0x01 ///< Port 3 Bit 0 Drive Strength                
#define P3DRV_B0__SHIFT      0x00 ///< Port 3 Bit 0 Drive Strength                
#define P3DRV_B0__LOW_DRIVE  0x00 ///< P3.0 output has low output drive strength. 
#define P3DRV_B0__HIGH_DRIVE 0x01 ///< P3.0 output has high output drive strength.
                                                                                  
#define P3DRV_B1__BMASK      0x02 ///< Port 3 Bit 1 Drive Strength                
#define P3DRV_B1__SHIFT      0x01 ///< Port 3 Bit 1 Drive Strength                
#define P3DRV_B1__LOW_DRIVE  0x00 ///< P3.1 output has low output drive strength. 
#define P3DRV_B1__HIGH_DRIVE 0x02 ///< P3.1 output has high output drive strength.
                                                                                  
#define P3DRV_B2__BMASK      0x04 ///< Port 3 Bit 2 Drive Strength                
#define P3DRV_B2__SHIFT      0x02 ///< Port 3 Bit 2 Drive Strength                
#define P3DRV_B2__LOW_DRIVE  0x00 ///< P3.2 output has low output drive strength. 
#define P3DRV_B2__HIGH_DRIVE 0x04 ///< P3.2 output has high output drive strength.
                                                                                  
#define P3DRV_B3__BMASK      0x08 ///< Port 3 Bit 3 Drive Strength                
#define P3DRV_B3__SHIFT      0x03 ///< Port 3 Bit 3 Drive Strength                
#define P3DRV_B3__LOW_DRIVE  0x00 ///< P3.3 output has low output drive strength. 
#define P3DRV_B3__HIGH_DRIVE 0x08 ///< P3.3 output has high output drive strength.
                                                                                  
#define P3DRV_B4__BMASK      0x10 ///< Port 3 Bit 4 Drive Strength                
#define P3DRV_B4__SHIFT      0x04 ///< Port 3 Bit 4 Drive Strength                
#define P3DRV_B4__LOW_DRIVE  0x00 ///< P3.4 output has low output drive strength. 
#define P3DRV_B4__HIGH_DRIVE 0x10 ///< P3.4 output has high output drive strength.
                                                                                  
#define P3DRV_B5__BMASK      0x20 ///< Port 3 Bit 5 Drive Strength                
#define P3DRV_B5__SHIFT      0x05 ///< Port 3 Bit 5 Drive Strength                
#define P3DRV_B5__LOW_DRIVE  0x00 ///< P3.5 output has low output drive strength. 
#define P3DRV_B5__HIGH_DRIVE 0x20 ///< P3.5 output has high output drive strength.
                                                                                  
#define P3DRV_B6__BMASK      0x40 ///< Port 3 Bit 6 Drive Strength                
#define P3DRV_B6__SHIFT      0x06 ///< Port 3 Bit 6 Drive Strength                
#define P3DRV_B6__LOW_DRIVE  0x00 ///< P3.6 output has low output drive strength. 
#define P3DRV_B6__HIGH_DRIVE 0x40 ///< P3.6 output has high output drive strength.
                                                                                  
#define P3DRV_B7__BMASK      0x80 ///< Port 3 Bit 7 Drive Strength                
#define P3DRV_B7__SHIFT      0x07 ///< Port 3 Bit 7 Drive Strength                
#define P3DRV_B7__LOW_DRIVE  0x00 ///< P3.7 output has low output drive strength. 
#define P3DRV_B7__HIGH_DRIVE 0x80 ///< P3.7 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P3MDIN Enums (Port 3 Input Mode @ 0xF1)
//------------------------------------------------------------------------------
#define P3MDIN_B0__BMASK   0x01 ///< Port 3 Bit 0 Input Mode                 
#define P3MDIN_B0__SHIFT   0x00 ///< Port 3 Bit 0 Input Mode                 
#define P3MDIN_B0__ANALOG  0x00 ///< P3.0 pin is configured for analog mode. 
#define P3MDIN_B0__DIGITAL 0x01 ///< P3.0 pin is configured for digital mode.
                                                                             
#define P3MDIN_B1__BMASK   0x02 ///< Port 3 Bit 1 Input Mode                 
#define P3MDIN_B1__SHIFT   0x01 ///< Port 3 Bit 1 Input Mode                 
#define P3MDIN_B1__ANALOG  0x00 ///< P3.1 pin is configured for analog mode. 
#define P3MDIN_B1__DIGITAL 0x02 ///< P3.1 pin is configured for digital mode.
                                                                             
#define P3MDIN_B2__BMASK   0x04 ///< Port 3 Bit 2 Input Mode                 
#define P3MDIN_B2__SHIFT   0x02 ///< Port 3 Bit 2 Input Mode                 
#define P3MDIN_B2__ANALOG  0x00 ///< P3.2 pin is configured for analog mode. 
#define P3MDIN_B2__DIGITAL 0x04 ///< P3.2 pin is configured for digital mode.
                                                                             
#define P3MDIN_B3__BMASK   0x08 ///< Port 3 Bit 3 Input Mode                 
#define P3MDIN_B3__SHIFT   0x03 ///< Port 3 Bit 3 Input Mode                 
#define P3MDIN_B3__ANALOG  0x00 ///< P3.3 pin is configured for analog mode. 
#define P3MDIN_B3__DIGITAL 0x08 ///< P3.3 pin is configured for digital mode.
                                                                             
