ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define P6MDIN_B5__BMASK   0x20 ///< Port 6 Bit 5 Input Mode                 
#define P6MDIN_B5__SHIFT   0x05 ///< Port 6 Bit 5 Input Mode                 
#define P6MDIN_B5__ANALOG  0x00 ///< P6.5 pin is configured for analog mode. 
#define P6MDIN_B5__DIGITAL 0x20 ///< P6.5 pin is configured for digital mode.
                                                                             
#define P6MDIN_B6__BMASK   0x40 ///< Port 6 Bit 6 Input Mode                 
#define P6MDIN_B6__SHIFT   0x06 ///< Port 6 Bit 6 Input Mode                 
#define P6MDIN_B6__ANALOG  0x00 ///< P6.6 pin is configured for analog mode. 
#define P6MDIN_B6__DIGITAL 0x40 ///< P6.6 pin is configured for digital mode.
                                                                             
#define P6MDIN_B7__BMASK   0x80 ///< Port 6 Bit 7 Input Mode                 
#define P6MDIN_B7__SHIFT   0x07 ///< Port 6 Bit 7 Input Mode                 
#define P6MDIN_B7__ANALOG  0x00 ///< P6.7 pin is configured for analog mode. 
#define P6MDIN_B7__DIGITAL 0x80 ///< P6.7 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// P6MDOUT Enums (Port 6 Output Mode @ 0xFB)
//------------------------------------------------------------------------------
#define P6MDOUT_B0__BMASK      0x01 ///< Port 6 Bit 0 Output Mode  
#define P6MDOUT_B0__SHIFT      0x00 ///< Port 6 Bit 0 Output Mode  
#define P6MDOUT_B0__OPEN_DRAIN 0x00 ///< P6.0 output is open-drain.
#define P6MDOUT_B0__PUSH_PULL  0x01 ///< P6.0 output is push-pull. 
                                                                   
#define P6MDOUT_B1__BMASK      0x02 ///< Port 6 Bit 1 Output Mode  
#define P6MDOUT_B1__SHIFT      0x01 ///< Port 6 Bit 1 Output Mode  
#define P6MDOUT_B1__OPEN_DRAIN 0x00 ///< P6.1 output is open-drain.
#define P6MDOUT_B1__PUSH_PULL  0x02 ///< P6.1 output is push-pull. 
                                                                   
#define P6MDOUT_B2__BMASK      0x04 ///< Port 6 Bit 2 Output Mode  
#define P6MDOUT_B2__SHIFT      0x02 ///< Port 6 Bit 2 Output Mode  
#define P6MDOUT_B2__OPEN_DRAIN 0x00 ///< P6.2 output is open-drain.
#define P6MDOUT_B2__PUSH_PULL  0x04 ///< P6.2 output is push-pull. 
                                                                   
#define P6MDOUT_B3__BMASK      0x08 ///< Port 6 Bit 3 Output Mode  
#define P6MDOUT_B3__SHIFT      0x03 ///< Port 6 Bit 3 Output Mode  
#define P6MDOUT_B3__OPEN_DRAIN 0x00 ///< P6.3 output is open-drain.
#define P6MDOUT_B3__PUSH_PULL  0x08 ///< P6.3 output is push-pull. 
                                                                   
#define P6MDOUT_B4__BMASK      0x10 ///< Port 6 Bit 4 Output Mode  
#define P6MDOUT_B4__SHIFT      0x04 ///< Port 6 Bit 4 Output Mode  
#define P6MDOUT_B4__OPEN_DRAIN 0x00 ///< P6.4 output is open-drain.
#define P6MDOUT_B4__PUSH_PULL  0x10 ///< P6.4 output is push-pull. 
                                                                   
#define P6MDOUT_B5__BMASK      0x20 ///< Port 6 Bit 5 Output Mode  
#define P6MDOUT_B5__SHIFT      0x05 ///< Port 6 Bit 5 Output Mode  
#define P6MDOUT_B5__OPEN_DRAIN 0x00 ///< P6.5 output is open-drain.
#define P6MDOUT_B5__PUSH_PULL  0x20 ///< P6.5 output is push-pull. 
                                                                   
#define P6MDOUT_B6__BMASK      0x40 ///< Port 6 Bit 6 Output Mode  
#define P6MDOUT_B6__SHIFT      0x06 ///< Port 6 Bit 6 Output Mode  
#define P6MDOUT_B6__OPEN_DRAIN 0x00 ///< P6.6 output is open-drain.
#define P6MDOUT_B6__PUSH_PULL  0x40 ///< P6.6 output is push-pull. 
                                                                   
#define P6MDOUT_B7__BMASK      0x80 ///< Port 6 Bit 7 Output Mode  
#define P6MDOUT_B7__SHIFT      0x07 ///< Port 6 Bit 7 Output Mode  
#define P6MDOUT_B7__OPEN_DRAIN 0x00 ///< P6.7 output is open-drain.
#define P6MDOUT_B7__PUSH_PULL  0x80 ///< P6.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P7 Enums (Port 7 Pin Latch @ 0xDC)
//------------------------------------------------------------------------------
#define P7_B0__BMASK 0x01 ///< Port 7 Bit 0 Latch                            
#define P7_B0__SHIFT 0x00 ///< Port 7 Bit 0 Latch                            
#define P7_B0__LOW   0x00 ///< P7.0 is low. Set P7.0 to drive low.           
#define P7_B0__HIGH  0x01 ///< P7.0 is high. Set P7.0 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P7DRV Enums (Port 7 Drive Strength @ 0xAB)
//------------------------------------------------------------------------------
#define P7DRV_B0__BMASK      0x01 ///< Port 7 Bit 0 Drive Strength                
#define P7DRV_B0__SHIFT      0x00 ///< Port 7 Bit 0 Drive Strength                
#define P7DRV_B0__LOW_DRIVE  0x00 ///< P7.0 output has low output drive strength. 
#define P7DRV_B0__HIGH_DRIVE 0x01 ///< P7.0 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P7MDOUT Enums (Port 7 Output Mode @ 0xFC)
//------------------------------------------------------------------------------
#define P7MDOUT_B0__BMASK      0x01 ///< Port 7 Bit 0 Output Mode  
#define P7MDOUT_B0__SHIFT      0x00 ///< Port 7 Bit 0 Output Mode  
#define P7MDOUT_B0__OPEN_DRAIN 0x00 ///< P7.0 output is open-drain.
#define P7MDOUT_B0__PUSH_PULL  0x01 ///< P7.0 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// RSTSRC Enums (Reset Source @ 0xEF)
//------------------------------------------------------------------------------
#define RSTSRC_PINRSF__BMASK   0x01 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__SHIFT   0x00 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__NOT_SET 0x00 ///< The /RST pin did not cause the last reset.                           
#define RSTSRC_PINRSF__SET     0x01 ///< The /RST pin caused the last reset.                                  
                                                                                                              
#define RSTSRC_PORSF__BMASK    0x02 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__SHIFT    0x01 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__NOT_SET  0x00 ///< A power-on or supply monitor reset did not occur.                    
#define RSTSRC_PORSF__SET      0x02 ///< A power-on or supply monitor reset occurred.                         
                                                                                                              
