ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define RSTSRC_MCDRSF__BMASK   0x04 ///< Missing Clock Detector Enable and Flag                               
#define RSTSRC_MCDRSF__SHIFT   0x02 ///< Missing Clock Detector Enable and Flag                               
#define RSTSRC_MCDRSF__NOT_SET 0x00 ///< A missing clock detector reset did not occur.                        
#define RSTSRC_MCDRSF__SET     0x04 ///< A missing clock detector reset occurred.                             
                                                                                                              
#define RSTSRC_WDTRSF__BMASK   0x08 ///< Watchdog Timer Reset Flag                                            
#define RSTSRC_WDTRSF__SHIFT   0x03 ///< Watchdog Timer Reset Flag                                            
#define RSTSRC_WDTRSF__NOT_SET 0x00 ///< A watchdog timer overflow reset did not occur.                       
#define RSTSRC_WDTRSF__SET     0x08 ///< A watchdog timer overflow reset occurred.                            
                                                                                                              
#define RSTSRC_SWRSF__BMASK    0x10 ///< Software Reset Force and Flag                                        
#define RSTSRC_SWRSF__SHIFT    0x04 ///< Software Reset Force and Flag                                        
#define RSTSRC_SWRSF__NOT_SET  0x00 ///< A software reset did not occur.                                      
#define RSTSRC_SWRSF__SET      0x10 ///< A software reset occurred.                                           
                                                                                                              
#define RSTSRC_C0RSEF__BMASK   0x20 ///< Comparator0 Reset Enable and Flag                                    
#define RSTSRC_C0RSEF__SHIFT   0x05 ///< Comparator0 Reset Enable and Flag                                    
#define RSTSRC_C0RSEF__NOT_SET 0x00 ///< A Comparator 0 reset did not occur.                                  
#define RSTSRC_C0RSEF__SET     0x20 ///< A Comparator 0 reset occurred.                                       
                                                                                                              
#define RSTSRC_FERROR__BMASK   0x40 ///< Flash Error Reset Flag                                               
#define RSTSRC_FERROR__SHIFT   0x06 ///< Flash Error Reset Flag                                               
#define RSTSRC_FERROR__NOT_SET 0x00 ///< A flash error reset did not occur.                                   
#define RSTSRC_FERROR__SET     0x40 ///< A flash error reset occurred.                                        
                                                                                                              
#define RSTSRC_RTC0RE__BMASK   0x80 ///< RTC Reset Enable and Flag                                            
#define RSTSRC_RTC0RE__SHIFT   0x07 ///< RTC Reset Enable and Flag                                            
#define RSTSRC_RTC0RE__NOT_SET 0x00 ///< A RTC alarm or oscillator fail reset did not                         
                                    ///< occur.                                                               
#define RSTSRC_RTC0RE__SET     0x80 ///< A RTC alarm or oscillator fail reset occurred.                       
                                                                                                              
//------------------------------------------------------------------------------
// ALARM0B0 Enums (RTC Alarm 0 Programmed Value 0 @ 0x08)
//------------------------------------------------------------------------------
#define ALARM0B0_ALARM0B0__FMASK 0xFF ///< RTC Alarm 0 Programmed Value 0
#define ALARM0B0_ALARM0B0__SHIFT 0x00 ///< RTC Alarm 0 Programmed Value 0
                                                                         
//------------------------------------------------------------------------------
// ALARM0B1 Enums (RTC Alarm 0 Programmed Value 1 @ 0x09)
//------------------------------------------------------------------------------
#define ALARM0B1_ALARM0B1__FMASK 0xFF ///< RTC Alarm 0 Programmed Value 1
#define ALARM0B1_ALARM0B1__SHIFT 0x00 ///< RTC Alarm 0 Programmed Value 1
                                                                         
//------------------------------------------------------------------------------
// ALARM0B2 Enums (RTC Alarm 0 Programmed Value 2 @ 0x0A)
//------------------------------------------------------------------------------
#define ALARM0B2_ALARM0B2__FMASK 0xFF ///< RTC Alarm 0 Programmed Value 2
#define ALARM0B2_ALARM0B2__SHIFT 0x00 ///< RTC Alarm 0 Programmed Value 2
                                                                         
//------------------------------------------------------------------------------
// ALARM0B3 Enums (RTC Alarm 0 Programmed Value 3 @ 0x0B)
//------------------------------------------------------------------------------
#define ALARM0B3_ALARM0B3__FMASK 0xFF ///< RTC Alarm 0 Programmed Value 3
#define ALARM0B3_ALARM0B3__SHIFT 0x00 ///< RTC Alarm 0 Programmed Value 3
                                                                         
//------------------------------------------------------------------------------
// ALARM1B0 Enums (RTC Alarm 1 Programmed Value 0 @ 0x0C)
//------------------------------------------------------------------------------
#define ALARM1B0_ALARM1B0__FMASK 0xFF ///< RTC Alarm 1 Programmed Value 0
#define ALARM1B0_ALARM1B0__SHIFT 0x00 ///< RTC Alarm 1 Programmed Value 0
                                                                         
//------------------------------------------------------------------------------
// ALARM1B1 Enums (RTC Alarm 1 Programmed Value 1 @ 0x0D)
//------------------------------------------------------------------------------
#define ALARM1B1_ALARM1B1__FMASK 0xFF ///< RTC Alarm 1 Programmed Value 1
#define ALARM1B1_ALARM1B1__SHIFT 0x00 ///< RTC Alarm 1 Programmed Value 1
                                                                         
//------------------------------------------------------------------------------
// ALARM1B2 Enums (RTC Alarm 1 Programmed Value 2 @ 0x0E)
//------------------------------------------------------------------------------
#define ALARM1B2_ALARM1B2__FMASK 0xFF ///< RTC Alarm 1 Programmed Value 2
#define ALARM1B2_ALARM1B2__SHIFT 0x00 ///< RTC Alarm 1 Programmed Value 2
                                                                         
//------------------------------------------------------------------------------
// ALARM1B3 Enums (RTC Alarm 1 Programmed Value 3 @ 0x0F)
//------------------------------------------------------------------------------
#define ALARM1B3_ALARM1B3__FMASK 0xFF ///< RTC Alarm 1 Programmed Value 3
#define ALARM1B3_ALARM1B3__SHIFT 0x00 ///< RTC Alarm 1 Programmed Value 3
                                                                         
//------------------------------------------------------------------------------
// ALARM2B0 Enums (RTC Alarm 2 Programmed Value 0 @ 0x10)
//------------------------------------------------------------------------------
#define ALARM2B0_ALARM2B0__FMASK 0xFF ///< RTC Alarm 2 Programmed Value 0
#define ALARM2B0_ALARM2B0__SHIFT 0x00 ///< RTC Alarm 2 Programmed Value 0
                                                                         
//------------------------------------------------------------------------------
// ALARM2B1 Enums (RTC Alarm 2 Programmed Value 1 @ 0x11)
//------------------------------------------------------------------------------
#define ALARM2B1_ALARM2B1__FMASK 0xFF ///< RTC Alarm 2 Programmed Value 1
#define ALARM2B1_ALARM2B1__SHIFT 0x00 ///< RTC Alarm 2 Programmed Value 1
                                                                         
//------------------------------------------------------------------------------
// ALARM2B2 Enums (RTC Alarm 2 Programmed Value 2 @ 0x12)
//------------------------------------------------------------------------------
#define ALARM2B2_ALARM2B2__FMASK 0xFF ///< RTC Alarm 2 Programmed Value 2
#define ALARM2B2_ALARM2B2__SHIFT 0x00 ///< RTC Alarm 2 Programmed Value 2
                                                                         
//------------------------------------------------------------------------------
// ALARM2B3 Enums (RTC Alarm 2 Programmed Value 3 @ 0x13)
//------------------------------------------------------------------------------
#define ALARM2B3_ALARM2B3__FMASK 0xFF ///< RTC Alarm 2 Programmed Value 3
#define ALARM2B3_ALARM2B3__SHIFT 0x00 ///< RTC Alarm 2 Programmed Value 3
                                                                         
//------------------------------------------------------------------------------
// CAPTURE0 Enums (RTC Timer Capture 0 @ 0x00)
//------------------------------------------------------------------------------
#define CAPTURE0_CAPTURE0__FMASK 0xFF ///< RTC Timer Capture 0
#define CAPTURE0_CAPTURE0__SHIFT 0x00 ///< RTC Timer Capture 0
                                                              
//------------------------------------------------------------------------------
// CAPTURE1 Enums (RTC Timer Capture 1 @ 0x01)
//------------------------------------------------------------------------------
#define CAPTURE1_CAPTURE1__FMASK 0xFF ///< RTC Timer Capture 1
#define CAPTURE1_CAPTURE1__SHIFT 0x00 ///< RTC Timer Capture 1
                                                              
//------------------------------------------------------------------------------
// CAPTURE2 Enums (RTC Timer Capture 2 @ 0x02)
//------------------------------------------------------------------------------
#define CAPTURE2_CAPTURE2__FMASK 0xFF ///< RTC Timer Capture 2
#define CAPTURE2_CAPTURE2__SHIFT 0x00 ///< RTC Timer Capture 2
                                                              
//------------------------------------------------------------------------------
// CAPTURE3 Enums (RTC Timer Capture 3 @ 0x03)
//------------------------------------------------------------------------------
#define CAPTURE3_CAPTURE3__FMASK 0xFF ///< RTC Timer Capture 3
#define CAPTURE3_CAPTURE3__SHIFT 0x00 ///< RTC Timer Capture 3
                                                              
//------------------------------------------------------------------------------
// RTC0ADR Enums (RTC Address @ 0xAC)
//------------------------------------------------------------------------------
#define RTC0ADR_ADDR__FMASK      0x1F ///< RTC Indirect Register Address                     
#define RTC0ADR_ADDR__SHIFT      0x00 ///< RTC Indirect Register Address                     
#define RTC0ADR_ADDR__CAPTURE0   0x00 ///< Select the CAPTURE0 register.                     
#define RTC0ADR_ADDR__CAPTURE1   0x01 ///< Select the CAPTURE1 register.                     
#define RTC0ADR_ADDR__CAPTURE2   0x02 ///< Select the CAPTURE2 register.                     
#define RTC0ADR_ADDR__CAPTURE3   0x03 ///< Select the CAPTURE3 register.                     
#define RTC0ADR_ADDR__RTC0CN     0x04 ///< Select the RTC0CN register.                       
#define RTC0ADR_ADDR__RTC0XCN    0x05 ///< Select the RTC0XCN register.                      
#define RTC0ADR_ADDR__RTC0XCF    0x06 ///< Select the RTC0XCF register.                      
#define RTC0ADR_ADDR__RTC0CF     0x07 ///< Select the RTC0CF register.                       
#define RTC0ADR_ADDR__ALARM1B0   0x0C ///< Select the Alarm 1 Byte 0 register.               
#define RTC0ADR_ADDR__ALARM1B1   0x0D ///< Select the Alarm 1 Byte 1 register.               
#define RTC0ADR_ADDR__ALARM1B2   0x0E ///< Select the Alarm 1 Byte 2 register.               
#define RTC0ADR_ADDR__ALARM1B3   0x0F ///< Select the Alarm 1 Byte 3 register.               
#define RTC0ADR_ADDR__ALARM2B0   0x10 ///< Select the Alarm 2 Byte 0 register.               
#define RTC0ADR_ADDR__ALARM2B1   0x11 ///< Select the Alarm 2 Byte 1 register.               
#define RTC0ADR_ADDR__ALARM2B2   0x12 ///< Select the Alarm 2 Byte 2 register.               
#define RTC0ADR_ADDR__ALARM2B3   0x13 ///< Select the Alarm 2 Byte 3 register.               
                                                                                             
#define RTC0ADR_AUTORD__BMASK    0x40 ///< RTC Interface Autoread Enable                     
#define RTC0ADR_AUTORD__SHIFT    0x06 ///< RTC Interface Autoread Enable                     
#define RTC0ADR_AUTORD__DISABLED 0x00 ///< Disable autoread. Firmware must write the BUSY bit
                                      ///< for each RTC indirect read operation.             
#define RTC0ADR_AUTORD__ENABLED  0x40 ///< Enable autoread. The next RTC indirect read       
                                      ///< operation is initiated when firmware reads the    
                                      ///< RTC0DAT register.                                 
                                                                                             
//------------------------------------------------------------------------------
// RTC0CF Enums (RTC Configuration @ 0x07)
//------------------------------------------------------------------------------
#define RTC0CF_ALRM0EN__BMASK    0x01 ///< Alarm 0 Enable                                 
#define RTC0CF_ALRM0EN__SHIFT    0x00 ///< Alarm 0 Enable                                 
#define RTC0CF_ALRM0EN__DISABLED 0x00 ///< Disable Alarm 0.                               
#define RTC0CF_ALRM0EN__ENABLED  0x01 ///< Enable Alarm 0.                                
                                                                                          
#define RTC0CF_ALRM1EN__BMASK    0x02 ///< Alarm 1 Enable                                 
#define RTC0CF_ALRM1EN__SHIFT    0x01 ///< Alarm 1 Enable                                 
#define RTC0CF_ALRM1EN__DISABLED 0x00 ///< Disable Alarm 1.                               
#define RTC0CF_ALRM1EN__ENABLED  0x02 ///< Enable Alarm 1.                                
                                                                                          
