ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define RTC0CF_ALRM2EN__BMASK    0x04 ///< Alarm 2 Enable                                 
#define RTC0CF_ALRM2EN__SHIFT    0x02 ///< Alarm 2 Enable                                 
#define RTC0CF_ALRM2EN__DISABLED 0x00 ///< Disable Alarm 2.                               
#define RTC0CF_ALRM2EN__ENABLED  0x04 ///< Enable Alarm 2.                                
                                                                                          
#define RTC0CF_AUTORST__BMASK    0x08 ///< Auto Reset Enable                              
#define RTC0CF_AUTORST__SHIFT    0x03 ///< Auto Reset Enable                              
#define RTC0CF_AUTORST__DISABLED 0x00 ///< Disable auto reset.                            
#define RTC0CF_AUTORST__ENABLED  0x08 ///< Enable auto reset.                             
                                                                                          
#define RTC0CF_ALRM0__BMASK      0x10 ///< Event Flag for Alarm 0                         
#define RTC0CF_ALRM0__SHIFT      0x04 ///< Event Flag for Alarm 0                         
#define RTC0CF_ALRM0__NOT_SET    0x00 ///< An Alarm 0 event has not occured since the last
                                      ///< time the flag was cleared.                     
#define RTC0CF_ALRM0__SET        0x10 ///< An Alarm 0 event has occured.                  
                                                                                          
#define RTC0CF_ALRM1__BMASK      0x20 ///< Event Flag for Alarm 1                         
#define RTC0CF_ALRM1__SHIFT      0x05 ///< Event Flag for Alarm 1                         
#define RTC0CF_ALRM1__NOT_SET    0x00 ///< An Alarm 1 event has not occured since the last
                                      ///< time the flag was cleared.                     
#define RTC0CF_ALRM1__SET        0x20 ///< An Alarm 1 event has occured.                  
                                                                                          
#define RTC0CF_ALRM2__BMASK      0x40 ///< Event Flag for Alarm 2                         
#define RTC0CF_ALRM2__SHIFT      0x06 ///< Event Flag for Alarm 2                         
#define RTC0CF_ALRM2__NOT_SET    0x00 ///< An Alarm 2 event has not occured since the last
                                      ///< time the flag was cleared.                     
#define RTC0CF_ALRM2__SET        0x40 ///< An Alarm 2 event has occured.                  
                                                                                          
//------------------------------------------------------------------------------
// RTC0CN Enums (RTC Control @ 0x04)
//------------------------------------------------------------------------------
#define RTC0CN_RTC0CAP__BMASK    0x01 ///< RTC Timer Capture                          
#define RTC0CN_RTC0CAP__SHIFT    0x00 ///< RTC Timer Capture                          
#define RTC0CN_RTC0CAP__NOT_SET  0x00 ///< Do not start a capture operation.          
#define RTC0CN_RTC0CAP__SET      0x01 ///< Start a capture operation.                 
                                                                                      
#define RTC0CN_RTC0SET__BMASK    0x02 ///< RTC Timer Set                              
#define RTC0CN_RTC0SET__SHIFT    0x01 ///< RTC Timer Set                              
#define RTC0CN_RTC0SET__NOT_SET  0x00 ///< Do not start a set operation.              
#define RTC0CN_RTC0SET__SET      0x02 ///< Start a set operation.                     
                                                                                      
#define RTC0CN_HSMODE__BMASK     0x04 ///< High Speed Mode Enable                     
#define RTC0CN_HSMODE__SHIFT     0x02 ///< High Speed Mode Enable                     
#define RTC0CN_HSMODE__DISABLED  0x00 ///< Disable high speed mode.                   
#define RTC0CN_HSMODE__ENABLED   0x04 ///< Enable high speed mode.                    
                                                                                      
#define RTC0CN_RTC0AEN__BMASK    0x08 ///< RTC Alarm Enable                           
#define RTC0CN_RTC0AEN__SHIFT    0x03 ///< RTC Alarm Enable                           
#define RTC0CN_RTC0AEN__DISABLED 0x00 ///< Disable RTC alarm.                         
#define RTC0CN_RTC0AEN__ENABLED  0x08 ///< Enable RTC alarm.                          
                                                                                      
#define RTC0CN_RTC0TR__BMASK     0x10 ///< RTC Timer Run Control                      
#define RTC0CN_RTC0TR__SHIFT     0x04 ///< RTC Timer Run Control                      
#define RTC0CN_RTC0TR__STOP      0x00 ///< RTC timer is stopped.                      
#define RTC0CN_RTC0TR__RUN       0x10 ///< RTC timer is running.                      
                                                                                      
#define RTC0CN_OSCFAIL__BMASK    0x20 ///< RTC Oscillator Fail Event Flag             
#define RTC0CN_OSCFAIL__SHIFT    0x05 ///< RTC Oscillator Fail Event Flag             
#define RTC0CN_OSCFAIL__NOT_SET  0x00 ///< Missing RTC detector timeout did not occur.
#define RTC0CN_OSCFAIL__SET      0x20 ///< Missing RTC detector timeout occurred.     
                                                                                      
#define RTC0CN_MCLKEN__BMASK     0x40 ///< Missing RTC Detector Enable                
#define RTC0CN_MCLKEN__SHIFT     0x06 ///< Missing RTC Detector Enable                
#define RTC0CN_MCLKEN__DISABLED  0x00 ///< Disable missing RTC detector.              
#define RTC0CN_MCLKEN__ENABLED   0x40 ///< Enable missing RTC detector.               
                                                                                      
#define RTC0CN_RTC0EN__BMASK     0x80 ///< RTC Enable                                 
#define RTC0CN_RTC0EN__SHIFT     0x07 ///< RTC Enable                                 
#define RTC0CN_RTC0EN__DISABLED  0x00 ///< Disable RTC oscillator.                    
#define RTC0CN_RTC0EN__ENABLED   0x80 ///< Enable RTC oscillator.                     
                                                                                      
//------------------------------------------------------------------------------
// RTC0DAT Enums (RTC Data @ 0xAD)
//------------------------------------------------------------------------------
#define RTC0DAT_RTC0DAT__FMASK 0xFF ///< RTC Data
#define RTC0DAT_RTC0DAT__SHIFT 0x00 ///< RTC Data
                                                 
//------------------------------------------------------------------------------
// RTC0KEY Enums (RTC Lock and Key @ 0xAE)
//------------------------------------------------------------------------------
#define RTC0KEY_RTC0ST__FMASK    0xFF ///< RTC Interface Status      
#define RTC0KEY_RTC0ST__SHIFT    0x00 ///< RTC Interface Status      
#define RTC0KEY_RTC0ST__UNLOCKED 0x02 ///< RTC Interface is unlocked.
                                                                     
//------------------------------------------------------------------------------
// RTC0XCF Enums (RTC Oscillator Configuration @ 0x06)
//------------------------------------------------------------------------------
#define RTC0XCF_LOADCAP__FMASK    0x0F ///< Load Capacitance Programmed Value                
#define RTC0XCF_LOADCAP__SHIFT    0x00 ///< Load Capacitance Programmed Value                
                                                                                             
#define RTC0XCF_LOADRDY__BMASK    0x40 ///< Load Capacitance Ready Indicator                 
#define RTC0XCF_LOADRDY__SHIFT    0x06 ///< Load Capacitance Ready Indicator                 
#define RTC0XCF_LOADRDY__NOT_SET  0x00 ///< Load capacitance is currently stepping.          
#define RTC0XCF_LOADRDY__SET      0x40 ///< Load capacitance has reached it programmed value.
                                                                                             
#define RTC0XCF_AUTOSTP__BMASK    0x80 ///< Automatic Load Capacitance Stepping Enable       
#define RTC0XCF_AUTOSTP__SHIFT    0x07 ///< Automatic Load Capacitance Stepping Enable       
#define RTC0XCF_AUTOSTP__DISABLED 0x00 ///< Disable load capacitance stepping.               
#define RTC0XCF_AUTOSTP__ENABLED  0x80 ///< Enable load capacitance stepping.                
                                                                                             
//------------------------------------------------------------------------------
// RTC0XCN Enums (RTC Oscillator Control @ 0x05)
//------------------------------------------------------------------------------
#define RTC0XCN_LFOEN__BMASK          0x08 ///< Low Frequency Oscillator Enable and Select        
#define RTC0XCN_LFOEN__SHIFT          0x03 ///< Low Frequency Oscillator Enable and Select        
#define RTC0XCN_LFOEN__DISABLED       0x00 ///< XMODE determines RTC oscillator source.           
#define RTC0XCN_LFOEN__ENABLED        0x08 ///< LFOSC enabled and selected as RTC oscillator      
                                           ///< source.                                           
                                                                                                  
#define RTC0XCN_CLKVLD__BMASK         0x10 ///< RTC Oscillator Crystal Valid Indicator            
#define RTC0XCN_CLKVLD__SHIFT         0x04 ///< RTC Oscillator Crystal Valid Indicator            
#define RTC0XCN_CLKVLD__NOT_SET       0x00 ///< Oscillation has not started or oscillation        
                                           ///< amplitude is too low to maintain oscillation.     
#define RTC0XCN_CLKVLD__SET           0x10 ///< Sufficient oscillation amplitude detected.        
                                                                                                  
#define RTC0XCN_BIASX2__BMASK         0x20 ///< RTC Oscillator Bias Double Enable                 
#define RTC0XCN_BIASX2__SHIFT         0x05 ///< RTC Oscillator Bias Double Enable                 
#define RTC0XCN_BIASX2__DISABLED      0x00 ///< Disable the Bias Double feature.                  
#define RTC0XCN_BIASX2__ENABLED       0x20 ///< Enable the Bias Double feature.                   
                                                                                                  
#define RTC0XCN_XMODE__BMASK          0x40 ///< RTC Oscillator Mode                               
#define RTC0XCN_XMODE__SHIFT          0x06 ///< RTC Oscillator Mode                               
#define RTC0XCN_XMODE__SELF_OSCILLATE 0x00 ///< Self-Oscillate Mode selected.                     
#define RTC0XCN_XMODE__CRYSTAL        0x40 ///< Crystal Mode selected.                            
                                                                                                  
#define RTC0XCN_AGCEN__BMASK          0x80 ///< RTC Oscillator Automatic Gain Control (AGC) Enable
#define RTC0XCN_AGCEN__SHIFT          0x07 ///< RTC Oscillator Automatic Gain Control (AGC) Enable
#define RTC0XCN_AGCEN__DISABLED       0x00 ///< Disable AGC.                                      
#define RTC0XCN_AGCEN__ENABLED        0x80 ///< Enable AGC.                                       
                                                                                                  
//------------------------------------------------------------------------------
// SMB0ADM Enums (SMBus 0 Slave Address Mask @ 0xF5)
//------------------------------------------------------------------------------
#define SMB0ADM_EHACK__BMASK             0x01 ///< Hardware Acknowledge Enable                     
#define SMB0ADM_EHACK__SHIFT             0x00 ///< Hardware Acknowledge Enable                     
#define SMB0ADM_EHACK__ADR_ACK_MANUAL    0x00 ///< Firmware must manually acknowledge all incoming 
                                              ///< address and data bytes.                         
#define SMB0ADM_EHACK__ADR_ACK_AUTOMATIC 0x01 ///< Automatic slave address recognition and hardware
                                              ///< acknowledge is enabled.                         
                                                                                                   
#define SMB0ADM_SLVM__FMASK              0xFE ///< SMBus Slave Address Mask                        
#define SMB0ADM_SLVM__SHIFT              0x01 ///< SMBus Slave Address Mask                        
                                                                                                   
//------------------------------------------------------------------------------
// SMB0ADR Enums (SMBus 0 Slave Address @ 0xF4)
//------------------------------------------------------------------------------
#define SMB0ADR_GC__BMASK      0x01 ///< General Call Address Enable        
#define SMB0ADR_GC__SHIFT      0x00 ///< General Call Address Enable        
#define SMB0ADR_GC__IGNORED    0x00 ///< General Call Address is ignored.   
#define SMB0ADR_GC__RECOGNIZED 0x01 ///< General Call Address is recognized.
                                                                            
#define SMB0ADR_SLV__FMASK     0xFE ///< SMBus Hardware Slave Address       
#define SMB0ADR_SLV__SHIFT     0x01 ///< SMBus Hardware Slave Address       
                                                                            
//------------------------------------------------------------------------------
// SMB0CF Enums (SMBus 0 Configuration @ 0xC1)
//------------------------------------------------------------------------------
#define SMB0CF_SMBCS__FMASK             0x03 ///< SMBus Clock Source Selection                     
#define SMB0CF_SMBCS__SHIFT             0x00 ///< SMBus Clock Source Selection                     
#define SMB0CF_SMBCS__TIMER0            0x00 ///< Timer 0 Overflow.                                
#define SMB0CF_SMBCS__TIMER1            0x01 ///< Timer 1 Overflow.                                
#define SMB0CF_SMBCS__TIMER2_HIGH       0x02 ///< Timer 2 High Byte Overflow.                      
#define SMB0CF_SMBCS__TIMER2_LOW        0x03 ///< Timer 2 Low Byte Overflow.                       
                                                                                                   
#define SMB0CF_SMBFTE__BMASK            0x04 ///< SMBus Free Timeout Detection Enable              
#define SMB0CF_SMBFTE__SHIFT            0x02 ///< SMBus Free Timeout Detection Enable              
#define SMB0CF_SMBFTE__FREE_TO_DISABLED 0x00 ///< Disable bus free timeouts.                       
#define SMB0CF_SMBFTE__FREE_TO_ENABLED  0x04 ///< Enable bus free timeouts. The bus the bus will be
                                             ///< considered free if SCL and SDA remain high for   
                                             ///< more than 10 SMBus clock source periods.         
                                                                                                   
#define SMB0CF_SMBTOE__BMASK            0x08 ///< SMBus SCL Timeout Detection Enable               
#define SMB0CF_SMBTOE__SHIFT            0x03 ///< SMBus SCL Timeout Detection Enable               
#define SMB0CF_SMBTOE__SCL_TO_DISABLED  0x00 ///< Disable SCL low timeouts.                        
#define SMB0CF_SMBTOE__SCL_TO_ENABLED   0x08 ///< Enable SCL low timeouts.                         
                                                                                                   
#define SMB0CF_EXTHOLD__BMASK           0x10 ///< SMBus Setup and Hold Time Extension Enable       
#define SMB0CF_EXTHOLD__SHIFT           0x04 ///< SMBus Setup and Hold Time Extension Enable       
#define SMB0CF_EXTHOLD__DISABLED        0x00 ///< Disable SDA extended setup and hold times.       
#define SMB0CF_EXTHOLD__ENABLED         0x10 ///< Enable SDA extended setup and hold times.        
                                                                                                   
#define SMB0CF_BUSY__BMASK              0x20 ///< SMBus Busy Indicator                             
#define SMB0CF_BUSY__SHIFT              0x05 ///< SMBus Busy Indicator                             
#define SMB0CF_BUSY__NOT_SET            0x00 ///< The bus is not busy.                             
#define SMB0CF_BUSY__SET                0x20 ///< The bus is busy and a transfer is currently in   
                                             ///< progress.                                        
                                                                                                   
#define SMB0CF_INH__BMASK               0x40 ///< SMBus Slave Inhibit                              
#define SMB0CF_INH__SHIFT               0x06 ///< SMBus Slave Inhibit                              
#define SMB0CF_INH__SLAVE_ENABLED       0x00 ///< Slave states are enabled.                        
#define SMB0CF_INH__SLAVE_DISABLED      0x40 ///< Slave states are inhibited.                      
                                                                                                   
#define SMB0CF_ENSMB__BMASK             0x80 ///< SMBus Enable                                     
#define SMB0CF_ENSMB__SHIFT             0x07 ///< SMBus Enable                                     
#define SMB0CF_ENSMB__DISABLED          0x00 ///< Disable the SMBus module.                        
#define SMB0CF_ENSMB__ENABLED           0x80 ///< Enable the SMBus module.                         
                                                                                                   
//------------------------------------------------------------------------------
// SMB0CN Enums (SMBus 0 Control @ 0xC0)
//------------------------------------------------------------------------------
#define SMB0CN_SI__BMASK           0x01 ///< SMBus Interrupt Flag                           
#define SMB0CN_SI__SHIFT           0x00 ///< SMBus Interrupt Flag                           
#define SMB0CN_SI__NOT_SET         0x00 ///<                                                
#define SMB0CN_SI__SET             0x01 ///<                                                
                                                                                            
#define SMB0CN_ACK__BMASK          0x02 ///< SMBus Acknowledge                              
#define SMB0CN_ACK__SHIFT          0x01 ///< SMBus Acknowledge                              
#define SMB0CN_ACK__NOT_SET        0x00 ///< Generate a NACK, or the response was a NACK.   
#define SMB0CN_ACK__SET            0x02 ///< Generate an ACK, or the response was an ACK.   
                                                                                            
#define SMB0CN_ARBLOST__BMASK      0x04 ///< SMBus Arbitration Lost Indicator               
#define SMB0CN_ARBLOST__SHIFT      0x02 ///< SMBus Arbitration Lost Indicator               
#define SMB0CN_ARBLOST__NOT_SET    0x00 ///< No arbitration error.                          
#define SMB0CN_ARBLOST__ERROR      0x04 ///< Arbitration error occurred.                    
                                                                                            
#define SMB0CN_ACKRQ__BMASK        0x08 ///< SMBus Acknowledge Request                      
#define SMB0CN_ACKRQ__SHIFT        0x03 ///< SMBus Acknowledge Request                      
#define SMB0CN_ACKRQ__NOT_SET      0x00 ///< No ACK requested.                              
#define SMB0CN_ACKRQ__REQUESTED    0x08 ///< ACK requested.                                 
                                                                                            
#define SMB0CN_STO__BMASK          0x10 ///< SMBus Stop Flag                                
#define SMB0CN_STO__SHIFT          0x04 ///< SMBus Stop Flag                                
#define SMB0CN_STO__NOT_SET        0x00 ///< A STOP is not pending.                         
#define SMB0CN_STO__SET            0x10 ///< Generate a STOP or a STOP is currently pending.
                                                                                            
#define SMB0CN_STA__BMASK          0x20 ///< SMBus Start Flag                               
#define SMB0CN_STA__SHIFT          0x05 ///< SMBus Start Flag                               
#define SMB0CN_STA__NOT_SET        0x00 ///< A START was not detected.                      
#define SMB0CN_STA__SET            0x20 ///< Generate a START, repeated START, or a START is
                                        ///< currently pending.                             
                                                                                            
