ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define TMR2CN_TR2__BMASK                     0x04 ///< Timer 2 Run Control                               
#define TMR2CN_TR2__SHIFT                     0x02 ///< Timer 2 Run Control                               
#define TMR2CN_TR2__STOP                      0x00 ///< Stop Timer 2.                                     
#define TMR2CN_TR2__RUN                       0x04 ///< Start Timer 2 running.                            
                                                                                                          
#define TMR2CN_T2SPLIT__BMASK                 0x08 ///< Timer 2 Split Mode Enable                         
#define TMR2CN_T2SPLIT__SHIFT                 0x03 ///< Timer 2 Split Mode Enable                         
#define TMR2CN_T2SPLIT__16_BIT_RELOAD         0x00 ///< Timer 2 operates in 16-bit auto-reload mode.      
#define TMR2CN_T2SPLIT__8_BIT_RELOAD          0x08 ///< Timer 2 operates as two 8-bit auto-reload timers. 
                                                                                                          
#define TMR2CN_TF2CEN__BMASK                  0x10 ///< Timer 2 Capture Enable                            
#define TMR2CN_TF2CEN__SHIFT                  0x04 ///< Timer 2 Capture Enable                            
#define TMR2CN_TF2CEN__DISABLED               0x00 ///< Disable capture mode.                             
#define TMR2CN_TF2CEN__ENABLED                0x10 ///< Enable capture mode.                              
                                                                                                          
#define TMR2CN_TF2LEN__BMASK                  0x20 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN_TF2LEN__SHIFT                  0x05 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN_TF2LEN__DISABLED               0x00 ///< Disable low byte interrupts.                      
#define TMR2CN_TF2LEN__ENABLED                0x20 ///< Enable low byte interrupts.                       
                                                                                                          
#define TMR2CN_TF2L__BMASK                    0x40 ///< Timer 2 Low Byte Overflow Flag                    
#define TMR2CN_TF2L__SHIFT                    0x06 ///< Timer 2 Low Byte Overflow Flag                    
#define TMR2CN_TF2L__NOT_SET                  0x00 ///< Timer 2 low byte did not overflow.                
#define TMR2CN_TF2L__SET                      0x40 ///< Timer 2 low byte overflowed.                      
                                                                                                          
#define TMR2CN_TF2H__BMASK                    0x80 ///< Timer 2 High Byte Overflow Flag                   
#define TMR2CN_TF2H__SHIFT                    0x07 ///< Timer 2 High Byte Overflow Flag                   
#define TMR2CN_TF2H__NOT_SET                  0x00 ///< Timer 2 8-bit high byte or 16-bit value did not   
                                                   ///< overflow.                                         
#define TMR2CN_TF2H__SET                      0x80 ///< Timer 2 8-bit high byte or 16-bit value           
                                                   ///< overflowed.                                       
                                                                                                          
//------------------------------------------------------------------------------
// TMR2H Enums (Timer 2 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR2H_TMR2H__FMASK 0xFF ///< Timer 2 High Byte
#define TMR2H_TMR2H__SHIFT 0x00 ///< Timer 2 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR2L Enums (Timer 2 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR2L_TMR2L__FMASK 0xFF ///< Timer 2 Low Byte
#define TMR2L_TMR2L__SHIFT 0x00 ///< Timer 2 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR2RLH Enums (Timer 2 Reload High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define TMR2RLH_TMR2RLH__FMASK 0xFF ///< Timer 2 Reload High Byte
#define TMR2RLH_TMR2RLH__SHIFT 0x00 ///< Timer 2 Reload High Byte
                                                                 
//------------------------------------------------------------------------------
// TMR2RLL Enums (Timer 2 Reload Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define TMR2RLL_TMR2RLL__FMASK 0xFF ///< Timer 2 Reload Low Byte
#define TMR2RLL_TMR2RLL__SHIFT 0x00 ///< Timer 2 Reload Low Byte
                                                                
//------------------------------------------------------------------------------
// TMR3CN Enums (Timer 3 Control @ 0x91)
//------------------------------------------------------------------------------
#define TMR3CN_T3XCLK__FMASK                    0x03 ///< Timer 3 External Clock Select                     
#define TMR3CN_T3XCLK__SHIFT                    0x00 ///< Timer 3 External Clock Select                     
#define TMR3CN_T3XCLK__SYSCLK_DIV_12_CAP_RTC    0x00 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                     ///< RTC.                                              
#define TMR3CN_T3XCLK__EXTOSC_DIV_8_CAP_RTC     0x01 ///< External Clock is External Oscillator/8. Capture  
                                                     ///< trigger is RTC.                                   
#define TMR3CN_T3XCLK__SYSCLK_DIV_12_CAP_EXTOSC 0x02 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                     ///< External Oscillator/8.                            
#define TMR3CN_T3XCLK__RTC_CAP_EXTOSC           0x03 ///< External Clock is RTC. Capture trigger is External
                                                     ///< Oscillator/8.                                     
                                                                                                            
