ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Register_Enums.h
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__CLEARED_TO_0     0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET_TO_1         0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__CLEARED_TO_0     0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET_TO_1         0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// VDM0CN Enums (VDD Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VBOKIE__BMASK            0x01 ///< VBAT Early Warning Interrupt Enable       
#define VDM0CN_VBOKIE__SHIFT            0x00 ///< VBAT Early Warning Interrupt Enable       
#define VDM0CN_VBOKIE__DISABLED         0x00 ///< Disable the VBAT Early Warning interrupt. 
#define VDM0CN_VBOKIE__ENABLED          0x01 ///< Enable the VBAT Early Warning interrupt.  
                                                                                            
#define VDM0CN_VBOK__BMASK              0x02 ///< VBAT Early Warning Status                 
#define VDM0CN_VBOK__SHIFT              0x01 ///< VBAT Early Warning Status                 
#define VDM0CN_VBOK__AT_OR_BELOW        0x00 ///< VBAT is at or below the VDDWARN threshold.
#define VDM0CN_VBOK__ABOVE              0x02 ///< VBAT is above the VDDWARN threshold.      
                                                                                            
#define VDM0CN_VBSTAT__BMASK            0x04 ///< VBAT Supply Status                        
#define VDM0CN_VBSTAT__SHIFT            0x02 ///< VBAT Supply Status                        
#define VDM0CN_VBSTAT__AT_OR_BELOW      0x00 ///< VBAT is at or below the VRST threshold.   
#define VDM0CN_VBSTAT__ABOVE            0x04 ///< VBAT is above the VRST threshold.         
                                                                                            
#define VDM0CN_VBMEN__BMASK             0x08 ///< VBAT Supply Monitor Enable                
#define VDM0CN_VBMEN__SHIFT             0x03 ///< VBAT Supply Monitor Enable                
#define VDM0CN_VBMEN__DISABLED          0x00 ///< Disable the VBAT Supply Monitor.          
#define VDM0CN_VBMEN__ENABLED           0x08 ///< Enable the VBAT Supply Monitor.           
                                                                                            
#define VDM0CN_VDDOKIE__BMASK           0x10 ///< Digital Early Warning Interrupt Enable    
#define VDM0CN_VDDOKIE__SHIFT           0x04 ///< Digital Early Warning Interrupt Enable    
#define VDM0CN_VDDOKIE__DISABLED        0x00 ///< Disable the VDD early warning interrupt.  
#define VDM0CN_VDDOKIE__ENABLED         0x10 ///< Enable the VDD early warning interrupt.   
                                                                                            
#define VDM0CN_VDDOK__BMASK             0x20 ///< VDD Supply Status (Early Warning)         
#define VDM0CN_VDDOK__SHIFT             0x05 ///< VDD Supply Status (Early Warning)         
#define VDM0CN_VDDOK__VDD_BELOW_VDDWARN 0x00 ///< VDD is at or below the VDDWARN threshold. 
#define VDM0CN_VDDOK__VDD_ABOVE_VDDWARN 0x20 ///< VDD is above the VDDWARN threshold.       
                                                                                            
#define VDM0CN_VDDSTAT__BMASK           0x40 ///< VDD Supply Status                         
#define VDM0CN_VDDSTAT__SHIFT           0x06 ///< VDD Supply Status                         
#define VDM0CN_VDDSTAT__VDD_BELOW_VRST  0x00 ///< VDD is at or below the VRST threshold.    
#define VDM0CN_VDDSTAT__VDD_ABOVE_VRST  0x40 ///< VDD is above the VRST threshold.          
                                                                                            
#define VDM0CN_VDMEN__BMASK             0x80 ///< VDD Supply Monitor Enable                 
#define VDM0CN_VDMEN__SHIFT             0x07 ///< VDD Supply Monitor Enable                 
#define VDM0CN_VDMEN__DISABLED          0x00 ///< Disable the VDD supply monitor.           
#define VDM0CN_VDMEN__ENABLED           0x80 ///< Enable the VDD supply monitor.            
                                                                                            
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_TEMPE__BMASK           0x04 ///< Temperature Sensor Enable                        
#define REF0CN_TEMPE__SHIFT           0x02 ///< Temperature Sensor Enable                        
#define REF0CN_TEMPE__TEMP_DISABLED   0x00 ///< Disable the Temperature Sensor.                  
#define REF0CN_TEMPE__TEMP_ENABLED    0x04 ///< Enable the Temperature Sensor.                   
                                                                                                 
#define REF0CN_REFSL__FMASK           0x18 ///< Voltage Reference Select                         
#define REF0CN_REFSL__SHIFT           0x03 ///< Voltage Reference Select                         
#define REF0CN_REFSL__VREF_PIN        0x00 ///< The ADC0 voltage reference is the P0.0/VREF pin. 
#define REF0CN_REFSL__VDD_PIN         0x08 ///< The ADC0 voltage reference is the VDD pin.       
#define REF0CN_REFSL__INTERNAL_LDO    0x10 ///< The ADC0 voltage reference is the internal 1.8 V 
                                           ///< digital supply voltage.                          
#define REF0CN_REFSL__HIGH_SPEED_VREF 0x18 ///< The ADC0 voltage reference is the internal 1.65 V
                                           ///< high speed voltage reference.                    
                                                                                                 
#define REF0CN_REFGND__BMASK          0x20 ///< Analog Ground Reference                          
#define REF0CN_REFGND__SHIFT          0x05 ///< Analog Ground Reference                          
#define REF0CN_REFGND__GND_PIN        0x00 ///< The ADC0 ground reference is the GND pin.        
#define REF0CN_REFGND__AGND_PIN       0x20 ///< The ADC0 ground reference is the P0.1/AGND pin.  
                                                                                                 
//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_OSCBIAS__BMASK    0x10 ///< High Frequency Oscillator Bias                 
#define REG0CN_OSCBIAS__SHIFT    0x04 ///< High Frequency Oscillator Bias                 
#define REG0CN_OSCBIAS__DISABLED 0x00 ///< Disable the precision High Frequency Oscillator
                                      ///< bias.                                          
#define REG0CN_OSCBIAS__ENABLED  0x10 ///< Enable the precision High Frequency Oscillator 
                                      ///< bias.                                          
                                                                                          
//------------------------------------------------------------------------------
// EMI0CF Enums (External Memory Configuration @ 0xAB)
//------------------------------------------------------------------------------
#define EMI0CF_EALE__FMASK                    0x03 ///< ALE Pulse-Width Select                            
#define EMI0CF_EALE__SHIFT                    0x00 ///< ALE Pulse-Width Select                            
#define EMI0CF_EALE__1_CLOCK                  0x00 ///< ALE high and ALE low pulse width = 1 SYSCLK cycle.
#define EMI0CF_EALE__2_CLOCKS                 0x01 ///< ALE high and ALE low pulse width = 2 SYSCLK       
                                                   ///< cycles.                                           
#define EMI0CF_EALE__3_CLOCKS                 0x02 ///< ALE high and ALE low pulse width = 3 SYSCLK       
                                                   ///< cycles.                                           
#define EMI0CF_EALE__4_CLOCKS                 0x03 ///< ALE high and ALE low pulse width = 4 SYSCLK       
                                                   ///< cycles.                                           
                                                                                                          
